["Install, Upgrade and Maintenance Guide for Cisco Unity Connection\nRelease 14\nFirst Published: 2020-11-19\nLast Modified: 2022-06-15\nAmericas Headquarters\nCisco Systems, Inc.\n170 West Tasman Drive\nSan Jose, CA 95134-1706\nUSA\nhttp://www.cisco.com\nTel: 408 526-4000\n800 553-NETS (6387)\nFax: 408 527-0883\n© 2021 Cisco Systems, Inc. All rights reserved.\nC O N T E N T S\nInstalling Cisco Unity Connection\n1\nC H A P T E R 1\nIntroduction\n1\nMethods of Installation\n1\nImportant Considerations for Installation\n2\nInstall with Data Import\n3\nPre-Installation Tasks\n4\nCreating a Virtual Machine\n5\nChanging the Boot Order of Virtual Machine\n6\nChanging Reservation on Virtual Machines Running with E7 or E5 Processors\n6\nChanging the Reservation Numbers\n6\nVerifying DNS Settings\n7\nGathering Information for Installation\n7\nInstallation Scenarios\n12\nInstallation Tasks\n12\nNavigating Within the Installation Wizard\n12\nInstalling the Publisher Server\n13\nConfiguring Subscriber Server on the Publisher Server\n16\nInstalling the Subscriber Server\n16\nGenerating Answer File for Unattended Installation\n17\nTask List for Unattended Installation\n18\nTouchless Installation for Virtual Machine\n19\nMethods for Touchless Installation\n19\nTask List for Touchless Installation\n20\n(Optional) Enabling Dynamic-Cluster-Configuration Using CLI\n20\nAutomated Installation using vApp properties and VMware OVF Tool\n21\nTask List for Manual Installation using vApp Options\n21\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\niii\nTask List for Touchless Installation using VM Tools\n22\nApplying a Patch\n23\nUpgrading from a Remote Server\n23\nUpgrading from a Local Disk\n25\nVerifying the Installation\n26\nCisco Unity Connection Survivable Remote Site Voicemail Installation\n27\nPost-Installation Tasks\n27\nPost-Migration Tasks\n28\nTroubleshooting Installation Issues\n30\nBacking Up and Restoring Cisco Unity Connection Components\n31\nC H A P T E R 2\nAbout Cobras\n31\nAbout Disaster Recovery System\n31\nComponents Supported for DRS Backup\n32\nBackup Files in DRS\n32\nConfiguring DRS Backup\n33\nConfiguring a Backup Schedule\n34\nConfiguring a Manual Backup\n35\nViewing the Backup Status\n35\nViewing the Backup History\n35\nConfiguring DRS Restore\n36\nViewing the Restore Status\n37\nViewing the Restore History\n37\nAbout System Restore Tool\n38\nTypes of System Restore Points\n38\nCreating a Restore Point task\n38\nEnabling Create Backup Restore Point\n39\nRestoring Data using Restore Points task\n39\nUpgrading Cisco Unity Connection\n41\nC H A P T E R 3\nIntroduction\n41\nUpgrade Types\n41\nStatus of Unity Connection Cluster During an Upgrade\n45\nDuration of Upgrade\n46\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\niv\nContents\nPrerequisites for Upgrade\n46\nUpgrade Considerations with FIPS Mode\n48\nTask list to Upgrade to Unity Connection Shipping Version 14\n49\nUpgrading the Unity Connection Server\n52\nSwitching to the Upgraded Version of Unity Connection Software\n54\nApplying COP file from a Network Location\n55\nRollback of Unity Connection\n56\nRollback Scenarios\n56\nRollback a Unity Connection Server to the Version in the Inactive Partition\n57\nConfiguring Cisco Unity Connection Cluster\n59\nC H A P T E R 4\nIntroduction\n59\nTask List for Configuring a Unity Connection Cluster\n59\nAdministering a Unity Connection Cluster\n60\nChecking the Cluster Status\n60\nSteps to Check Unity Connection Cluster Status from Command Line Interface (CLI)\n60\nManaging Messaging Ports in a Cluster\n60\nStopping All Ports from Taking New Calls\n62\nRestarting All Ports to Take Calls\n63\nServer Status and its Functions in a Unity Connection Cluster\n63\nChanging Server Status in a Cluster and its Effects\n65\nManually Changing the Server Status from Secondary to Primary\n65\nManually Changing from the Server Status from Secondary to Deactivated\n66\nManually Activating a Server with Deactivated Status\n66\nEffect on Calls in Progress When Server Status Changes in a Unity Connection Cluster\n66\nEffect on Unity Connection Web Applications When the Server Status Changes\n67\nEffect of Stopping a Critical Service on a Unity Connection Cluster\n67\nShutting Down a Server in a Cluster\n68\nReplacing Servers in a Cluster\n69\nHow a Unity Connection Cluster Works\n69\nEffects of Split Brain Condition in a Unity Connection Cluster\n71\nMaintaining Cisco Unity Connection Server\n73\nC H A P T E R 5\nMigrating a Physical Server to a Virtual Machine\n73\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\nv\nContents\nReplacing a Publisher Server\n74\nReplacing a Subscriber Server\n75\nReplacing the Non-Functional Server\n76\nChanging the IP Address or Hostname of a Unity Connection Server\n77\nDetermine Whether Unity Connection is Defined by Hostname or IP Address\n77\nImportant Considerations before Changing the Hostname or IP Address of a Unity Connection\nServer\n78\nChanging the IP Address or Hostname of a Unity Connection Server or Cluster\n79\nAdding or Removing Unity Connection Languages\n81\nTask List for Adding Languages to a Standalone Unity Connection Server\n81\nInstalling Unity Connection Language Files from Network Location or Remote Server\n82\nRemoving Unity Connection Language Files\n83\nManaging Licenses\n85\nC H A P T E R 6\nManaging Licenses\n85\nOverview\n85\nDeployment Options\n86\nSmart Account and Virtual Account\n86\nPrerequisites for Configuring Cisco Smart Software Licensing\n87\nConfiguring Cisco Smart Software Licensing in Unity Connection\n87\nConfiguring Transport Settings (optional)\n87\nToken Creation\n88\nRegistering the Unity Connection\n88\nManaging Cisco Smart Software Licensing\n89\nSmart Software Licensing Status\n89\nRegistration Status\n89\nAuthorization Status\n89\nLicense Reservation in Unity Connection\n90\nConfiguring Specific License Reservation in Unity Connection\n90\nConfiguring Permanent License Reservation in Unity Connection\n91\nLicense Reservation Status\n92\nEnforcement Policy on Unity Connection\n92\nLicenses in Unity Connection Cluster\n93\nMigrating Licenses\n94\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\nvi\nContents\nEnabling Encryption in Cisco Unity Connection\n94\nLicense Parameters for Unity Connection Features\n95\nManaging Cisco Unity Connection using Cisco Prime Collaboration\n97\nC H A P T E R 7\nManaging Cisco Unity Connection using Cisco Prime Collaboration\n97\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\nvii\nContents\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\nviii\nContents\nC H A P T E R 1\nInstalling Cisco Unity Connection\n• Introduction, on page 1\n• Methods of Installation, on page 1\n• Important Considerations for Installation, on page 2\n• Install with Data Import, on page 3\n• Pre-Installation Tasks, on page 4\n• Installation Scenarios, on page 12\n• Installation Tasks, on page 12\n• Post-Installation Tasks, on page 27\n• Post-Migration Tasks, on page 28\n• Troubleshooting Installation Issues, on page 30\nIntroduction\nCisco Unity Connection can be deployed in either of the following ways:\n• Standalone Deployment: Involves the installation of a Unity Connection as a single server.\n• Cluster Deployment: Involves the installation of same version of two Unity Connection servers in an\nactive-active or high availability mode. During the installation of Unity Connection as a cluster, the first\nserver is referred to as publisher server and the second server as the subscriber server. For more information\non cluster configuration, see the Introduction chapter.\nUnity Connection 10.0(1) and later releases can only be installed on virtual machines. For more information,\nsee the\nhttp://www.cisco.com/c/dam/en/us/td/docs/voice_ip_comm/uc_system/virtualization/virtualization-cisco-unity-connection.html.\nNote\nMethods of Installation\nYou can use either of the following methods to install standalone or cluster server:\n• Standard Installation: Allows you to manually specify the installation information, such as hostname\nand IP address using installation wizard.\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n1\n• Unattended Installation: Allows you to install Unity Connection using an installation disk and a\npre-configured answer file floppy diskette. The answer file has all the information required for unattended\ninstallation. Unattended installation is a seamless process of installation that allows you to start installation\non both the publisher and subscriber servers simultaneously. The subscriber installation continues when\nthe publisher is successfully installed. This type of unattended installation is Touchless Installation. For\nmore information on Touchless Installation, see the Touchless Installation for Virtual Machine.\n• You can also perform fresh installation of Unity Connection 14 and later\nusing Cisco Prime Collaboration Deployment. For more information on\nCisco PCD, see\nhttp://www\n.cisco.com/c/en/us/products/cloud-systems-management/prime-collaboration/index.html\n• The answer file supports only fresh installs and does not support upgrades.\nNote\n• Install with Data Import: Cisco Unity Connection 14SU1 and later releases, supports installation of\nUnity Connection along with the data import from the previous releases. It involves migration of data\nby exporting source release data to SFTP server, and installing a new machine with import of that data.\nExamples of data that you can export and import are component specific configurations files, voicemails,\nDB related files, platform provision data and platform files like certificates. For more details, see Install\nwith Data Import section.\n• Automated Installation using vApp properties and VMware OVF Tool: Cisco Unity Connection\n14SU2 and later releases, supports automated installation of Unity Connection via VMware Open\nVirtualization Format(OVF) Tool. The VMware OVF Tool is used to deploy and inject the Unity\nConnection configuration parameters into the virtual machines using skip-install OVA and vApp properties\nwithout using Answer File Generator or vFloppy images. For more details, see Automated Installation\nusing vApp properties and VMware OVF Tool section.\nImportant Considerations for Installation\nBefore you proceed with the installation, consider the following points:\n• Verify the system requirements, such as licensing and phone integration requirements necessary for the\nUnity Connection server in the System Requirements for Cisco Unity Connection guide at\nhttps://www.cisco.com/c/en/us/td/docs/voice_ip_comm/connection/14/requirements/b_14cucsysreqs.html.\n• Be aware that when you install on an existing Unity Connection server, the hard drive gets formatted\nand all existing data on the drive gets overwritten.\n• Ensure that you connect each Unity Connection server to an uninterruptible power supply (UPS) to\nprovide power backup and protect your system. Failure to do so may result in damage to physical media\nand require a new installation.\n• Ensure that the virtual machine has ESXi 7.0 U1 and VM version 13 and above.\n• For a Unity Connection cluster:\n• Install the Unity Connection software first on the publisher server and then on the subscriber server\n(applicable to only standard installation scenarios). For more information on installation scenarios,\nsee Installation Scenarios.\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n2\nInstalling Cisco Unity Connection\nImportant Considerations for Installation\n• Note down the Security password that you mention at the time of installing publisher server. You\nneed to specify the same password when installing the subscriber server in a cluster.\n• Do not run Network Address Translation (NAT) or Port Address Translation (PAT) between the\npublisher and subscriber servers.\n• Verify that DNS server is properly configured before installing Unity Connection. For more information,\nsee the Verifying DNS Settings.\n• Do not perform any configuration changes during the installation.\n• Be aware that the directory names and filenames that you enter during the installation are case-sensitive.\nInstall with Data Import\nWhen the migration cluster is created using Install with Data Import installation method, you must indicate\nwhether all destination cluster nodes will keep the same hostname or IP address, or if some of these addresses\nwill be changing. Depending upon this there are two types of Data Migration as explained below:\n• Simple Migration: Using the source node settings for all destination cluster nodes is referred to Simple\nMigration.\n• Network Migration: Entering new network settings for one or more destination cluster nodes is referred\nto Network Migration.\n1.\nIf Intrasite, HTTPS and SRSV networking is configured remove the server from the Unity Connection\nsite before performing Install with Data Import. For instructions, see the Networking Guide for Cisco\nUnity Connection Release 14 available at https://www.cisco.com/c/en/us/td/docs/voice_ip_comm/\nconnection/14/networking/guide/b_14cucnetx.html.\n2.\nIf Google Workspace is configured with Unity Connection, save and reset the Google Workspace unified\nmessaging service on Unity Connection after performing Install with Data Import. Also disable the Google\nWorkspace unified messaging service from Unity Connection where data export CLI was executed before\nperforming data import to prevent message duplicacy. For instructions, see section Task List for Configuring\nUnified Messaging with Google Workspace of the Unified Messaging Guide for Cisco Unity Connection\nRelease 14 available at https://www.cisco.com/c/en/us/td/docs/voice_ip_comm/connection/14/unified_\nmessaging/guide/b_14cucumgx.html\nCaution\nFollowing are the different ways to perform Install with Data Import:\n1.\nExport data from source publisher node, Import data on destination publisher node and fresh install\ndestination subscriber node.\n2.\nExport data from both source publisher and subscriber nodes and import data on both destination nodes.\nData exported from Publisher Node cannot be imported on the Subscriber Node.\nNote\nYou can perform Export and Import of data by the following steps:\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n3\nInstalling Cisco Unity Connection\nInstall with Data Import\n1.\n(Applicable for Unity Connection 14 release) Install the COP file\nciscocm.cuc_DataExport_v1.1.k4.cop.sha512 on both nodes of cluster.\n2.\nYou can use below CLI command to export source release data:\nutils system upgrade dataexport initiate\nExecute above CLI command on publisher node to export data. Export subscriber node data only after\ncompletion of export on publisher node as per requirement. For more information on CLI usage, see \"Utils\nCommands\" chapter of the Command Line Interface Reference Guide for Cisco Unified Communications\nSolutions available at https://www.cisco.com/c/en/us/support/unified-communications/\nunified-communications-manager-callmanager/products-command-reference-list.html.\nPlease note the following information related to CLI:\n• It is recommended to execute this CLI during Off hours to avoid voicemail impact. While CLI execution\nis in progress, you will not be able to access voicemails and send messages.\n• It is available on Unity Connection 14SU1 and later releases therefore COP installation step is not\nrequired.\n• It will continue to run in background in case of any network disconnect on Unity Connection 14SU1 and\nlater releases. For Unity Connection Release 14, CLI will terminate in case of network disconnect.\nNote\n3.\nImport data on new virtual machines of release 14SU1 or later, using Import option available in Installation\nwizard. For more information see Installing the Publisher Server, on page 13 section.\n1.\nMake sure to install ciscocm.cuc_preUpgradeCheck-001.k3.cop.sgn COP on both nodes of the cluster\nand verify that the cluster is ready for migration before Data Export. Download the COP files from\nhttps://software.cisco.com/download/home/286313379/type/286319537/release/COP-Files.\n2.\nMake sure that the server on which Import is to be performed is created using recommended OVA. For\nmore information, see https://www.cisco.com/c/dam/en/us/td/docs/voice_ip_comm/uc_system/virtualization/\nvirtualization-cisco-unity-connection.html.\n3.\nOnce migrated, if for any reason you decide to roll back Data Export COP file on Unity Connection 14\nRelease, then install ciscocm.cuc_DataExport_rollback_v1.1.k4.cop.sha512 COP file.\nNote\nPre-Installation Tasks\nBefore installing a Unity Connection server, you need to understand all the pre-installation steps as well. The\nTable 1: Pre-Installation Tasks contains a list of pre-installation tasks that you must consider to ensure successful\ninstallation of Unity Connection server.\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n4\nInstalling Cisco Unity Connection\nPre-Installation Tasks\nTable 1: Pre-Installation Tasks\nImportant Notes\nTask\nFor information about the capacity of serve\nthe link\nh\nt\nt\np\n:\n/\n/\nw\nw\nw\n.\nc\ni\ns\nc\no\n.\nc\no\nm\n/\nc\n/\nd\na\nm\n/\ne\nn\n/\nu\ns\n/\nt\nd\n/\nd\no\nc\ns\n/\nv\no\ni\nc\ne\n_\ni\np\n_\nc\no\nm\nm\n/\nu\nc\n_\ns\ny\ns\nt\ne\nm\n/\nv\ni\nr\nt\nu\na\nl\ni\nz\na\nt\ni\no\nn\n/\nv\ni\nr\nt\nu\na\nl\ni\nz\na\nt\ni\no\nEnsure that your servers are listed as supported hardware and\nsized appropriately to support the load of the cluster.\nStep 1\nFor more information, see the Creating a Vi\nsection.\nCreate the virtual machine using the correct OVA template.\nStep 2\nFor more information, see the Changing th\nof Virtual Machine section.\nChange the boot order of the virtual machine to update the BIOS\nsettings.\nStep 3\nFor more information, see the Command L\nReference Guide for Cisco Unified Solution\nrelease, available at\nh\nt\nt\np\n:\n/\n/\nw\nw\nw\n.\nc\ni\ns\nc\no\n.\nc\no\nm\n/\nc\n/\ne\nn\n/\nu\ns\n/\ns\nu\np\np\no\nr\nt\n/\nu\nn\ni\nf\ni\ne\nd\n-\nc\no\nm\nm\nu\nn\ni\nc\na\nt\ni\no\nn\ns\n/\nu\nn\ni\nt\ny\n-\nc\no\nn\nn\ne\nc\nt\ni\no\nn\n/\np\nr\no\nd\nu\nc\nt\ns\nIf the publisher server fails to sync\nan NTP server, installation of a subs\ncan also fail.\nCaution\nConfigure an external NTP server during a Unity Connection\nserver installation.\nFor a Unity Connection cluster, the NTP server helps to\nsynchronize time between publisher and subscriber server. Ensure\nthe external NTP server is stratum 9 or higher (meaning stratums\n1-9). The subscriber server get its time from the publisher server.\nTo verify the NTP status of the publisher server, log into the\nCommand Line Interface on the publisher server and enter the\nfollowing command:\nutils ntp status\nStep 4\nEnable PortFast on all switch ports that are\nCisco servers. With PortFast enabled, the\nimmediately brings a port from the blockin\nthe forwarding state by eliminating the forw\n[the amount of time that a port waits befor\nfrom its Spanning-Tree Protocol (STP) lea\nlistening states to the forwarding state].\nRecord the network interface card (NIC) speed and duplex\nsettings of the switch port that connects to the new server.\nStep 5\nTo record your configuration settings, see\nInformation for Installation section.\nRecord the configurations settings for each server that you plan\nto install.\nStep 6\nDownload from the given link:\nhttps://software.cisco.com/download/navigator\n.html?mdfid=\nDownload the signed .iso file of required Unity Connection\nversion from Cisco.com.Upload it on a data store or burn a disk\nimage of the downloaded software.\nStep 7\nCreating a Virtual Machine\nTo download the OVA template for creating virtual machines, open the following link, select Unity Connection\nSoftware, and then select the appropriate release number:\nhttps://software.cisco.com/download/type.html?mdfid=283062758&flowid=45673.\nStep 1\nTo deploy the OVA template in a supported VMware client, from the File menu, select Deploy OVA template.\nStep 2\nNext, browse the OVA template from the URL or file location on the system.\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n5\nInstalling Cisco Unity Connection\nCreating a Virtual Machine\nStep 3\nFollow on-screen instructions to create the virtual machine.\nChanging the Boot Order of Virtual Machine\nThe virtual machine boot into the BIOS menu.\nStep 1\nIn VMware client, power off the virtual machine that has the deployed OVA template.\nStep 2\nIn the left pane of VMware client, right-click the name of the virtual machine, and select Edit Settings.\nStep 3\nIn the Virtual Machine Properties dialog box, select the Options tab.\nStep 4\nIn the Settings column, from the Advanced menu, select Boot Options.\nStep 5\nIn the Force BIOS Setup, check the The next time the virtual machine boots, force entry into the BIOS setup screen\ncheck box.\nStep 6\nSelect OK to close the Virtual Machine Properties dialog box.\nStep 7\nPower on the virtual machine.\nStep 8\nNavigate to the Boot menu and change the boot device order so the CD-ROM device is listed first and the Hard Drive\ndevice is listed second.\nStep 9\nSave the change and exit BIOS setup.\nChanging Reservation on Virtual Machines Running with E7 or E5 Processors\nThe CPU reservations are now included in OVAs, which are based on the Xeon 7500 processor. For E7\nprocessors and certain E5 processors, the CPU reservations are higher than available cycles on 1 virtual CPU.\nIn such cases, the administrator needs to change the reservation number of the virtual machine manually using\nthe steps mentioned in Changing the Reservation Numbers\nAdditionally, based on the lab tests, we see that the 2.4 GHz reservation on E7 or E5 processor has the same\nperformance as a 2.53 GHz Xeon 7500 processor.\nFor more information see the docwiki available at\nhttp://docwiki.cisco.com/wiki/UC_Virtualization_Supported_Hardware.\nChanging the Reservation Numbers\nStep 1\nIn VMware vSphere Client, select the host on which virtual machine is created.\nStep 2\nClick the Summary tab, under CPU, note the available CPU cycles for 1 virtual CPU in GHz.\nStep 3\nPower off the virtual machine on which you deployed the OVA template\nStep 4\nIn the left pane of vSphere Client, right-click the name of the virtual machine and select Edit Settings.\nStep 5\nIn the Virtual Machine Properties dialog box, select the Resources tab.\nStep 6\nIn the Settings column, select CPU.\nStep 7\nUnder Resource Allocation, enter the new reservation value in the Reservation textbox. The new reservation value is\ncalculated as the number of CPUsX2.4GHz (for E5440 processor) and the number of CPUs multiplied by the 1 virtual\nCPU cycles in GHz (from step 2) (for E7 processor).\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n6\nInstalling Cisco Unity Connection\nChanging the Boot Order of Virtual Machine\nStep 8\nClick OK to close the Virtual Machine Properties dialog box.\nStep 9\nPower ON the virtual machine.\nVerifying DNS Settings\nStep 1\nLogin to command prompt.\nStep 2\nTo ping each server by its DNS name, enter pingDNS_name.\nStep 3\nTo look up each server by IP address, enter nslookupIP_address.\nGathering Information for Installation\nUse the Table 2: Gathering Information for Installation to record the information about your server. Gather\nthis information for a single Unity Connection server or for both the servers in a Unity Connection cluster.\nYou should make copies of this table and record your entries for each server in a separate table.\nTable 2: Gathering Information for Installation\nCan Setting Be Changed After I\nDescription\nConfiguration Setting\nYes, using the CLI command\nCLI > set timezone\nSets the local time zone and offset from\nGreenwich Mean Time (GMT).\nSelect the time zone that most closely\nmatches the location of your server.\nIn a cluster, you must set the\nsubscriber server to the same\ntime zone as the publisher\nserver.\nCaution\nTime Zone: _____________________\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n7\nInstalling Cisco Unity Connection\nVerifying DNS Settings\nCan Setting Be Changed After Insta\nDescription\nConfiguration Setting\nYes, using the CLI command\nCLI > set network mtu\nSets the largest packet, in bytes, that is\ntransmitted by this host on the network.\nBy default, MTU is set to the size\ndefined in the operating system.\nSelecting a different packet size would\nbe more prevalent where a VPN or IPsec\ntunnel is used with a custom packet size.\nWeb access over VPN can cause web\npages not to load because of an improper\nMTU configuration.\nThe MTU size that you configure must\nnot exceed the lowest MTU size that is\nconfigured on any link in your network.\nIn clustered server pairs, the\nMTU setting must be the same\non both servers\nNote\nMTU Size: ______________________\nYes, using the CLI command\nCLI > set network dhcp\nCLI > set network gateway\nCLI > set network ip eth0\nSets whether to use DHCP to\nautomatically configure the network\nsettings on your server.\nIf you select No, you must enter a\nhostname, IP address, IP address mask,\nand the gateway IP address.\nThe hostname can contain up to 50\nalphanumeric characters, hyphens,\nunderscores, and period. The first\ncharacter cannot be a hyphen.\nWe recommend you use static Dynamic\nHost Control Protocol (DHCP) host\nconfiguration to ensure the DHCP server\nalways provides the same IP address\nsettings to the server\nIf you do not have a gateway,\nyou must still set this field to\n255.255.255.255. Not\nspecifying a gateway may limit\nyou to only being able to\ncommunicate with devices on\nyour subnet.\nNote\nMake sure not to use ciscounity\nin the hostname of the server\nelse enterprise replication gets\nbroken.\nCaution\nHostname and IP addresses:\nDHCP (Yes/No): ______\nIf DHCP is No:\nHostname: _________________\nIP Address: _________________\nIP Mask: ___________________\nGateway (GW) Address:________\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n8\nInstalling Cisco Unity Connection\nGathering Information for Installation\nCan Setting Be Changed After I\nDescription\nConfiguration Setting\nYes, using the CLI commands\nCLI > set network dns\nCLI > set network domain\nSets whether a DNS server resolves a\nhostname and IP address.\nUnity Connection enables the\nuse of a domain name server to\nlocate other Cisco Unity servers\nand devices. This is necessary\nwhen configuring digital\nnetworking and clustered server\npairs. We recommend you to\nconfigure a secondary DNS\nserver to avoid any loss of\nconnectivity or service.\nNote\nDomain Name Server:\nDNS: (Yes/No): ______\nIf DNS is Yes:\nDomain: ____________________\nDNS Primary: _________________\nDNS Secondary: _______________\nLogin: No.\nPassword: yes, using the CLI c\nCLI > set password user adm\nYou can create addition\nadministrator accounts a\ninstallation.\nNote\nSets the administrator credentials for\nsecure shell access to the CLI and for\nlogging into Cisco Unified\nCommunications Operating System and\nDisaster Recovery System.\nThe administrator account should be\nshared only with installers and engineers\nwho have a thorough understanding and\nare responsible for platform\nadministration and upgrades, and backup\nand restore operations.\nEnsure the password is at least\nsix characters long; it can\ncontain alphanumeric\ncharacters, hyphens, and\nunderscore.\nNote\nAdministrator Account Credentials:\nLogin: ____________________\nPassword: _________________\nYes, using the CLI command\nCLI > set web-security\nSets information used by the server to\ngenerate certificate signing requests\n(CSRs) that are used to obtain\nthird-party certificates.\nTo enter more than one business\nunit name, separate the entries\nwith a comma. For entries that\nalready contain a comma, enter\na backslash before the comma\nthat is included as part of the\nentry.\nTip\nFor location, you can enter any setting\nthat is meaningful within your\norganization. Examples include the state\nor the city where the server is located.\nCertificate Information:\nOrganization: ____________________\nUnit: ______________________\nLocation: _________________\nState: ____________________\nCountry: _________________\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n9\nInstalling Cisco Unity Connection\nGathering Information for Installation\nCan Setting Be Changed After Insta\nDescription\nConfiguration Setting\nFirst server refers to the publisher\nserver. During the installation of second\nor subscriber server, enter the details of\nthe first server.\nCluster:\nFirst server in cluster (Yes/No): ____\nIf First server is No:\nPublisher hostname: ____________\nPublisher IP address: ____________\nPublisher security password: ______\nYes, using Cisco Unified Operating\nAdministration:\nSettings > NTP Servers\nUsing the CLI command\nCLI > using the CLI command\nSets the hostname or IP address of one\nor more network time protocol (NTP)\nservers that synchronizes with your\nUnity Connection server.\nThe NTP service ensures that the time\nsynchronized is accurate for\ndate/timestamps of messages, reports,\nand various tools, such as logs and\ntraces.\nAll Unity Connection servers require an\nexternal NTP source that are accessible\nduring installation. The source can be a\ncorporate head-end router synchronized\nwith a public NTP time server or it can\nbe the public NTP time server itself.\nTo avoid potential\ncompatibility, accuracy, and\nnetwork jitter problems, the\nexternal NTP servers should be\nNTP v4 (version 4). If you are\nusingIPv6 addressing, external\nNTP servers must be NTP v6.\nThe NTP server that you\nspecify for the publisher server\nis automatically applied for the\nsubscriber server.\nNote\nNTP Servers:\nNTP Server 1: __________________\nNTP Server 2: __________________\nNTP Server 3: __________________\nNTP Server 4: __________________\nNTP Server 5: __________________\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n10\nInstalling Cisco Unity Connection\nGathering Information for Installation\nCan Setting Be Changed After I\nDescription\nConfiguration Setting\nYes, using the CLI command\nCLI > set password user secur\nIf you are changing the\npassword in a clustered\nyou must change the sec\npassword on both serve\nboth servers. For more i\nsee the description of th\nin the Command Line In\nReference Guide for Ci\nSolutions.\nCaution\nSets the password used by a subscriber\nserver to communicate with a publisher\nserver.\nThe security password is also used by\nthe Disaster Recovery System to encrypt\nbackups.\nThe password must contain at least six\nalphanumeric characters. It can contain\nhyphens and underscores, but it must\nstart with an alphanumeric character.\nSecurity Password\nYes, using the CLI command:\nCLI > set smtp\nSets the hostname or IP address for the\nSMTP server that is used for outbound\ne-mail, intrasite links, Voice Profile for\nInternet Mail (VPIM), and HTTPS\nnetworking.\nThe hostname can contain alphanumeric\ncharacters, hyphens, or periods but it\nmust start with an alphanumeric\ncharacter.\nYou must specify an SMTP\nserver if you plan to use\nelectronic notification.\nNote\nSMTP Server\nYes, using Cisco Unity Connec\nAdministration and the CLI com\nCLI > utils cuc reset password\nSets the default credentials for the Unity\nConnection applications, including\nCisco Unity Connection Administration\nand Cisco Unity Connection\nServiceability.\nApplication Account Credentials:\nLogin: ____________________\nPassword: _________________\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n11\nInstalling Cisco Unity Connection\nGathering Information for Installation\nInstallation Scenarios\nTable 3: Installation Scenarios\nInstallation Method\nInstallation Scenarios\nStandard\n• Installing the Publisher Server\n• Verifying the Installation\nUnattended\n• Generating Answer File for Unattended Installation\n• Installing the Publisher Server\n• Verifying the Installation\nStandalone\nDeployment\nStandard\n• Installing the Publisher Server\n• Configuring Subscriber Server on the Publisher Server\n• Installing the Subscriber Server\n• Verifying the Installation\nUnattended\n• Generating Answer File for Unattended Installation\n• Installing the Publisher Server\n• Configuring Subscriber Server on the Publisher Server\n• Installing the Subscriber Server\n• Verifying the Installation\nCluster Deployment\nInstallation Tasks\nDepending on the type of installation scenario, you need to perform the following tasks to install the Unity\nConnection software:\nNavigating Within the Installation Wizard\nFor instructions on how to navigate within the installation wizard, see Table 4: Installation Wizard Navigation.\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n12\nInstalling Cisco Unity Connection\nInstallation Scenarios\nTable 4: Installation Wizard Navigation\nPress This\nTo Do This\nTab\nMove to the next field\nAlt-Tab\nMove to the previous field\nSpace bar or Enter\nSelect an option\nUp or down arrow\nScroll up or down in a list\nSpace bar or Enter to select Back (when available)\nGo to the previous window\nSpace bar or Enter to select Help (when available)\nGet help information on a window\nInstalling the Publisher Server\nWhile installing a Unity Connection server, you are prompted to enter different configuration information.\nRefer the table mentioned in the Gathering Information for Installation section wherever applicable.\nStep 1\nPrepare the virtual machine to install Unity Connection:\na)\nSelect Edit virtual machine settings to select the ISO image from CD/DVD drive using client device or from data\nstore.\nb) Navigate to the Console tab. A screen prompting you to check the integrity of the DVD appears.\nc)\nSelect Yes to perform the media check or Skip to move to the next step.\nIf you select media check and it fails, either download another copy from Cisco.com or obtain another DVD\ndirectly from Cisco.\nNote\nd) After performing the hardware check, you get a prompt to restart the system. You need to select Yes to continue\ninstallation. After the system restarts, the Product Deployment Selection window displays.\nStep 2\nIn the Product Deployment Selection window, select OK to install Cisco Unity Connection. Then Proceed with Install\nwindow appears.\nStep 3\nIn the Proceed with Install window, select Yes to continue the installation.\nIf you select Yes on the Proceed with Install window, all existing data on your hard drive gets overwritten and\ndestroyed.\nCaution\nThe Platform Installation Wizard window appears.\nStep 4\nIn the Platform Installation Wizard window, select the applicable option:\n• If you want to perform a standard installation, select Proceed, and continue with this procedure.\n• (Applicable to Unity Connection 14SU1 and later releases) If you want to Import data from SFTP server during\nfresh install, select Import and continue.\n• If you want to perform an unattended installation, select Skip. Connect the answer file image on a virtual floppy\ndiskette and select Continue. The installation wizard reads the configuration information during the installation\nprocess and then follow the steps mentioned in the Post-Installation Tasks section.\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n13\nInstalling Cisco Unity Connection\nInstalling the Publisher Server\nStep 5\nIf you select Proceed in the previous window, the Apply Patch window appears:\na)\n• Select Yes to upgrade to a later Service Release of the software during installation and follow the process\nmentioned in the Applying a Patch section.\nThis option is not applicable to Install with Data import installation method.\nNote\n• Select No to skip this step and the Basic Install window appears.\nb) If you select Import in the previous window, the Import Upgrade Configuration Information window appears. It\nexplains the format of entering SFTP server and Export Directory. Select OK. The Timezone Configuration window\nappears. Continue with Step-7.\nStep 6\nIn the Basic Install window, select Continue to install the software version or configure the pre- installed software.\nThe Timezone Configuration window appears.\nStep 7\nIn the Timezone Configuration window, select the appropriate time zone for the server and then select OK. The Auto\nNegotiation Configuration window appears.\nIn a cluster, the subscriber server must be configured to use the same time zone as the publisher server. The\nreplication do not work if the timezone is not same.\nCaution\nStep 8\nIn the Auto Negotiation Configuration window, select Continue. The MTU Configuration window appears.\nStep 9\nIn the MTU Configuration window, select the applicable option:\n• Select No to accept the default value (1500 bytes).\n• Select Yes to change the MTU size, enter the new MTU size, and select OK.\nIf you configure the MTU size incorrectly, your network performance can be affected.\nCaution\nThe DHCP Configuration window appears.\nStep 10\nIn the DHCP Configuration window, select the applicable option:\n• Select Yes to use DHCP server that is configured in your network.The network restarts and the Administrator\nLogin Configuration window appears.\n• Select No to configure a static IP address for the server and continue with this procedure. The Static Network\nConfiguration window appears.\nStep 11\nIn the Static Network Configuration window, enter the static network configuration information.\nThe DNS Client Configuration window displays.\nStep 12\nTo enable DNS, select Yes, enter the DNS client information and select OK.\nThe network restarts using the new configuration information.\nStep 13\nIf Import option is selected in Step-4 then Software Location of Data to import window will display. In this\nwindow, enter the following information.\na)\nDescription\nField\nThe Secure FTP (SFTP) server that will store the source\ncluster's exported data.\nRemote Server Name or IP\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n14\nInstalling Cisco Unity Connection\nInstalling the Publisher Server\nDescription\nField\nDirectory path on the server containing export data.\nExport Data Directory\nAllow for data retrieval of the remote SFTP server.\nRemote Server Login ID\nContains alphanumeric characters, hyphens, and\nunderscores\nRemote Server Password\nThe Certificate Information window appears.\nb) If Import option is not selected in Step-4 then enter the administrator login and password. The Certificate Information\nwindow appears.\nStep 14\nEnter your certificate signing request information and select OK.\nThe First Node Configuration window displays.\nStep 15\nIn the First Node Configuration window, select the applicable option:\n• Select Yes to configure this server as the publisher server or as a standalone server and continue this procedure.\nThe Network Time Protocol Client Configuration window appears.\n• Select No to configure this server as the subscriber server.\nStep 16\nIn the Network Time Protocol Client Configuration window, enter the hostname or IP address of the NTP server(s)\nand select Proceed.\nCisco recommends that you use an external NTP server to ensure accurate system time on the publisher server.\nHowever, you can configure multiple NTP servers based on your requirements.\nNote\nStep 17\nIf Import option is not selected in Step-4 then Security Configuration window appears.In the Security Configuration\nwindow, enter the security password.\na)\nThe system uses this password to authorize communications between the publisher and subscriber servers;\nyou must ensure this password is identical on the two servers.\nNote\nThe SMTP Host Configuration window appears.\nb) If Import option is selected in Step-4 then SMTP Host Configuration window appears after selecting Proceed on\nthe Network Time Protocol Client Configuration window.\nStep 18\nIn the SMTP Host Configuration window:\na)\nSelect Yes to configure an SMTP server and enter the SMTP server name or IP address.\nb) Select OK. The Application User Configuration window appears.\nYou must configure an SMTP server to use certain platform features; however, you can also configure an SMTP\nserver later using the platform GUI or the command line interface.\nIf Import option is selected in Step-4, then Platform Configuration Confirmation window appears after selecting\nOK on the SMTP Host Configuration window. Continue with Step-20.\nNote\nStep 19\nIn the Application User Configuration window:\na)\nEnter the Application User name and password and confirm the password by entering it again.\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n15\nInstalling Cisco Unity Connection\nInstalling the Publisher Server\nDo not use the system application name as the Application User name. Using a system application name\ncauses the installation to fail with an unrecoverable error during the installation of the database. The system\napplication names are operator, replication, undeliverablemessagesmailbox, and Unity Connection.\nNote\nb) Select OK. The Platform Configuration Confirmation window appears.\nStep 20\nIn the Platform Configuration Confirmation window, select OK to continue the installation. The system installs and\nconfigures the software.\nStep 21\nWhen the installation process completes, you are prompted to log in using the Administrator account and password.\nConfiguring Subscriber Server on the Publisher Server\nStep 1\nSign in to Cisco Unity Connection Administration.\nStep 2\nExpand System Settings and select Cluster.\nStep 3\nOn the Find and List Servers page, select Add New.\nStep 4\nOn the New Server Configuration page, in the Hostname or IP Address field, enter the hostname or IP address of the\nsecond server in the cluster.\nStep 5\n(Optional) In the MAC Address field, enter the MAC address of the second server.\nStep 6\nIn the Description field, enter a description for the second server and select Save.\nAbove mentioned steps are applicable to:\n• Unity Connection 14 release.\n• If Import option is not selected, while installation for Unity Connection 14SU1 and later releases.\n• If Import option is selected only for publisher node, while installing Unity Connection 14SU1 and later\nreleases.This is the case network migration in which data is exported and imported on publisher node only\nand subscriber node is freshly installed.\nNote\nInstalling the Subscriber Server\nIn case of Install with Data Import installation method, you can fresh install the subscriber node or you can\nimport the subscriber node using Import option.\nFor importing the subscriber node, select the Import option in Platform Installation Wizard window and follow\nthe steps of importing publisher server until the First Node Configuration window appears.Then continue the\nfollowing procedure.\nNote\nTo fresh install the subscriber server, follow the steps of installing publisher server until the First Node\nConfiguration window appears and then continue the following procedure.\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n16\nInstalling Cisco Unity Connection\nConfiguring Subscriber Server on the Publisher Server\nWhile installing a Unity Connection server, you are prompted to enter different configuration information.\nRefer the table mentioned in the Gathering Information for Installation section wherever applicable.\nStep 1\nIn the Console tab, on the First Node Configuration window, select No to continue the installation of the subscriber server\nand select OK.\nThe Network Connectivity Test Configuration window displays.\nStep 2\nDuring installation of a subscriber server, the system checks to ensure that the subscriber server can connect to the\npublisher server.\n• To pause the installation after the system successfully verifies network connectivity, select Yes.\n• To continue the installation, select No.\nThe First Node Access Configuration window displays.\nStep 3\nEnter the connectivity information for the publisher server and select OK.\nThe system checks for network connectivity.\nIf you select to pause the system after the system successfully verifies network connectivity, the Successful Cisco Unity\nConnection to First Node window displays. Select Continue.\nIf the network connectivity test fails, the system stops and allows you to go back and re-enter the parameter\ninformation.\nNote\nThe SMTP Host Configuration window displays.\nStep 4\nIf you want to configure an SMTP server, select Yes and enter the SMTP server name.\nThe Platform Configuration Confirmation window displays.\nStep 5\nSelect OK to start installing the software.\nStep 6\nWhen the installation process completes, you are prompted to log in using the Administrator account and password.\nAfter installing publisher and subscriber nodes, complete the post-installation tasks that are listed in the\nPost-Installation Tasks, on page 27. In case of Install with Data Import option, complete the post-migration tasks\nlisted in the Post-Migration Tasks section.\nNote\nGenerating Answer File for Unattended Installation\nYou can generate answer files using Cisco Unified Communications Answer File Generator web application.\nTo use the answer file during installation, you need to save the answer file to the root directory of a floppy\ndiskette, browse to the file during installation, and leave the installation to complete.\nIn case of Unity Connection cluster:\n• You need to generate separate answer files for publisher and subscriber servers.\n• You are not required to enter details of the publisher server manually on the subscriber server during\nsubscriber server installation.\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n17\nInstalling Cisco Unity Connection\nGenerating Answer File for Unattended Installation\nThe Cisco Unified Communications Answer File Generator supports Internet Explorer version 11.0 or higher\nand Mozilla version 28.0 or higher.\nNote\nTask List for Unattended Installation\nYou need to perform the following tasks to generate answer file and create floppy image for unattended\ninstallation.\n1.\nGenerate and download answer files that includes the platformConfig.xml files for both the publisher and\nthe subscriber server. For more information on how to generate answer files, see Generating and\nDownloading Answer File.\n2.\nAfter generating the answer files, create a floppy image. For more information, see\nhttp://kb.vmware.com/selfservice/microsites/search.do?language=en_US&cmd=displayKC&externalId=1739.\n3.\nDeploy and configure the servers in the cluster, publisher and subscriber. For more information, see the\nConfiguring the Publisher Server and Configuring the Subscriber Server section.\n4.\nTo install the publisher and subscriber server, see the Installing the Publisher Server and Installing the\nSubscriber Server section.\nGenerating and Downloading Answer File\nStep 1\nLog in to the Unity Connection Answer File Generator application. The answer file can be generated using the following\nlink: http://www.cisco.com/web/cuc_afg/index.html.\nStep 2\nEnter details in the Clusterwide Configuration section.\n(Applicable to Unity Connection 14SU1 and later releases) You can select option Configure Software Location\nof Data to Import for using Install with Data Import installation method. Enter details of Remote Server and\nExport Data Directory.\nNote\nStep 3\nEnter details for the primary node in the Primary Node Configuration section.\nStep 4\n(Optional) If you want to enable Dynamic Cluster Configuration, enter a value in the Dynamic-cluster-config-timer field.\nStep 4 is mandatory when you are using Dynamic-cluster-configuration process for Touchless installation.\nNote\nStep 5\nEnter details for the secondary node in the Secondary Node Configuration section.\nStep 6\nIn the List of Secondary Nodes list box, select Add Secondary Node. The node that you add as secondary node appears\nin this list box.\nStep 7\nClick Generate Answer Files. A dialog box appears showing the details for the primary node, the secondary node, and\nthe clusterConfig file.\nStep 8\nIn the Communications Answer File Generator dialog box, follow the download instructions, and then click the Download\nFile button to download the answer files to your computer.\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n18\nInstalling Cisco Unity Connection\nTask List for Unattended Installation\nConfiguring the Publisher Server\nStep 1\nLog in to the virtual machine to start the cluster installation.\nStep 2\nFrom the VM menu, select Edit settings to mount the floppy image that you have created from the Answer File Generator\ntool. The Virtual Machine Properties dialog box appears.\nStep 3\nFrom the available hardware list, select Floppy drive 1.\nStep 4\nIn the Device Type section, select Use the existing floppy image in the database, and then click Browse to navigate to\nthe floppy image.\nStep 5\nClick OK. The floppy image is attached.\nStep 6\nSelect the CD/DVD Drive 1 > Connect to ISO image on local disk option from the toolbar and select CD/DVD Drive1\n> Connect to ISO image on a datastore, navigate to the data store to select the ISO image, and click OK. The ISO image\nis attached and the installation starts.\nStep 7\n(Optional) If you want to test the media before the installation, click OK in the Disc Found message box, or select Skip\nto skip testing the media before the installation. The installation proceeds without any manual intervention. The publisher\nis installed and the subscribers is added to the publisher.\nConfiguring the Subscriber Server\nStep 1\nYou can install the subscriber only after the publisher is installed.(Applicable to only unattended installation, not valid\nfor Touchless install).\nStep 2\nPerform Step 1 to Step 6 of the Configuring the Publisher Server.\nTouchless Installation for Virtual Machine\nTouchless installation is an enhancement of the existing unattended installation, which promotes simplified\ncluster installation. In unattended installation, you first install Unity Connection on the publisher server using\nanswer file, add the subscriber server to the Cluster page of the publisher server, and then start the installation\nof subscriber server. However, in Touchless installation, you are not required to manually enter the details of\nthe subscriber server on the publisher server. The subscriber details are automatically updated through\nclusterConfig.xml file or dynamic-cluster-configuration option in the AFG tool, which minimizes the need\nfor intervention and scheduling during the deployment of a new cluster.\nMethods for Touchless Installation\nYou can use either of the following two methods for Touchless installation:\n• Predefined Cluster Configurations (AFG Process)\n• Automatic Sequencing of Touchless server (Subscriber-Dynamic-Cluster configuration).\nPredefined Cluster Configurations (AFG Process)\nIn this method of installation, the Answer File Generator (AFG) tool generates the clusterConfig.xml file\nalong with the existing platformConfig.xml file for both the publisher and subscriber servers. If you specify\nthe details of the subscriber server in the AFG tool, those details are included in the clusterConfig.xml file.\nAfter the publisher server is installed, it reads the clusterConfig.xml file and if the publisher server finds the\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n19\nInstalling Cisco Unity Connection\nConfiguring the Publisher Server\nsubscriber server, it adds the subscriber server to its processnode table. Adding the subscriber server to the\nprocessnode table eliminates the need to wait for the publisher server to finish its installation, and then manually\nadd the subscriber server on the server page.Thus, the entire installation process occurs automatically.\nAutomatic Sequencing of Touchless Server (dynamic-cluster-configuration)\nIn automatic sequencing feature, subscriber gets configured dynamically along with the publisher during the\ninstallation. To use this functionality, enable the dynamic-cluster-configuration option in the AFG tool or use\nthe command line interface (CLI) command on the publisher server. To use CLI to enable dynamic-configuration\nfunctionality, see (Optional) Enabling Dynamic-Cluster-Configuration Using CLI. There is no clusterconfig.xml\nfile in this process of Touchless install.You need to enable the Dynamic Cluster Config Timer (1-24 hours)\nand start the installation on both the servers at the same time. The number of hours is the duration for which\nsubscriber waits for publisher to receive the subscriber entry in the processnode table.\nTask List for Touchless Installation\nYou need to perform the following tasks to generate answer files and create floppy image for Touchless\ninstallation.\n1.\nGenerate and download answer files that includes the platformConfig.xml files for both the publisher and\nthe subscriber server and clusterconfig.xml file (only for AFG Process). For more information on how to\ngenerate answer files, see Generating and Downloading Answer File.\nIn case you are using dynamic-cluster-configuration method of installation, then you just need to enable\ndynamic-cluster-configuration option in the AFG tool and follow the step1.\nNote\n2.\nAfter generating the answer files, create a floppy image. For more information, see\nhttp://kb.vmware.com/selfservice/microsites/search.do?language=en_US&cmd=displayKC&externalId=1739.\n3.\nDeploy and configure the servers in the cluster, publisher and subscriber. For more information, see the\nConfiguring the Publisher Server and Configuring the Subscriber Server section.\n4.\nTo install the publisher server, see the Installing the Publisher Server section for cluster deployment.\n5.\nThe installation of subscriber continues if:\n• You enable the dynamic-cluster-configuration timer.\n• The clusterConfig.xml files are present.\n(Optional)\n(Optional) Enabling Dynamic-Cluster-Configuration Using CLI\nProcedure\nPurpose\nCommand or Action\nYou can enable Dynamic-Cluster-Configuration through\nthe CLI for up to an hour using the command: set network\nStep 1\ncluster subscriber dynamic-cluster-config {default | no. of\nhours}. For more information, see the \"Set Command\"\nchapter of Command Line Interface Guide for Cisco Unified\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n20\nInstalling Cisco Unity Connection\nTask List for Touchless Installation\nPurpose\nCommand or Action\nCommunications Solutions available at\nh\nt\nt\np\n:\n/\n/\nw\nw\nw\n.\nc\ni\ns\nc\no\n.\nc\no\nm\n/\nc\n/\ne\nn\n/\nu\ns\n/\ns\nu\np\np\no\nr\nt\n/\nu\nn\ni\nf\ni\ne\nd\n-\nc\no\nm\nm\nu\nn\ni\nc\na\nt\ni\no\nn\ns\n/\nu\nn\ni\nf\ni\ne\nd\n-\nc\no\nm\nm\nu\nn\ni\nc\na\nt\ni\no\nn\ns\n-\nm\na\nn\na\ng\ne\nr\n-\nc\na\nl\nl\nm\na\nn\na\ng\ne\nr\n/\np\nr\no\nd\nu\nc\nt\ns\n-\nm\na\ni\nn\nt\ne\nn\na\nn\nc\ne\n-\ng\nu\ni\nd\ne\ns\n-\nl\ni\ns\nt\n.\nh\nt\nm\nl\n.\nAdd the new cluster subscriber through the CLI in the\nfollowing format: set network cluster subscriber details\n<servertype> <hostname> <ip> <domainname>.\nStep 2\nYou can use show network cluster CLI to check the entries\nin the processnode table. For more information, see \"Show\nStep 3\nCommand\" chapter of Command Line Interface Guide for\nCisco Unified Communications Solutions available at\nh\nt\nt\np\n:\n/\n/\nw\nw\nw\n.\nc\ni\ns\nc\no\n.\nc\no\nm\n/\nc\n/\ne\nn\n/\nu\ns\n/\ns\nu\np\np\no\nr\nt\n/\nu\nn\ni\nf\ni\ne\nd\n-\nc\no\nm\nm\nu\nn\ni\nc\na\nt\ni\no\nn\ns\n/\nu\nn\ni\nf\ni\ne\nd\n-\nc\no\nm\nm\nu\nn\ni\nc\na\nt\ni\no\nn\ns\n-\nm\na\nn\na\ng\ne\nr\n-\nc\na\nl\nl\nm\na\nn\na\ng\ne\nr\n/\np\nr\no\nd\nu\nc\nt\ns\n-\nm\na\ni\nn\nt\ne\nn\na\nn\nc\ne\n-\ng\nu\ni\nd\ne\ns\n-\nl\ni\ns\nt\n.\nh\nt\nm\nl\n.\nAutomated Installation using vApp properties and VMware OVF Tool\nThis feature uses a skip-install Open Virtual Archive (OVA) file containing an application that is installed\nup to the “skip” configuration point, where the application is ready to accept the configuration and complete\ninstallation. The VMware Open Virtualization Format Tool (OVF) is used to deploy and inject the Unity\nConnection configuration parameters into the virtual machines using skip-install OVA and vApp properties\nwithout using Answer File Generator or vFloppy images.\nDeployment vApp options are available for virtual machines that are deployed from VMware OVF Tool to\nthe desktop or to the web server (Application available only on vcenter). For a virtual machine with vApp\noptions enabled, the vApp options are preserved when you export the virtual machine as an OVF template.\nWithout manual intervention from the administrators, you just need the skip-install OVA image to install the\nentire Unity Connection cluster. Using the vApp parameters, you simply need to define a template and set the\nvalues of vApp Properties and inject all the details during deployment of the skip-install OVA using the\nVMware OVF Tool that results in automated installation.\nFresh Install and Fresh Install with Data Import is supported using this method. You can deploy this installation\nin two ways:\n• Manual Installation Using vApp Options — Deploy the skip-install OVA on each node in the cluster\nmanually by logging into the respective VMware Embedded Host Client or vCenter Server where the\nUnity Connection server configurations can be entered.\n• Touchless Installation Using VM Tools — Run the VM Builder tool by passing the Unity Connection\nconfiguration parameters, skip-install OVA and VMware Embedded Host Client or vCenter Server details\nof each node in the cluster which would perform the complete cluster installation without manual\nintervention. VM Builder tool is a VMware wrapper tool that is provided as part of the platform\nskip-install-ova rpm/tar.\nTask List for Manual Installation using vApp Options\nThis option allows to deploy OVA manually in the VMware Embedded Host Client or vCenter Server where\nOVA needs to be placed either in the desktop or to the web server.\nThe OVA deployment from web server is applicable only for vCenter.\nNote\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n21\nInstalling Cisco Unity Connection\nAutomated Installation using vApp properties and VMware OVF Tool\nThis task is only supported with VMware Embedded Host Client or vCenter Server versions 6.7 and 7.0.\nNote\nStep 1\nDeploy skip-install OVA after obtaining it from My Cisco Entitlements.\nStep 2\nFrom VMware Embedded Host Client or vCenter Server, deploy OVA using the Browse button or enter a URL to\ndownload and install the OVA package from the Internet.\nStep 3\nEnter the required Unity Connection configurations, skip-install OVA, VMware Embedded Host Client, or vCenter for\neach node in the cluster.\nStep 4\nTo perform touchless install on cluster, make sure to check the Dynamic Cluster Config Enable check box in user\ninterface of the Unity Connection publisher, and enter a value between 1-24 in the Dynamic cluster Config Timer field\nin case of cluster installation. (OR) Add your subscriber node manually from the Unity Connection user interface of the\npublisher, after the publisher node installation completes.\nStep 5\nFor installation using Fresh Install with Data Import, follow the instructions in Install with Data Import, on page 3\nsection.\nStep 6\nOnce the OVA image is deployed successfully into the virtual machine, power on the Virtual Machine.You will observe\nthat the installation is in process. Repeat step 3 for subscriber node in the cluster by providing the IP Address and Host\nName of the Unity Connection publisher node. Subscriber node can be installed parallelly by opening VMware Embedded\nHost Client.\nTask List for Touchless Installation using VM Tools\nThis task list allows to deploy skip-install OVA using the Cisco VM Builder tool, which is a wrapper tool to\ninject the configurations parameters.\nThis task is only supported with VMware Embedded Host Client or vCenter Server versions 6.7 and 7.0.\nNote\nBefore you begin\nRequires a Linux server to run Cisco VM Builder and VMware OVF Tool.\nThe Cisco VM Builder tool (VMware wrapper tool) and the dependent tool will be bundled and provided as\n.rpm file (platform-skip-install-ovftool-1.0.0.0-1.x86_64.rpm) or as a g-zipped tar file/tarball\n(platform-skip-install-ovftool_v1.0.tar.gz.) See the ReadMe guide for instructions on how to install .rpm/tar.\nStep 1\nInstall the Cisco VM Builder tool from My Cisco Entitlements on Linux based SFTP server.\nStep 2\nCopy the Unity Connection OVA image from My Cisco Entitlements to the same server.\nStep 3\nUsing the Cisco VM Builder tool pass the required Unity Connection configurations, skip-install OVA and VMware\nEmbedded Host Client or vCenter for each node in the cluster based on the type of Install. Install can be Fresh Install or\nFresh Install with Data Import. Configurations differ for the publisher and subscriber nodes. Use the “vmbuilder--help”\noption to know more about the parameters to be used.\nStep 4\nTo perform cluster installation, make sure to pass the Dynamic Cluster Config Enable parameter as True and enter a value\nbetween 1-24, in the Dynamic cluster Config Timer in the Cisco VM Builder tool of the Unity Connection publisher. Set\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n22\nInstalling Cisco Unity Connection\nTask List for Touchless Installation using VM Tools\nthe values of these parameters as: guest.dynamic_cluster_config=True and guest.cluster_config_timer=24. (OR) Add\nyour subscriber node manually from the Unity Connection user interface of the publisher, after the publisher node\ninstallation completes.\nStep 5\nThe Cisco VM Builder tool validates the configuration values, deploys the OVA in the VMware Embedded Host Client\nor vCenter Server, automatically powers on the node, and starts the installation. See the “vmbuilder--help” option to\nknow more about the mandatory parameters and other restrictions.\nStep 6\nRepeat Step-3 for subscriber node in the cluster. Subscriber node can be installed parallelly by opening another SSH\nconnection.\nApplying a Patch\nYou must obtain the appropriate upgrade file from Cisco.com before you can upgrade during installation. To\napply a patch, select Yes in the Apply a Patch window that appears during the installation of publisher or\nsubscriber server. The installation wizard installs the software version on the DVD first and then restarts the\nsystem.\nYou can upgrade to any supported higher release if you have a full patch of the release not an Engineering\nSpecial (ES).\nNote\nYou can access the upgrade file during the installation process either from a local disk (DVD) or from a remote\nFTP or SFTP server.\nStep 1\nIf you select Yes in the Apply a Patch window, the Install Upgrade Retrieval Mechanism Configuration window appears.\nStep 2\nSelect the upgrade retrieval mechanism to use to retrieve the upgrade file:\n• SFTP—Retrieves the upgrade file from a remote server using the Secure File Transfer Protocol (SFTP).\nSkip to the Upgrading from a Remote Server.\n• FTP—Retrieves the upgrade file from a remote server using File Transfer Protocol (FTP). Skip to the\nUpgrading from a Remote Server.\n• LOCAL—Retrieves the upgrade file from a local DVD. Continue with the Upgrading from a Local\nDisk.\nUpgrading from a Remote Server\nCisco allows you to use any SFTP server product but recommends SFTP products that have been certified\nwith Cisco through the Cisco Technology Developer Partner program (CTDP). CTDP partners, such as\nGlobalSCAPE, certify their products with specified version of Cisco Unified Communications Manager. For\ninformation on using GlobalSCAPE with supported Cisco Unified Communications versions, refer to\nhttps://www.globalscape.com/managed-file-transfer/cisco. Cisco uses the following servers for internal testing.\nYou may use one of these servers, but you must contact the vendor for support:\n• Open SSH (for Unix systems. Refer to http://sshwindows.sourceforge.net/)\n• Cygwin (http://www.cygwin.com/)\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n23\nInstalling Cisco Unity Connection\nApplying a Patch\n• Titan (http://www.titanftp.com/)\nFor issues with third-party products that have not been certified through the CTDP process, contact the\nthird-party vendor for support.\nNote\nIf you select to upgrade through an FTP or SFTP connection to a remote server, you must first configure\nnetwork settings so that the server can connect to the network.\nStep 1\nThe Auto Negotiation Configuration window displays.\nStep 2\nThe installation process allows you to automatically set the speed and duplex settings of the Ethernet network interface\ncard (NIC) using automatic negotiation. You can change this setting after installation.\nTo use this option, your hub or Ethernet switch must support automatic negotiation.\nNote\n• To enable automatic negotiation, select Yes.\nThe MTU Configuration window displays. Continue with Step 4.\n• To disable automatic negotiation, select No. The NIC Speed and Duplex Configuration window displays. Continue\nwith Step 3.\nStep 3\nIf you select to disable automatic negotiation, manually select the appropriate NIC speed and duplex settings now and\nselect OK to continue.\nThe MTU Configuration window displays.\nStep 4\nIn the MTU Configuration window, you can change the MTU size from the operating system default.\nThe maximum transmission unit (MTU) represents the largest packet, in bytes, that is transmitted by this host on the\nnetwork. If you are unsure of the MTU setting for your network, use the default value.\nIf you configure the MTU size incorrectly, your network performance can be affected.\nCaution\n• To accept the default value (1500 bytes), select No.\n• To change the MTU size from the operating system default, select Yes, enter the new MTU size, and select OK.\nThe DHCP Configuration window displays.\nStep 5\nFor network configuration, you can select to either set up static network IP addresses for the Unity Connection server\nand gateway or to use Dynamic Host Configuration Protocol (DHCP). Static IP addresses are recommended.\n• If you have a DHCP server that is configured in your network and want to use DHCP, select Yes. The installation\nprocess attempts to verify network connectivity.\n• If you want to configure static IP addresses for the server, select No. The Static Network Configuration window\ndisplays.\nStep 6\nIf you select not to use DHCP, enter your static network configuration values and select OK.\nThe DNS Client Configuration window displays.\nStep 7\nTo enable DNS, select Yes, enter the DNS client information and select OK.\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n24\nInstalling Cisco Unity Connection\nUpgrading from a Remote Server\nAfter the system configures the network and checks for connectivity, the Remote Patch Configuration window displays.\nStep 8\nEnter the location and login information for the remote file server. The system connects to the remote server and retrieves\na list of available upgrade patches.\nIf the upgrade file is located on a Linux or Unix server, you must enter a forward slash at the beginning of the directory\npath. For example, if the upgrade file is in the patches directory, you must enter /patches\nIf the upgrade file is located on a Windows server, remember that you are connecting to an FTP or SFTP server, so use\nthe appropriate syntax, including:\n• Begin the path with a forward slash (/) and use forward slashes throughout the path.\n• The path must start from the FTP or SFTP root directory on the server, so you cannot enter a Windows absolute\npath that starts with a drive letter (for example, C:).\nThe Install Upgrade Patch Selection window displays.\nStep 9\nSelect the upgrade patch to install. The system downloads, unpacks, and installs the patch and then restarts the system\nwith the upgraded software version running.\nAfter the system restarts, the Pre-existing Configuration Information window displays.\nStep 10\nTo continue the installation, select Proceed.\nThe Platform Installation Wizard window displays.\nStep 11\nTo continue the installation, select Proceed or select Cancel to stop the installation.\nIf you select Proceed, the Apply Patch window displays. Continue with Step 12.\nIf you select Cancel, the system halts, and you can safely power down the server.\nStep 12\nWhen the Apply Patch window displays, select No, the “Basic Install” window appears.\nStep 13\nSelect Continue in the window to install the software version on the DVD or configure the pre- installed software and\nmove to Step 7 of the Installing the Publisher Server section.\nUpgrading from a Local Disk\nBefore you can upgrade from a local disk, you must download the appropriate patch file from Cisco.com and\nuse it to create an upgrade DVD. You must create an ISO image on the DVD from the upgrade file. Just\ncopying the ISO file to a DVD does not work.\nStep 1\nWhen the Local Patch Configuration window displays, enter the patch directory and patch name, if required, and select\nOK.\nThe Install Upgrade Patch Selection Validation window displays.\nStep 2\nThe window displays the patch file that is available on the DVD. To update the system with this patch, select Continue.\nStep 3\nSelect the upgrade patch to install. The system installs the patch, then restarts the system with the upgraded software\nversion running.\nAfter the system restarts, the Preexisting Configuration Information window displays.\nStep 4\nTo continue the installation, select Proceed.\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n25\nInstalling Cisco Unity Connection\nUpgrading from a Local Disk\nThe Platform Installation Wizard window displays.\nStep 5\nTo continue the installation, select Proceed or select Cancel to stop the installation.\nIf you select Proceed, the Apply Patch window displays. Continue with Upgrading from a Local Disk.\nIf you select Cancel, the system halts, and you can safely power down the server.\nStep 6\nWhen the Apply Patch window displays, select No, the “Basic Install” window appears.\nStep 7\nSelect Continue in the window to install the software version on the DVD or configure the pre- installed software and\nmove to Upgrading from a Local Disk of the Installing the Publisher Server section.\nVerifying the Installation\nAfter the installation application has finished, the new server displays its hostname and the administration\naccount login prompt.\nStep 1\nLog in with the administration account user name and password.\nThe server opens a command line interface.\nStep 2\nVerify that server network services are running:\na)\nAt the CLI prompt, enter the command utils service list.\nIt might take a few minutes for all services to start completely. During this time, you might notice that services might\nbe listed as [Starting].\nb) Repeat the utils service list command until all network services are listed as [Started].\nIn particular, the Cisco Tomcat service must be started before you can proceed to the next verification step.\nStep 3\nVerify the server details:\na)\nOpen a web browser on a personal computer that has network access to the server. Unity Connection supports different\nweb browsers, such as Microsoft Internet Explorer and Mozilla Firefox.\nb) In the web browser, enter the URL “https://<publisher_ip_address>/cmplatform”.\nc)\nLogin to Cisco Unified OS Administration using the administrator user name and password specified during the\ninstallation.\nd) Select Show > System from the toolbar to display the system status page, showing the current date, uptime, software\nlevel, along with the CPU and memory usage.\ne)\nUse the Show menu to check:\n• Cluster: displays the IP address, hostname, alias, server type, and database replication status of the single\nserver or both the server in case of cluster.\n• Hardware: platform type, serial number, hardware, and other options\n• Network: current network interface configuration, status, and packets\n• Software: current active and inactive software partitions\nStep 4\nVerify the server status:\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n26\nInstalling Cisco Unity Connection\nVerifying the Installation\na)\nIn the web browser, enter the URL “https://<publisher_ip_address>/cuadmin”.\nb) The Cisco Unity Connection Administration window opens. Select Cisco Unity Connection Serviceability from the\nnavigation pane. Login using the application user name and password specified during the installation.\nc)\nSelect Tools > Cluster Management. It lists the server status of either single server or both the servers in case of\ncluster. For a standalone server deployment, the server shows Primary status whereas in case of cluster, one of the\nserver shows Primary status and the other shows Secondary status.\nCisco Unity Connection Survivable Remote Site Voicemail Installation\nYou install a Cisco Unity Connection Survivable Remote Site Voicemail (SRSV) server by converting a\nstandalone Unity Connection server with the CLI command\nutils cuc activate CUSRSV\nAfter installing Unity Connection SRSV, you can not revert to a standalone Unity Connection server.\nWarning\nAll the existing Unity Connection configurations are lost after running the conversion.\nCaution\nThe unrestricted version of Unity Connection SRSV works only with the unrestricted version of Unity\nConnection (central) server.\nNote\nPost-Installation Tasks\nAfter installing Unity Connection on your server, you should perform the following additional tasks before\nconfiguring the system for your application:\n• Obtain the licenses for the Unity Connection server. For this, you must register the product with Cisco\nSmart Software Manager (CSSM) or Cisco Smart Software Manager satellite.\nFor more information, see the Managing Licenses chapter.\n• (Optional) Change the application passwords.\nYou can change the passwords using either the Cisco Unity Connection Administration web application,\nor you can log into the server and run the CLI command\nutils cuc reset password\n• If you require additional languages, install them.\nFor details, see the Adding or Removing Unity Connection Languages section.\n• Install the Cisco Unified Real-Time Monitoring Tool.\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n27\nInstalling Cisco Unity Connection\nCisco Unity Connection Survivable Remote Site Voicemail Installation\nYou can use Cisco Unified Real-Time Monitoring Tool to monitor system health, and view and collect\nlogs. For more information on RTMT, see the Cisco Unified Real-Time Monitoring Tool Administration\nGuide Release at\nhttp://www\n.cisco.com/c/en/us/support/unified-communications/unified-communications-manager-callmanager/products-maintenance-guides-list.html\n.\n(Optional): You can configure RTMT to send alert notifications through emails to the specified email\naddress. For more information on enabling email alert, see the Enable email alerts section of the Cisco\nUnified Real-Time Monitoring Tool Administration Guide.\n• Activate Unity Connection feature services.\nFor service activation requirements, see the Cisco Unified Serviceability Administration Guide Release\n14 at https://www.cisco.com/c/en/us/td/docs/voice_ip_comm/connection/14/serv_administration/guide/\nb_14cucservag.html\n• Configure the backup settings. For more information, see the Backing Up and Restoring Cisco Unity\nConnection Components chapter.\nPost-Migration Tasks\nNetwork Migration\nAfter successful Install with Data Import in case of Network Migration, perform some additional steps as\ndescribed below:\n1.\nObtain the Licenses for the new Unity Connection server. For configuration of licenses, see the Managing\nLicenses chapter.\nMake sure to de-register the node from which export is performed to free the license consumption and then\nproceed for registration of new imported node.\nNote\n2.\nIf Unity Connection on source release has IPsec configured using a certificate-based authentication, then\nyou must reconfigure the IPsec policy with a CA-signed certificate after successful installation on new\nUnity Connection Server. For more information, see the section Upgrade Considerations with FIPS Mode,\non page 48.\n3.\nIf there is any change in certificates on new Unity connection server then regenerate and upload certificates\non appropriate paths on new Unity Connection server. Some examples are given below:\n• If Unity Connection on source release has Secure SIP call configured using SIP Integration then after\nsuccessful installation, generate and upload RSA based Tomcat certificates on new Unity Connection\nserver. To learn how to regenerate certificates, see section Settings for RSA Key Based certificates\nof Cisco Unified Communications Manager SIP Integration Guide for Cisco Unity Connection\nRelease 14 available at https://www.cisco.com/c/en/us/td/docs/voice_ip_comm/connection/14/\nintegration/cucm_sip/b_14cucintcucmsip.html.\n• If Unity Connection on source release uses tomcat-ECDSA certificates (self signed and third party)\nfor next generation security then after successful installation generate and upload tomcat-ECDSA\ncertificates on new Unity Connection server.To learn how to regenerate certificates, see section\nSettings for EC Key Based certificates of Cisco Unified Communications Manager SIP Integration\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n28\nInstalling Cisco Unity Connection\nPost-Migration Tasks\nGuide for Cisco Unity Connection Release 14 available at https://www.cisco.com/c/en/us/td/docs/\nvoice_ip_comm/connection/14/integration/cucm_sip/b_14cucintcucmsip.html.\n4.\nFor proper functioning of SAML SSO perform below steps:\n• Update the Metadata files of new Unity Connection server for SAML on IdP.\n• Update IdP Metadata file on new Unity Connection server.\nFor more information, see Quick Start Guide for SAML SSO Access available at https://www.cisco.com/\nc/en/us/td/docs/voice_ip_comm/connection/14/quick_start/guide/b_14cucqssamlsso/m_samlssochapter.html.\n5.\nUpdate the new Unity Connection server's FQDN and IP in required telephony configurations on Cisco\nUnified Communications Manager side. For more information, see System Configuration Guide for\nCisco Unified Communications Manager available at https://www.cisco.com/c/en/us/support/\nunified-communications/unified-communications-manager-callmanager/\nproducts-installation-and-configuration-guides-list.html\n6.\nYou must reinstall the set of required locales that are compatible with the new Unity Connection version.\n7.\nChanges done by COP files installed on previous releases does not carry forward with migration and\ntherefore COP files installed on previous release needs to be installed again. After successful migration\nyou must manually install that COP file on new Unity Connection server.\n8.\nIf you want to change Unity Connection SMTP Domain Name, follow steps mentioned in\nhttps://www.cisco.com/c/en/us/support/docs/unified-communications/unity-connection/\n117237-technote-uc-00.html.\n9.\nDefault Partition Name does not change during Migration, hence if you want to change the Partition Name\nto new Name then , follow steps mentioned in https://www.cisco.com/c/en/us/td/docs/voice_ip_comm/\nconnection/14/administration/guide/b_14cucsag/b_14cucsag_chapter_0111.html#ID-2420-000001e5\nSimple Migration\nAfter successful Simple Migration perform below additional steps:\n1.\nObtain the Licenses for the new Unity Connection server. For configuration of licenses, see the Managing\nLicenses chapter.\nMake sure to de-register the node from which export is performed to free the license consumption and then\nproceed for registration of new imported node.\nNote\n2.\nFor successful working of IPSec, restart IPSec service on both the nodes of new Unity Connection server\nusing below CLI:\nutils ipsec restart\n3.\nChanges done by COP files installed on previous releases does not carry forward with migration and\ntherefore COP files installed on previous release needs to be installed again. After successful migration\nyou must manually install that COP file on new Unity Connection server.\n4.\nYou must reinstall the set of required locales that are compatible with the new Unity Connection version.\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n29\nInstalling Cisco Unity Connection\nPost-Migration Tasks\nTroubleshooting Installation Issues\nFollow the steps in this section to troubleshoot issues faced during installation.\n• Examine the log files if you encounter problems during installation. Use the following commands in\nCommand Line Interface to view log files.\nTo obtain a list of install log files from the command line, enter\nCLI>file list install *\nTo view the log file from the command line, enter\nCLI>file view install log_file\nwhere log_file is the log file name.\nYou can also view logs using the Cisco Unified Real-Time Monitoring Tool.\nYou can dump the install logs to the serial port of a virtual machine using the \"Dumping Install Logs\" procedure\nmentioned at\nhttp://docwiki.cisco.com/wiki/How_to_Dump_Install_Logs_to_the_Serial_Port_of_the_Virtual_Machine.\nFor more information on troubleshooting installation issues, see the Troubleshooting Guide for Cisco Unity\nConnection Release 14 available at https://www.cisco.com/c/en/us/td/docs/voice_ip_comm/connection/14/\ntroubleshooting/guide/b_14cuctsg.html.\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n30\nInstalling Cisco Unity Connection\nTroubleshooting Installation Issues\nC H A P T E R 2\nBacking Up and Restoring Cisco Unity\nConnection Components\nYou must take the backup of Cisco Unity Connection components to avoid loosing any data or messages. The\nfollowing are the tools supported for taking the backup or restoring the Unity Connection components:\n• About Cobras, on page 31\n• About Disaster Recovery System, on page 31\n• About System Restore Tool, on page 38\nAbout Cobras\nCisco Unified Backup and Restore Application Suite (COBRAS) is an application used to migrate data and\nmessages. You can take the backup using Export tool and restore the backup data using Import tool.\nFor more information, download the latest version of COBRAS, and view the training videos and Help at\nhttp://www.ciscounitytools.com/Applications/General/COBRAS/COBRAS.html.\nAbout Disaster Recovery System\nThe Disaster Recovery System (DRS) is web application that enables you to take the full backup of Unity\nConnection server components to remote locations using File Transfer Protocol (FTP) or Secure File Transfer\nProtocol (SFTP).\nYou can take the backup of the following Unity Connection server components:\n• Unity Connection configuration database\n• Mailbox messages\n• User greetings and recorded names\n• Other server and platform components\nDRS also provides a restore wizard that enables you to restore the Unity Connection server components from\na backup file stored on an FTP or SFTP server.\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n31\nYou must configure the Unity Connection server with the settings similar to the server of which backup was\ntaken before you can restore the software components.\nNote\nAll the tasks related to Cisco Unified Operating System Administration web interface remain in the locked\nstate when Disaster Recovery System backup or restore is running. This is because DRS locks the operating\nsystem platform API. All the Command Line Interface (CLI) commands continue to work except for the CLI\nbased upgrade command since the platform API is locked.\nThe Disaster Recovery System contains two key components:\n• Master Agent (MA)\n• Local Agent (LA)\nThe Master Agent coordinates the backup and restore activities with Local Agents. The system automatically\nactivates both the Master Agent and the Local Agent on all the servers in the cluster.\nDisaster Recovery System backup tasks can be configured from web interface or Command Line Interface\n(CLI) but configuring from web interface is more preferable. For information on configuring backup tasks\nusing CLI, see the applicable Command Line Interface Reference Guide for Cisco Unified Communications\nSolutions at\nhttp://www\n.cisco.com/c/en/us/support/unified-communications/unified-communications-manager-callmanager/products-maintenance-guides-list.html\nComponents Supported for DRS Backup\nYou can take the backup specific Unity Connection components. The components are listed under Select\nFeatures:\n• CUC: Other Unity Connection server and platform components.\n• CONNECTION_GREETINGS_VOICENAMES: All user greetings and recorded names.\n• CONNECTION_DATABASE: Unity Connection configuration database.\n• CONNECTION_MESSAGES_<MAILBOXSTORENAME>: All messages in the named mailbox store.\n• CONNECTION_HTML_NOTIFICATION: All HTML notification messages.\nSelecting the CONNECTION_GREETINGS_VOICENAMES or CONNECTION_HTML_NOTIFICATION\ncomponent automatically includes the CONNECTION_DATABASE component.\nNote\nYou should take the backup of all the server components when you are taking the backup for the first time,\nchanging the backup device, upgrading the Unity Connection server to higher releases, migrating from physical\nserver to virtual machine, or re-installing the server.\nBackup Files in DRS\nDRS stores the backup of all the server software components in multiple .tar files based on the component\nselected.\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n32\nBacking Up and Restoring Cisco Unity Connection Components\nComponents Supported for DRS Backup\nThe .tar backup file includes an XML file called drfComponent.xml that contains a catalog of all the component\nfiles stored during the backup operation. When DRS performs the next backup operation, it uses the contents\nof this catalog to determine:\n• Whether the number of.tar backup files should exceed the total number of backups you defined for the\nbackup device.\n• The .tar backup file to erase.\nDRS encrypts the .tar backup files using the security password configured during the installation of Unity\nConnection server. If you decide to change this password, perform a full DRS backup immediately. You must\nuse the same security password on the replacement server when performing a restore\noperation.\nCaution\nConfiguring DRS Backup\nIn a cluster deployment, you need to take the backup of publisher server only\nNote\nStep 1\nSet up and configure the FTP or SFTP server(s) used for storing the backups.\nA number of SFTP applications, such as Free FTP and Core FTP mini SFTP server are available that can be used to store\nand retrieve the backups.\nTo configure the FTP or SFTP server, you must define the directory that stores the backup and create an account that\nDRS can use to store and retrieve the backups.\nMake sure there is enough capacity in the directory for the required number and size of backups. Keep in mind\nthat the size of the backups increase as the organization grows.\nNote\nStep 2\nConfigure a backup device in DRS.\nEach DRS backup device consists of the backup location, the FTP or SFTP account credentials, and the total number of\nbackups that can be stored at the backup location. When the total number of allowed backups is reached, DRS overwrites\nthe oldest backup on the server.\nFollow the given steps to configure a backup device:\n• Sign in to Disaster Recovery System and login using the same administrator username and password that you use\nfor Cisco Unified Operating System Administration.\n• Select Backup> Backup Device. The Backup Device window displays. Select Add New.\n• Enter the backup device name, network configuration information and the number of backups to store on network\ndirectory.\n• Select Save to create the backup device.\nDepending on the backup policy and organization, it is advisable to create multiple backup devices for redundancy.\nIf the organization consists of multiple locations, each location should have its own set of backup devices\nNote\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n33\nBacking Up and Restoring Cisco Unity Connection Components\nConfiguring DRS Backup\nDo not use the same network location/directory for different backup devices. Backup files for each Unity Connection\nserver must be stored in a directory dedicated to that server.\nCaution\nStep 3\nConfigure the backup process\nAfter creating the backup device, you can\n• Configure a backup schedule using Configuring a Backup Schedule, on page 34\n• Configure a manual backup using Configuring a Manual Backup, on page 35\nConfiguring a Backup Schedule\nYou can create a different backup schedule for each backup device you created. Backup schedule can be\nconfigured to run the backup at different times. It is recommended to take multiple schedules, each stored on\na different network location.\nIn most of the cases, you should set a schedule that performs a nightly backup during a defined maintenance\nwindow when there is the least amount of server and network traffic.\nYou can configure up to ten backup schedules, each has its own backup device, features, and components.\nDisabling the schedule allows you to prevent the scheduled backups from running without deleting the schedule\nentirely.\nNote\nTo Configure a Backup Schedule for Each Backup Device in Disaster Recovery System\nStep 1\nSign in to Disaster Recovery System and login using the same Administrator username and password that you use for\nCisco Unified Operating System Administration.\nStep 2\nSelect Backup> Scheduler. The Schedule List window displays.\nStep 3\nOn the Schedule List window, select Add New to create a new backup schedule. The Scheduler window displays.\nStep 4\nOn the Scheduler window, the following information are mentioned to configure a schedule:\n• Schedule Name: Specify a schedule name.\n• Select Backup Device: Specify the backup device for which you want to create a schedule.\n• Select Features: Specify the Unity Connection components you want to backup.\n• Starts Backup at: Specify the starting date and time of the schedule.\n• Frequency: Specify the daily, weekly, or monthly cycles of the schedule.\nStep 5\nSelect Save to apply the backup schedule.\nIf you select the Set Default option in the toolbar enables you to configure the backup schedule to perform weekly\nbackups on Tuesday through Saturday.\nNote\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n34\nBacking Up and Restoring Cisco Unity Connection Components\nConfiguring a Backup Schedule\nConfiguring a Manual Backup\nYou can run a manual backup for all components each time you create or change the configuration of a backup\ndevice.\nMake sure to select all the components listed for backup.\nNote\nThe amount of time required to complete the backup depends on the size of the database and the number of\ncomponents selected for backup. The maximum time taken for backup to complete is 20 hours or it gets time\nout.\nStep 1\nSign in to Disaster Recovery System and login using the same Administrator username and password that you use for\nCisco Unified Operating System Administration.\nStep 2\nSelect Backup> Manual Backup. The Manual Backup window displays.\nStep 3\nOn the Manual Backup window,\n• Select Backup Device: Specify the backup device to be used for backup.\n• Select Features: Specify the Unity Connection components you want to backup.\nStep 4\nSelect Start Backup to start the manual backup.\nDRS generates a log file for each component after completing its backup. If an error occurred, you can open the component’s\nlog file to identify the specific error.\nViewing the Backup Status\nTo View the Backup Status in Disaster Recovery System\nStep 1\nSign in to Disaster Recovery System and login using the same Administrator username and password that you use for\nCisco Unified Operating System Administration.\nStep 2\nSelect Backup> Current Status. The Backup Status window displays.\nStep 3\nThe Backup Status window displays the current status of the components selected for backup.\nStep 4\nYou can select Cancel Backup to cancel the backup after the backup of the current component completes.\nViewing the Backup History\nTo View the Backup History in Disaster Recovery System\nStep 1\nSign in to Disaster Recovery System and login using the same Administrator username and password that you use for\nCisco Unified Operating System Administration.\nStep 2\nSelect Backup> History. The Backup History window displays.\nStep 3\nOn the Backup History window you can view the backup history after running a manual backup, to ensure it completed\nsuccessfully.\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n35\nBacking Up and Restoring Cisco Unity Connection Components\nConfiguring a Manual Backup\nStep 4\nYou can select Cancel Backup to cancel the backup after the backup of the current component completes.\nConfiguring DRS Restore\nIn case of Unity Connection cluster, you take the backup of publisher server only. Therefore, you need to\nrestore only on the publisher server.\nTo Restore the Software Components on Unity Connection\nStep 1\nInstall a new Unity Connection server.\nThe new server must be installed with exactly the same software and patches as the server being removed from service,\nand must be configured with the same hostname, IP address, and deployment type (standalone server or cluster pair). For\nexample, the Disaster Recovery System does not allow a restore from version 8.5(1).1000-1 to version 8.5(2).1000-1, or\nfrom version 8.5(2).1000-1 to version 8.5(2).1000-2. (The last parts of the version number change when you install a\nservice release or an engineering special.)\nStep 2\nFollow the given steps after reinstalling Unity Connection:\na)\nConfirm that the IP address and hostname of the server matches the IP address and hostname of the server as it was\nbefore taking the backup.\nb) Confirm that the following settings match the values when taking the server backups:\n• Time zone\n• NTP server\n• NIC speed and duplex settings\n• DHCP settings\n• Primary DNS settings\n• SMTP hostname\n• X.509 Certificate information (Organization, Unit, Location, State, and Country)\nc)\nConfirm that the security password of the server matches the security password of the server as it was before taking\nthe backup.\nDRS encrypts the backup data using security password as the encryption key. If you change the security password\nof the Unity Connection server after the last backup was taken, you need to enter the old security password during\nthe restore process.\nd) If any Unity Connection languages were previously installed, reinstall the same languages on the server.\nStep 3\nOn the new server, log in to Disaster Recovery System (DRS) and recreate the backup device used to store the backups\nfrom the server removed from service.\nStep 4\nFollow the given steps to run the restore operation in DRS:\na)\nSign in to Disaster Recovery System and login using the same administrator username and password that you use for\nCisco Unified Operating System Administration.\nb) Run the Restore Wizard.\nFrom the toolbar, select Restore > Restore Wizard.\nc)\nSelect the backup device you re-created and select Next.\nd) Select the backup .tar file to restore the components and select Next.\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n36\nBacking Up and Restoring Cisco Unity Connection Components\nConfiguring DRS Restore\nDRS time stamps each backup file enabling you to easily select the backup file to use for a restore operation.\nNote\ne)\nSelect the software components to restore and select Next.\nf)\nSelect the specific server to restore each component.\nAdditionally, Unity Connection can perform a file integrity check as part of the restore operation. This is advisable\nto ensure that the files are valid and have not been corrupted during the backup or restore operations.\ng) Select Restore to begin the restore of the selected .tar file to the server.\nAs with the restore operation, you can view the restore operation log file for each restored component.\nAlso as with a restore operation, the time it takes to restore depends on the size of the database and the components\nrestored.\nStep 5\nRestart the new Unity Connection server. In case of a cluster server, reboot the publisher server.\nStep 6\n(Cluster only) Once the publisher reboots, run the following command on Command Line Interface (CLI) on the subscriber\nserver to copy the data from the publisher to the subscriber server:\nutils cuc cluster overwritedb\nStep 7\n(Cluster only) Run the following CLI command on either the publisher or subscriber server to check the status of the\nUnity Connection cluster:\nshow cuc cluster status\nVerify that the status of publisher server is Primary and subscriber server is Secondary. Test and validate it before moving\nit back into production.\nViewing the Restore Status\nTo Check the Restore Status in Disaster Recovery System\nStep 1\nSign in to Disaster Recovery System and login using the same administrator username and password that you use for\nCisco Unified Operating System Administration.\nStep 2\nSelect Restore > Current Status. The Restore Status window displays.\nThe Status column in the Restore Status window shows the percentage of restore process completed.\nStep 3\nTo view the restore log file, select the log filename link.\nViewing the Restore History\nTo View the Restore History in Disaster Recovery System\nStep 1\nSign in to Disaster Recovery System and login using the same Administrator username and password that you use for\nCisco Unified Operating System Administration.\nStep 2\nSelect Restore > History. The Restore History window displays.\nStep 3\nOn the Restore History window, you can view the restores that you have performed, including filename, backup device,\ncompletion date, result, and the features that were restored.\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n37\nBacking Up and Restoring Cisco Unity Connection Components\nViewing the Restore Status\nThe Restore History window displays only the last 20 restore jobs.\nNote\nAbout System Restore Tool\nThe System Restore Tool is a new tool introduced in Unity Connection that allows the administrator to take\neither manual backup or schedule backup at specified intervals of time. The tool creates restore points that\nthe administrator can use to restore data. For example, if the database is corrupted, the data can be restored\nusing restore points.\nTypes of System Restore Points\nThe administrator can create following types of restore points using System Restore Tool:\n• Recent: Allows you to restore the data from the most recent backup stored on the server.\n• Daybefore: Allows you to restore the data from the backup before the recent data backup stored on the\nserver.\n• Temp: Allows you to restore data from the manual backup created at a particular instance of time. The\nadministrator can create the Temp restore point through the run cuc sysrestore backup_temp CLI command\nonly. For more information on the CLI command, see the “run cuc sysrestore backup_temp section” of\nthe Command Line Interface Reference Guide for Cisco Unified Communications Solutions at\nh\nt\nt\np\n:\n/\n/\nw\nw\nw\n.\nc\ni\ns\nc\no\n.\nc\no\nm\n/\nc\n/\ne\nn\n/\nu\ns\n/\nt\nd\n/\nd\no\nc\ns\n/\nv\no\ni\nc\ne\n_\ni\np\n_\nc\no\nm\nm\n/\nc\nu\nc\nm\n/\nc\nl\ni\n_\nr\ne\nf\n/\n1\n0\n_\n5\n_\n2\n/\nC\nU\nC\nM\n_\nB\nK\n_\nC\nA\n8\nD\n6\nD\n4\n0\n_\n0\n0\n_\nc\nu\nc\nm\n-\nc\nl\ni\n-\nr\ne\nf\ne\nr\ne\nn\nc\ne\n-\ng\nu\ni\nd\ne\n-\n1\n0\n5\n2\n/\nC\nU\nC\nM\n_\nB\nK\n_\nC\nA\n8\nD\n6\nD\n4\n0\n_\n0\n0\n_\nc\nu\nc\nm\n-\nc\nl\ni\n-\nr\ne\nf\ne\nr\ne\nn\nc\ne\n-\ng\nu\ni\nd\ne\n-\n1\n0\n5\n2\n_\nc\nh\na\np\nt\ne\nr\n_\n0\n1\n0\n1\n.\nh\nt\nm\nl\n.\nWhenever the data backup is initiated, the data from Recent restore point is copied to Daybefore and current\nrestore point is marked as Recent. This cycle continues with each scheduled backup, which helps in maintaining\nthe integrity of the backup and consuming less space (less than 2GB) to store the restore points efficiently.\nNote\nCreating a Restore Point task\nDo the following tasks to create restore points using System Restore Tool.\n1.\nCreate a user with mailbox with an alias “system-backup-and-restore-admin” and assign him a corporate\nemail id to receive the restore point creation alerts or failure notifications. For more information on how\nto create a user, see Users chapter of System Administration Guide for Cisco Unity Connection Release\n14 at https://www.cisco.com/c/en/us/td/docs/voice_ip_comm/connection/14/administration/guide/b_\n14cucsag.html.\nSkip this task, if such user already exists.\nNote\n2.\nIf you want to schedule automatic backup, enable the Create Backup Restore Point task to automate\nbackup. See Enabling Create Backup Restore Point\n3.\nIf you want to create manual backup, run the run cuc sysrestore backup_tem CLI command.\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n38\nBacking Up and Restoring Cisco Unity Connection Components\nAbout System Restore Tool\nIn case of Unity Connection cluster, take backup of publisher and subscriber server separately.\nNote\nEnabling Create Backup Restore Point\nDo the following steps to enable the Create Backup Restore Point task for automatic backup.\nStep 1\nSign in to Cisco Unity Connection Administration.\nStep 2\nNavigate to Tools > Task Management and select Create Backup Restore Point.\nStep 3\nGo to Edit and select Task Schedules.\nStep 4\nOn the Task Schedules page, enter the required information to schedule the task.\nStep 5\nClick Save to apply the settings.\nRestoring Data using Restore Points task\nThe administrator can restore data using restore points created through System Restore Tool.\nDuring restore operation, the tool specifies the timestamp of the restore point, the count of the messages\nagainst the user aliases, and also lists the users which will be lost after restore operation. The user aliases that\nare reported to be lost after restore are the aliases created after the restore point creation.\nNote\nTo restore the data using restore points, run the following CLI command:\nrun cuc sysrestore restore_operation <restore mode> <restore point>\nwhere,\n• restore mode can be database, config, or both\n• restore point can be Recent, Daybefore or Temp\nRestore mode specifies the data that you want to restore. For example, if you specify database as restore mode,\nonly database is restored.\nIf you specify config or both as restore mode, you need to restart the server to restore the data successfully.\nNote\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n39\nBacking Up and Restoring Cisco Unity Connection Components\nEnabling Create Backup Restore Point\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n40\nBacking Up and Restoring Cisco Unity Connection Components\nRestoring Data using Restore Points task\nC H A P T E R 3\nUpgrading Cisco Unity Connection\n• Introduction, on page 41\n• Upgrade Types, on page 41\n• Status of Unity Connection Cluster During an Upgrade, on page 45\n• Duration of Upgrade, on page 46\n• Prerequisites for Upgrade, on page 46\n• Upgrade Considerations with FIPS Mode, on page 48\n• Task list to Upgrade to Unity Connection Shipping Version 14, on page 49\n• Upgrading the Unity Connection Server, on page 52\n• Switching to the Upgraded Version of Unity Connection Software, on page 54\n• Applying COP file from a Network Location, on page 55\n• Rollback of Unity Connection, on page 56\nIntroduction\nYou need to upgrade from the current version of Cisco Unity Connection to a higher version to use the new\nfeatures supported with the new version. When you upgrade a server, the new version of Unity Connection\nis installed in a separate disk partition known as inactive partition. To activate the new version, you need to\nperform switch version. The following are the two ways to switch to the new version:\n• Automatic Switching: Allows you to automatically switch to the new version of Unity Connection as\npart of the upgrade process.\n• Manual Switching: Allows you to manually switch to the new version of Unity Connection after the\nsuccessful completion of upgrade.\nIf you need to revert the server to the previous version, you can rollback to the previous version.\nUpgrade Types\nThe Unity Connection upgrade files are available as ISO images or COP (Cisco Option Package) files. You\ncan use either of the following interfaces to upgrade Unity Connection:\n• Command Line Interface (CLI)\n• Cisco Unified OS Administration web interface.\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n41\nYou must save the COP files on a Network Location FTP/SFTP server accessible during upgrade. ISO image\ncan be saved on a local DVD or on a network location. The performance of the upgrades can be monitored\nthrough CLI or Cisco Unified Operating System Administration interfaces.\nTable 5: Upgrade Matrix for Cisco Unity Connection explains the upgrade types and supported upgrade paths\nfrom one version to another.\nTable 5: Upgrade Matrix for Cisco Unity Connection\nDescription\nUpgrade Path\nUpgrade Type\n• SU is installed on the inactive partition to which you\nlater on.\n• ISO images are non-bootable images not meant for i\nExamples of supported paths:\n• 12.x.x/12.x.xSUx1 to\n12.x.xSUx2\n• 11.x.x/11.x.xSUx1 to\n11.x.xSUx2\nService Update (SU)\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n42\nUpgrading Cisco Unity Connection\nUpgrade Types\nDescription\nUpgrade Path\nUpgrade Type\n• If the operating system version of the Unity Conn\nduring an upgrade, it is referred to as a Refresh U\n• You need the following COP files in same sequen\nbelow before performing this upgrade:\n• ciscocm.enable-sha512sum-2021-signing-ke\n• ciscocm.cuc_upgrade_12_0_v1.3.cop.sgn\n• Select option \"Reboot to upgraded partition\" on G\nto new version if the upgrade is successful\" as \"Y\nproceed with the upgrade.\nOptions \"Do not reboot after upgrade\" on\n\"Switch to new version if the upgrade is s\nas \"No\" on CLI are not supported.If these\nselected, the system will still reboot and pic\nversion.\nNote\nExamples of supported paths:\n• 10.5.2SU10 or earlier to 14\n• 11.5.1SU9 or earlier to 14\nNote\n• For 10.5(1) to 14, you\nmust follow an\nintermediate upgrade\npath. Example: 10.5(1)\nto 11.x or later and then\n11.x or later to 14.\n• Starting with 14SU2\nrelease, upgrades from\nrelease 10.5.2 are\nblocked so a direct\nupgrade attempt will fail\nas an usupported\nupgrade.\nRefresh Upgrade (RU)\n• You need the following COP file before performi\n• ciscocm.cuc_upgrade_12_0_v1.3.cop.sgn\n• Select option \"Reboot to upgraded partition\n\"Switch to new version if the upgrade is succ\non CLI and proceed with the upgrade.\nOptions \"Do not reboot after upgrad\n\"Switch to new version if the upgrad\nset as \"No\" on CLI are not supported.\nare selected, the system will still rebo\nupgraded version.\nNote\nExamples of supported paths:\n• 11.5.1SU10 or later to 14\n• You need the following COP file before performi\n• ciscocm.enable-sha512sum-2021-signing-ke\n• Select option \"Reboot to upgraded partition\n\"Switch to new version if the upgrade is succ\non CLI and proceed with the upgrade.\nOptions \"Do not reboot after upgrad\n\"Switch to new version if the upgrad\nset as \"No\" on CLI are not supported.\nare selected, the system will still rebo\nupgraded version.\nNote\n12.0.1SU4 or earlier to 14\n12.0.1SU5 or later to 14\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n43\nUpgrading Cisco Unity Connection\nUpgrade Types\nDescription\nUpgrade Path\nUpgrade Type\n• No COP file is required for this upgrade path.\n• Select option \"Reboot to upgraded partition\" on GUI\nto new version if the upgrade is successful\" as \"Yes\"\nproceed with the upgrade.\nOptions \"Do not reboot after upgrade\" on GU\n\"Switch to new version if the upgrade is succ\nas \"No\" on CLI are not supported.If these opt\nselected, the system will still reboot and pick th\nversion.\nNote\n• If the operating system version of the Unity Connect\nchange during an upgrade, it is referred to as an Leve\nupgrade.\n• You need the following COP file before performing t\n• ciscocm.enable-sha512sum-2021-signing-key-v\n• The new version is installed on the inactive partition t\ncan switch later on.\n12.5.1SU3 or earlier to 14\nLevel 2 (L2)\n• No COP file is required for this upgrade path.\n12.5.1SU4 or later to 14\n• COP files are installed on the active partition and yo\nuninstall them. Contact Cisco TAC to uninstall COP\nFix for the same version\nCOP file, for more\ninformation, see the\nApplying COP file\nfrom a Network\nLocation\nIf you are upgrading Unity Connection to 14 and later, then after completion of successful upgrade, you must\nreinstall the set of available locales that are compatible with the upgraded version.\nBefore installing locales, you must stop the Connection Conversation Manager and Connection Mixer services\nthrough Cisco Unity Connection Serviceablity page. Otherwise, you may not get the proper installation status\non GUI. It is recommended that you should install the locales on Unity Connection through Command Line\nInterface.\nFor more information on CLI commands, see the Command Line Interface Reference Guide for Cisco Unified\nCommunications Solutions available at https://www.cisco.com/c/en/us/support/unified-communications/\nunified-communications-manager-callmanager/products-maintenance-guides-list.html.\nNote\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n44\nUpgrading Cisco Unity Connection\nUpgrade Types\nAfter successful upgrade to Unity Connection 14, if you need to revert the server to previous software version,\nyou can switch version the software to older version. After that, you can not upgrade the server to any pre 14\nrelease (for example: 11.5(1) or 12.0(1)). In addition to this, If the upgrade from any previous releases to\nUnity Connection 14 fails for any reason, then also you cannot upgrade the server to pre 14 release. To\ntroubleshoot the issue, contact Cisco TAC.\nIf administrator wants to upgrade the server to pre 14 release in above scenarios, fresh cluster rebuild is\nrequired by performing DRS backup and restore before upgrade.\nIf you are upgrading Unity Connection from 11.5(1) or 12.0(1) as base release to 14 and later, then you must\nrename custom role \"Read Only Administrator\" to different name on base release before upgrade.\nCaution\nThe procedure for upgrading Unity Connection to any Service Update (SU), is similar to RU and L2 upgrade.\nNote\nStatus of Unity Connection Cluster During an Upgrade\nWhen a Unity Connection cluster is upgraded, the publisher server is completely disabled for the entire duration\nof upgrade but the subscriber server continues to provide services to users and callers. However, the performance\nof the cluster is affected in the following ways:\n• If the phone system is routing calls to the subscriber server, outside callers and Unity Connection users\ncan leave voice messages but the messages are not immediately delivered to user mailboxes. During\nswitch version on the subscriber server in a cluster, messages that were left on the subscriber server are\ncopied to the publisher server and delivered to user mailboxes.\n• Unity Connection users can use the telephone user interface (TUI) to play messages recorded before the\nupgrade starts but cannot play the messages recorded during the upgrade.\n• Unity Connection may not retain the status of messages. For example, if a user plays a message during\nthe upgrade, the message may be marked as new again after the upgrade. Likewise, if a user deletes a\nmessage during the upgrade, the message may reappear after the upgrade.\n• User can access Unity Connection using clients such as, ViewMail for Outlook, Web Inbox and Jabber\nduring upgrade. However, during switch version, user cannot access these clients. In case of RU, these\nclients are not accessible during complete upgrade..\n• Administrator users can make configuration changes using any of the administration applications, such\nas Cisco Unity Connection Administration and Cisco Unified Operating System Administration during\nupgrade. However, Unity Connection does not allow provisioning and configuration changes through\nadministration applications or VMREST during the switch version. In case of RU, provisioning and\nconfiguration are not allowed in complete upgrade duration.\n• Intrasite, intersite or HTTPS networking with other servers is disabled for the duration of the switch\nversion. Directory changes made on the other servers in the network are not replicated to the server or\ncluster until the switch version is complete.\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n45\nUpgrading Cisco Unity Connection\nStatus of Unity Connection Cluster During an Upgrade\nDuration of Upgrade\nUnder ideal network conditions, an upgrade process takes approximately two hours to complete on each server.\nTherefore, a Unity Connection cluster takes four hours to upgrade to a higher version. Depending on the data\nsize of the server, the switch version process might take some more time.\nIf you are upgrading in a slow network condition, the upgrade process may take longer time than expected.\nIt is always recommended to upgrade Unity Connection during off-peak hours or during a maintenance window\nto avoid service interruptions.\nYou can reduce the duration of upgrade process by asking users to permanently delete items in the deleted\nitems folder before starting the upgrade. This saves time as deleted items are not copied.\nTip\nPrerequisites for Upgrade\nBefore beginning the upgrade process, you must consider the following points for a successful upgrade:\n• Ensure that you have a good network connection to avoid service interruptions during upgrade.\n• You must have a Secure File Transfer Protocol (SFTP) or File Transfer Protocol (FTP) server in place\nwhen upgrading from a network location.\n• Check the current version and determine the version to which you want to upgrade. See the release notes\nof the new version for more information. Release notes are available at\nhttp://www.cisco.com/c/en/us/support/unified-communications/unity-connection/products-release-notes-list.html.\n• Determine if you need COP files depending on the upgrade process. Download the COP and ISO image\nfiles from: http://software.cisco.com/download/navigator.html?mdfid=280082558&i=rm\n• Backup all the existing data. For more information on backup and restore, see the Introduction chapter.\n• Update the following virtual machine settings on both publisher and subscriber server through VMware\nvSphere client:\n1.\nChange the Guest Operating System version to match the requirements of Unity Connection 14. If\nyou are upgrading Unity Connection from 12.0 or any earlier version to release 14, you must change\nthe Guest Operating System before upgrade. If you are upgrading Unity Connection from 12.5(1) or\nlater version to release 14, then guest operating system will remain same.\n2.\nModify the network adapter to use the VMXNET 3 Adapter type.\nFor more information on changing the Guest Operating System and network\nadapter, see the corresponding Readme of the OVA template at\nhttps://software.cisco.com/download/home/283062758/type/282074348/release/\nOVA-14.\nNote\n• Confirm that the status of both publisher and subscriber servers is active and they can answer calls.\nFollow the given steps to confirm the server status in a cluster:\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n46\nUpgrading Cisco Unity Connection\nDuration of Upgrade\nSign in to Cisco Unity Connection Serviceability.\nExpand Tools and select Cluster Management.\nCheck the server status in a cluster.\nIn addition to this, confirm the running state of database replication using the CLI command show cuc\ncluster status.\nAfter confirming the status of publisher server as Primary and subscriber server\nas Secondary, start the upgrade process first on publisher server and then on\nsubscriber server.\nNote\n• Before upgrading to Unity Connection Release 14, rename the notification templates if created with the\nbelow mentioned names.\nDefault_Missed_Call\nDefault_Missed_Call_With_Summary\nDefault_Scheduled_Summary\nDefault_Voice_Message_With_Summary\nDefault_Dynamic_Icons\nDefault_Actionable_Links_Only\nIf not renamed the mentioned notification templates gets replaced with default notification templates of\nrelease 14.\n• Before upgrading to Unity Connection Release 14, make sure the display name of default notification\ndevices is not changed for any of the user. If changed then update notification devices to the default\nname.\nTo check the users whose default notification device name is changed, execute below query:\nrun cuc dbquery unitydirdb SELECT COUNT(*) AS num_sys_notdevices, USR.alias,\nND.subscriberobjectid FROM tbl_notificationdevice AS ND INNER JOIN vw_user USR ON\nND.subscriberobjectid = USR.objectid WHERE ((ND.devicename IN ('Home Phone', 'Work\nPhone', 'Mobile Phone', 'Pager', 'SMTP') AND ND.displayname = ND.devicename) OR\n(ND.devicename='HTML' AND ND.displayname IN ('HTML', 'HTML Missed Call', 'HTML Scheduled\nSummary'))) GROUP BY ND.subscriberobjectid, USR.alias HAVING COUNT(*) != 8\n• Initiate a pre upgrade test before starting the upgrade process using the CLI command\nrun cuc preupgrade test\n• If you have legacy and PLM based licenses in earlier releases, you must migrate the licenses to Cisco\nSmart Software Licensing before upgrade to Unity Connection Release 14. For more information on\nCisco Smart Software Licensing flow in Unity Connection see Managing Licenses chapter of Install,\nUpgrade, and Maintenance Guide for Cisco Unity Connection Release 14.\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n47\nUpgrading Cisco Unity Connection\nPrerequisites for Upgrade\nFor successful upgrade of Unity Connection from 12.0(1) to any higher releases,\nmake sure the system does not exist in Enforcement mode before upgrade.For\nmore information on Enforcement mode, see Enforcement Policy on Unity\nConnection section.\nCaution\n• Unity Connection Release 14 supports ESXi version of 7.0 U1. For more information on Virtual Hardware\nsettings, see https://www.cisco.com/c/dam/en/us/td/docs/voice_ip_comm/uc_system/virtualization/\nvirtualization-cisco-unity-connection.html.\n• The Exchange 2003, 2007, 2010, 2013 is end of support now. Therefore, it is recommended to delete\nthe Unified Messaging Service configured with Exchange 2003 or 2007 or 2010 or 2013 while upgrading\nto Unity Connection Release 14 or later. Now, create a new Unified Messaging Service with supported\nExchange version 2016 or 2019 to avoid any issues while using Unified Messaging Services.\nIn the upgrade logs, it is observed that there is time discrepancy or time jumps\nduring certain intervals. This time jump is an expected behavior since the hardware\nclock is disabled until the system synchronizes with the NTP server.\nNote\nUpgrade Considerations with FIPS Mode\nIf you are performing upgrade with FIPS enabled Unity Connection Release to 14 and later, you must consider\nthe below limitations for a successful upgrade:\n• Before upgrading Unity Connection using FIPS-enabled mode, make sure that the security password\nlength is greater than or equal to 14 characters to meet FIPS compliance.\n• In Unity Connection Release 14, the IPsec policies with DH group key values 1, 2 or 5 are disabled. If\nyou are upgrading Unity Connection to Release 14 with FIPS enabled and IPse configured, then you\nmust perform any one of the given procedure for successful upgrade to Unity Connection 14\n• Delete the previously configured IPsec policies and perform the upgrade. After the upgrade is\ncomplete, reconfigure the IPsec policies with DH groups 14–18.\n• Install the ciscocm_ipsec_groupenhancement_fips_<version>.cop COP file that supports DH\ngroups 14–18, reconfigure the IPsec policies and then perform an upgrade.\nIf you disable the FIPS mode after installing the COP file, the IPsec configuration\npage does not appear.\nNote\n• If you are upgrading Unity Connection which has IPsec configured using a certificate-based authentication\nwith self-signed certificate, then you must reconfigure the IPsec policy with a CA-signed certificate foe\na successful upgrade.\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n48\nUpgrading Cisco Unity Connection\nUpgrade Considerations with FIPS Mode\n• In FIPS mode, if you have configured Unified Messaging with NTLM web authentication mode then\nyou must select a Basic authentication mode before upgrading Unity Connection to 14 and later. NTLM\nweb authentication mode is no longer supported.\n• If you are upgrading from any release of Unity Connection 12.5 in FIPS mode to Unity Connection\n14SU2 and later, make sure to install COP File\nciscocm.ciscossl7_upgrade_CSCwa48315_CSCwa77974_v1.0.k4.cop.sha512 on both nodes of cluster\nbefore upgrade.\nFor more information on FIPS mode, see \"FIPS Compliance in Cisco Unity Connection\" chapter of Security\nGuide for Cisco Unity Connection Release 14 available at https://www.cisco.com/c/en/us/td/docs/voice_ip_\ncomm/connection/14/security/guide/b_14cucsecx.html.\nTask list to Upgrade to Unity Connection Shipping Version 14\nDo the following tasks to upgrade an Unity Connection server:\n1.\nIf you are running the current version of Unity Connection on a physical server then you must replace\nit with a virtual server. See the Migrating a Physical Server to a Virtual Machine.\nIf you are already running the current version on a virtual server, make sure it is compatible with the\nupgraded version. See the Cisco Unity Connection 14 Supported Platform List at https://www.cisco.com/\nc/en/us/td/docs/voice_ip_comm/connection/14/supported_platforms/b_14cucspl.html.\nIf you are performing an L2 upgrade, make sure that the Platform SOAP services are running on both the\nUnity Connection servers to successfully upgrade using Prime Collaboration Deployment. SOAP services\ncan be enabled on both the servers using Cisco Unified Serviceability page. For more information on PCD,\nsee the Cisco Prime Collaboration Deployment Administration Guide at\nhttp://www\n.cisco.com/c/en/us/support/unified-communications/unified-communications-manager-callmanager/products-maintenance-guides-list.html\n.\nNote\n2.\nIf you are upgrading during non business hours, run the following command on the standalone server\nor the publisher server to speed up the upgrade process:\nutils iothrottle disable\nIf you are upgrading during a maintenance window, you can speed up the upgrade by disabling the\nthrottling. This decreases the time required to complete the upgrade but affects Unity Connection\nperformance.\nYou cannot disable throttling during the upgrade process. If you want to disable the throttling process, you\nmust first stop upgrade, disable throttle, and restart the Unity Connection server. Once the server is active\nagain, begin the upgrade process.\nCaution\n3.\nMigrate all the licenses (legacy and PLM based) before you upgrade to Unity Connection 14 server.\nFor more information, see the Migrating Licenses section.\n4.\nConfirm if you require COP file for the upgrade process and download file from\nhttps://software.cisco.com/download/navigator.html?mdfid=280082558&i=rm\n5.\nApply the COP file using the steps listed in the Applying COP file from a Network Location.\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n49\nUpgrading Cisco Unity Connection\nTask list to Upgrade to Unity Connection Shipping Version 14\n6.\nFollow the upgrade process on the standalone server:\n• (RU upgrades only) Upgrade the server by performing the steps mentioned in the Upgrading the\nUnity Connection Server section. The server automatically switches to the new version after\ncompleting the upgrade.\n• ( L2 upgrades only) Upgrade the server using the steps mentioned in the Upgrading the Unity\nConnection Server section. Switch to the upgraded software to complete the upgrade process\nfollowing the steps mentioned in the Switching to the Upgraded Version of Unity Connection\nSoftware section.\n7.\nFollow the upgrade process on the Unity Connection cluster:\n• (RU upgrades only) Upgrade the publisher server following the steps mentioned in the Upgrading\nthe Unity Connection Server section. The server automatically switches to the new version after\ncompleting the upgrade.\nUpgrade the subscriber server following the steps mentioned in the Upgrading the Unity Connection\nServer section. The server automatically switches to the new version after completing the upgrade.\n• ( L2 upgrades only) Upgrade the publisher server using the steps mentioned in the Upgrading the\nUnity Connection Server section.\nIn case of L2 upgrade of a cluster, do not restart or perform switch version on the publisher server before\ncompleting the upgrade on subscriber server otherwise cluster does not function properly.\nCaution\nUpgrade the subscriber server following the steps mentioned in the Upgrading the Unity Connection\nServer section.\nSwitch to the upgraded software first on the publisher server and then on the subscriber server following\nthe steps mentioned in the Switching to the Upgraded Version of Unity Connection Software section.\n8.\nConfirm that publisher server has Primary status and subscriber server has Secondary status.\n9.\nAfter successful upgrade to Unity Connection 14, the product remains in Evaluation Mode until you\nregister the product with CSSM or satellite.\n10.\nIf you are performing an upgrade from a FIPS enabled Unity Connection Release to Unity Connection\n14, make sure to follow the steps for regenerating certificates before using any pre-existing telephony\nintegrations. To learn how to regenerate certificates, see the Regenerating Certificates for FIPS section\nof the \"FIPS Compliance in Cisco Unity Connection\" chapter in Security Guide for Cisco Unity\nConnection Release 14, available at https://www.cisco.com/c/en/us/td/docs/voice_ip_comm/connection/\n14/security/guide/b_14cucsecx.html.\n11.\nIf Secure SIP call is configured on the system using SIP Integration then after successful upgrade,\ngenerate and upload RSA based Tomcat certificates. To learn how to regenerate certificates, see Settings\nfor RSA Key Based certificates section of the \"Setting Up a Cisco Unified Communications Manager\nSIP Trunk Integration\" chapter in Cisco Unified Communications Manager SIP Integration Guide for\nCisco Unity Connection Release 14, available at https://www.cisco.com/c/en/us/td/docs/voice_ip_comm/\nconnection/14/integration/cucm_sip/b_14cucintcucmsip.html.\nVerify that the value entered in X.509 Subject Name field on SIP Trunk Security Profile Configuration page\nof Cisco Unified Communication Manager is the FQDN of the Unity Connection server\nNote\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n50\nUpgrading Cisco Unity Connection\nTask list to Upgrade to Unity Connection Shipping Version 14\n12.\nCisco Unity Connection supports HAProxy which frontends all the incoming web traffic into Unity\nConnection offloading Tomcat. HAProxy sends the request internally to Tomcat via HTTP. For\ninformation on new ports which should be opened after successful upgrade, see chapter IP\nCommunications Required by Cisco Unity Connection in Security Guide for Cisco Unity Connection\nRelease 14, available at https://www.cisco.com/c/en/us/td/docs/voice_ip_comm/connection/14/security/\nguide/b_14cucsecx.html.\n13.\nIf Next Generation Security over HTTPS interface is configured on the system then after successful\nupgrade to Unity Connection 14, the configured settings of HTTPS ciphers get reset. You must\nreconfigure the HTTPS ciphers on Enterprise Parameter page of Cisco Unity Connection Administration\nand restart the Tomcat service.\nIn case of a cluster, you must configure the HTTPS ciphers on publisher server and restart the Tomacat service\non each node to reflect the changes.\nNote\n14.\nIf Specific License Reservation(SLR) mode is enabled on the system, then after successful upgrade to\nUnity Connection Release 14, you must return all reserved licenses to Cisco Smart Software\nManager(CSSM) and reconfigure SLR with new version licenses. For more information on configuration\nof Specific License Reservation in Unity Connection, see the Configuring Specific License Reservation\nin Unity Connection section of the \"Managing Licenses\" chapter in Install, Upgrade, and Maintenance\nGuide for Cisco Unity Connection Release 14 available at https://www.cisco.com/c/en/us/td/docs/voice_\nip_comm/connection/14/install_upgrade/guide/b_14cuciumg.html.\n15.\nCisco Unity Connection supports SAML-based Single Logout (SLO). The SLO allows you to log out\nsimultaneously from all sessions of a browser that you have signed in using Single Sign-on (SSO). SLO\ndoes not close all the running sessions at the same time. If SAML SSO mode is enabled with Microsoft\nADFS 2.0 configuration on the system, then after successful upgrade to Unity Connection Release 14\nyou must follow steps mentioned in section SAML-Based Single Logout (SLO) of Quick Start Guide\nfor SAML SSO Access available at https://www.cisco.com/c/en/us/td/docs/voice_ip_comm/connection/\n14/quick_start/guide/b_14cucqssamlsso.html.\n16.\nTo avoid upgrade related issues it is recommended to run Pre Upgrade COP file before upgrade. The\nCOP file will run a series of tests to check the pre-upgrade health and connectivity of your system. If\nthe COP file highlights issues that need to be addressed, fix them before proceeding with the upgrade.\nAfter sucessful upgrade it is recommended to run Post Upgrade COP file to verify the configuration of\nsystem. Download the COP files from http://software.cisco.com/download/\nnavigator.html?mdfid=280082558&i=rm.\n(Applicable to 12.5SU1, 12.5SU2, 12.5SU3 releases only) For upgrading Unity Connection to release 14, Pre\nand Post Upgrade COP files should be installed via CLI only.\nCaution\n17.\n(Applicable only to Cisco Unity Connection 14SU2 Release) If you are creating a new Intrasite link or\nif there is any existing Intrasite link between two nodes of Unity Connection in FIPS mode with one\nnode on 14SU2 release and other node on any release lower than 14SU2, then only message delivery\nbetween two nodes will work. Object(users, system distribution lists if applicable, partitions, search\nspaces and Unity Connection locations) synchronization is not supported. For object synchronization\nto work, you must upgrade all the Unity Connection nodes in network to 14SU2 release.\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n51\nUpgrading Cisco Unity Connection\nTask list to Upgrade to Unity Connection Shipping Version 14\n18.\nAfter successful upgrade to Unity Connection 14SU2, if you need to perform rollback of server from\n14SU2 to any older release then you must re-register the product with CSSM or satellite using a\nregistration token for successful functioning of Smart Licensing as applicable to the release.\n19.\nIf Secure SMTP is enabled on the system, then after successful upgrade to Unity Connection Release\n14SU2 you must reconfigure the Secure SMTP feature using Cisco Unity Connection Administration.\nFor more information, see Configure SMTP Client Communication section of the chapter \"Messaging\"\nof the System Administration Guide available at https://www.cisco.com/c/en/us/td/docs/voice_ip_comm/\nconnection/14/administration/guide/b_14cucsag.html.\n20.\nCUNI Subscriptions will be removed from Cisco Unity Connection server database, if you perform a\nrefresh upgrade to Unity Connection 14. Make sure to perform re-subscription after successful upgrade\nof the cluster.\n21.\nIf you are performing upgrade to Unity Connection 14 SU3 and later releases from any of the older\nrelease, make sure to reconfigure permissions on Azure Portal after sucessful upgrade. To learn how to\nreconfigure the permissions, see Step 4g of the section \"Task List for Configuring Unified Messaging\nwith Office 365\" of the chapter \"Configuring Unified Messaging\" of the Unified Messaging Guide for\nCisco Unity Connection Release 14 available at https://www.cisco.com/c/en/us/td/docs/voice_ip_comm/\nconnection/14/unified_messaging/guide/b_14cucumgx.html.\nUpgrading the Unity Connection Server\nDo the following steps to upgrade a standalone server or a cluster. In case of a cluster, follow the steps first\non the publisher server and then on the subscriber server.\nStep 1\nDo any one of the following:\n• Copy the ISO file to a folder on an FTP or SFTP server that the Unity Connection server can access.\n• Insert the DVD with the ISO file of the Unity Connection server that you want install into the disk drive of the\nserver.\nStep 2\nSign in to Cisco Unified Operating System Administration.\nStep 3\nFrom the Software Upgrades menu, select Install/Upgrade.\nStep 4\n(Applicable only for subscriber server) (Optional) On the Software Installation/Upgrade page, check the Use download\ncredentials from Publisher check box to use the source configuration provided for the publisher server and move to\nStep 13.\nStep 5\nIn the Source field, select any one of the following:\n• Remote Filesystem: Select this option to upgrade from remoter server and follow this procedure.\n• DVD/CD: Select this option to upgrade from disk drive and move to Step 11.\n• Local Filesystem: Select this option to use the previously downloaded ISO or COP files for the upgrade.\nStep 6\nIn the Directory field, enter the path of the folder that contains the upgrade file.\nIf the upgrade file is located on a Linux or Unix server, you must enter a forward slash (/) at the beginning of the folder\npath. (For example, if the upgrade file is in the upgrade folder, you must enter /upgrade).\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n52\nUpgrading Cisco Unity Connection\nUpgrading the Unity Connection Server\nIf the upgrade file is located on a Windows server, you must use the applicable syntax for an FTP or SFTP server such\nas:\n• The path must begin with a forward slash (/) and contain forward slashes throughout instead of backward slashes\n(\\).\n• The path must start from the FTP or SFTP root folder on the server and must not include a Windows absolute path\nthat starts with a drive letter (for example, C:).\nStep 7\nIn the Server field, enter the server name or IP address.\nStep 8\nIn the User Name field, enter the alias that is used to sign in to the remote server.\nStep 9\nIn the User Password field, enter the password that is used to sign in to the remote server.\nStep 10\nIn the Transfer Protocol field, select the applicable transfer protocol.\nStep 11\nIn the SMTP Server field, enter the IP address of the SMTP server.\nStep 12\nIn the Email Destination field, enter your email address along with the SMTP server.\nStep 13\nSelect Next.\nStep 14\nSelect the upgrade version that you want to install and select Next.\nThe upgrade file is copied to the hard disk of the Unity Connection server. When the file is copied, a screen displaying\nthe checksum value appears.\nStep 15\nVerify the checksum.\nStep 16\nOn the next page, monitor the progress of the upgrade.\nIf you loose your connection with the remote server or close your browser during this step, you may see the\nfollowing warning when you try to view the Software Installation/Upgrade page again:\nWarning: Another session is installing software, click Assume Control to take over the installation. To\ncontinue monitoring the upgrade, select Assume Control.\nTo continue monitoring the upgrade, select Assume Control.\nCaution\nStep 17\nSelect Next.\nDuring the initial phase of upgrade, the Installation Log text box in Cisco Unified Operating System Administration is\nupdated with the information on the progress of the upgrade. To confirm the completion of upgrade, open the console\nof the Unity Connection server and make sure that a message indicating the completion of upgrade appears on the\nscreen along with the login prompt.\nStep 18\nSelect Finish.\nStep 19\nTo verify if the upgrade is successful, run the following CLI commands:\n• show cuc version: Displays the version of Unity Connection server in both active and inactive partitions. The\nupgraded Unity Connection version is in the inactive partition and old version is in the active partition.\n• utils system upgrade status: Displays the status of the upgrade that you performed. This command should display\nthe message for successful upgrade along with the upgraded version.\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n53\nUpgrading Cisco Unity Connection\nUpgrading the Unity Connection Server\nSwitchingtotheUpgradedVersionofUnityConnectionSoftware\nAfter completing the upgrade process, you can select either manual switch version or automatic switch version.\nThe method that you choose depends on the type of upgrade that you are doing. During the upgrade process,\nthe wizard prompts you to choose whether to switch the software version automatically by rebooting to the\nupgraded partition, or whether to switch the version manually at a later time.\nAutomatic Switching\nThe table below lists the automatic switching method to use for each type of upgrade.\nResult\nWhen prompted, choose...\nUpgrade Type\nWhen you choose this option, the\nsystem reboots to the new software\nversion.\nGUI: Reboot to upgraded partition\nCLI: Switch to new version after\nupgrade\nL2 Upgrade\nChoose this option to use the new\nupgraded software version\nimmediately following the upgrade.\nOption \"Do not reboot\nafter upgrade\" is not\nsupported on GUI and if\nselected, the system will\nstill reboot and pick the\nupgraded version.\nNote\nGUI: Reboot to upgraded partition\nCLI: Switch to new version after\nupgrade\nRefresh Upgrade\nYou can perform the switch version running the CLI command utils system switch-version. The system\nautomatically reboots after the switch version.\nManual Switching\nIf you select not to automatically switch to the upgraded partition at the end of the upgrade, do the following\nprocedure when you are ready to switch partitions.\nStep 1\nSign in to Cisco Unified Operating System Administration.\nStep 2\nFrom the Settings menu, select Version.\nStep 3\nOn the Version Settings page, select Switch Versions, to start the following activities:\n• Unity Connection services are stopped.\n• Data from the active partition is copied to the inactive partition. Note that the messages are stored in a\ncommon partition, therefore they are not copied.\n• The Unity Connection server restarts and switches to the newer version.\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n54\nUpgrading Cisco Unity Connection\nSwitching to the Upgraded Version of Unity Connection Software\nApplying COP file from a Network Location\nStep 1\nCopy the Cisco Option Package (.cop) file on an FTP or SFTP server that the server can access.\nStep 2\nSign in to Cisco Unified Operating System Administration.\nIf you are upgrading the subscriber server in a Unity Connection cluster, type the following address to access Cisco\nUnified Operating System Administration:\nhttp://<Unity Connection_servername>/cmplatform\nStep 3\nFrom the Software Upgrades menu, select Install/Upgrade.\nStep 4\nOn the Software Installation/Upgrade page, in the Source field, select Remote Filesystem.\nStep 5\nIn the Directory field, enter the path to the folder that contains the .cop file.\nIf the .cop file is located on a Linux or Unix server, you must enter a forward slash (/) at the beginning of the folder\npath. (For example, if the .cop file is in the cop folder, you must enter /cop).\nIf the .cop file is located on a Windows server, you must use the applicable syntax for an FTP or SFTP server such as:\n• The path must begin with a forward slash (/) and contain forward slashes throughout instead of backward slashes\n(\\).\n• The path must start from the FTP or SFTP root folder on the server and must not include a Windows absolute path\nthat starts with a drive letter (for example, C:).\nStep 6\nIn the Server field, enter the server name or IP address.\nStep 7\nIn the User Name field, enter the alias that is used to sign in to the remote server.\nStep 8\nIn the User Password field, enter the password that is used to sign in to the remote server\nStep 9\nIn the Transfer Protocol field, select the applicable transfer protocol and select Next.\nStep 10\nSelect the software that you want to install, and select Next.\nThe .cop file is copied to the virtual hard disk on Unity Connection server. When the file is copied, a screen displays\nthe checksum value.\nStep 11\nVerify the checksum and select Next to begin the installation.\nDuring the upgrade, the value of the Status field is Running. When the upgrade process is complete, the value of the\nStatus field changes to Complete.\n• All command-line interface sessions are terminated automatically.\n• The Cisco Tomcat Service can take several minutes to restart automatically.\nNote\nStep 12\nSign out from the Cisco Unified Operating System Administration application.\nStep 13\nRun the CLI command utils service list to confirm that the Cisco Tomcat service is in the Running state.\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n55\nUpgrading Cisco Unity Connection\nApplying COP file from a Network Location\nRollback of Unity Connection\nAfter upgrading the Unity Connection version, you can rollback to the software version that was running\nbefore the upgrade by switching to the software version on inactive partition.\nIf you revert to the version on the inactive partition in case of RU upgrade rollback from 14 to 12.x or 11.x\nor 10.x versions, you cannot later switch to the newest version again. Instead, you must reinstall the upgrade\nas documented in this guide.\nCaution\nImportant Considerations for Rollback\n1.\nDo not make any configuration changes during the rollback because the changes are lost after the rollback.\n2.\nIn an cluster setup, do not switch versions on both the first and second servers at the same time. Perform\nswitch version on the second server only after you have switched versions on the first server.\n3.\nUsers and mailbox stores that were added after the upgrade, no longer exist after you rollback to the\nversion on inactive partition. The new users and mailbox stores are deleted.\n4.\nAll messages are preserved for Level 2 Upgrade Rollback, but for the users that were added after upgrade,\ntheir messages are orphaned as the users no longer exist after rollback. These messages are moved to the\nundeliverable messages folder. However the messages for Refresh Upgrade Rollback are not preserved\nfor existing users or any new users added after upgrade\n5.\nIf you moved mailboxes from one mailbox store to another after upgrading, those mailboxes are moved\nback to the mailbox stores they were in before the upgrade.\n6.\nA future delivery folder is created for users to mark messages for future delivery. If you revert to a version\nthat supports future delivery but the future delivery folder has not been created for the user as yet, the\nmessages in the future delivery folder for the new version are moved to the undeliverable messages folder.\n7.\n(Unity Connection 8.5 and earlier only) If a user rollbacks to Unity Connection version 8.5 or earlier from\na current version that is 8.6 and higher, then following limitations are faced:\n• No voice messages are left after the rollback.\n• No administrator settings are preserved after the rollback.\n8.\nNo administrator settings are preserved after the rollback.\na.\nRevert to the Guest Operating System version as earlier (before upgrade).\nb.\nModify the network adapter to the adapter type as earlier (if you changed after upgrade).\nRollback Scenarios\nYou can revert a single Unity Connection server or a cluster to the version on inactive partition.\nTo rollback a Unity Connection cluster, you should rollback both the servers, first the publisher and then the\nsubscriber. After the successful rollback of both the publisher and subscriber servers, reset the replication\nbetween the two servers running the following CLI commands:\nStop the replication on subscriber server with the CLI command utils dbreplication stop.\nStop the replication on publisher server with the CLI command utils dbreplication stop.\nReset the replication running the CLI command utils dbreplication reset all on the publisher server.\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n56\nUpgrading Cisco Unity Connection\nRollback of Unity Connection\nAfter the reset of replication between the two servers, check the cluster status running the CLI command show\ncuc cluster status utils system restart on both publisher and subscriber.\nRollback a Unity Connection Server to the Version in the Inactive Partition\nStep 1\nSign in to Cisco Unified Operating System Administration.\nStep 2\nFrom the Settings menu, select Version and the Version Settings window displays.\nStep 3\nSelect the Switch Versions option. After you confirm that you want to restart the system, the system restarts that might\ntake up to 15 minutes.\nStep 4\nFollow the given steps to confirm that the switch version is successful:\na.\nSign in to Cisco Unified Operating System Administration.\nb.\nIn the Settings menu, select Version. The Version Settings window displays the product version.\nc.\nConfirm that the active partition runs the correct version of Unity Connection server and all critical services are in\nthe Running state.\nd. Sign in to Cisco Unity Connection Administration and confirm that the configuration data exists.\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n57\nUpgrading Cisco Unity Connection\nRollback a Unity Connection Server to the Version in the Inactive Partition\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n58\nUpgrading Cisco Unity Connection\nRollback a Unity Connection Server to the Version in the Inactive Partition\nC H A P T E R 4\nConfiguring Cisco Unity Connection Cluster\n• Introduction, on page 59\n• Task List for Configuring a Unity Connection Cluster, on page 59\n• Administering a Unity Connection Cluster, on page 60\n• How a Unity Connection Cluster Works, on page 69\n• Effects of Split Brain Condition in a Unity Connection Cluster, on page 71\nIntroduction\nThe Cisco Unity Connection cluster deployment provides high availability voice messaging through the two\nservers that run the same versions of Unity Connection. The first server in the cluster is the publisher server\nand the second server is the subscriber server.\nTask List for Configuring a Unity Connection Cluster\nDo the following tasks to create a Unity Connection cluster:\n1.\nGather Unity Connection cluster requirements. For more information, see System Requirements for\nCisco Unity Connection Release 14 at https://www.cisco.com/c/en/us/td/docs/voice_ip_comm/connection/\n14/requirements/b_14cucsysreqs.html .\n2.\nInstall the publisher server. For more information, see the Installing the Publisher Server section.\n3.\nInstall the subscriber server. For more information, see the Installing the Subscriber Server section.\n4.\nConfigure the Cisco Unified Real-Time Monitoring Tool for both publisher and subscriber servers to send\nnotifications for the following Unity Connection alerts:\n• AutoFailbackFailed\n• AutoFailbackSucceeded\n• AutoFailoverFailed\n• AutoFailoverSucceeded\n• NoConnectionToPeer\n• SbrFailed\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n59\nFor instructions on setting up alert notification for Unity Connection alerts, see the “Cisco Unified\nReal-Time Monitoring Tool” section of the Cisco Unified Real-Time Monitoring Tool Administration\nGuide for the required release, available at\nhttp://www.cisco.com/c/en/us/support/unified-communications/unity-connection/products-maintenance-guides-list.html.\n5.\n(Optional) Do the following tasks to customize the cluster settings on the publisher server:\nSign in to Cisco Unity Connection Administration.\nExpand System Settings > Advanced and select Cluster Configuration.\nOn the Cluster Configuration page, change the server status and select Save. For more information on\nchanging the server status in a cluster, see Help> This Page.\nAdministering a Unity Connection Cluster\nYou must check the Unity Connection cluster status to ensure that the cluster is correctly configured and\nworking properly. It is also important to understand the different server status in a cluster and the effects of\nchanging a server status in a cluster.\nChecking the Cluster Status\nYou can check the Unity Connection cluster status either using web interface or Command Line Interface\n(CLI).\nSteps to Check the Unity Connection Cluster Status from Web Interface\nStep 1\nSign in to Cisco Unity Connection Serviceability of either publisher or subscriber server.\nStep 2\nExpand Tools and select Cluster Management.\nStep 3\nOn the Cluster Management page, check the server status. For more information about server status, see the Server Status\nand its Functions in a Unity Connection Cluster section.\nSteps to Check Unity Connection Cluster Status from Command Line Interface (CLI)\nStep 1\nYou can run the show cuc cluster status CLI command on the publisher server or subscriber server to check the cluster\nstatus.\nStep 2\nFor more information about server status and its related functions, see the Server Status and its Functions in a Unity\nConnection Cluster section.\nManaging Messaging Ports in a Cluster\nIn a Unity Connection cluster, the servers share the same phone system integrations. Each server is responsible\nfor handling a share of the incoming calls for the cluster (answering phone calls and taking messages).\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n60\nConfiguring Cisco Unity Connection Cluster\nAdministering a Unity Connection Cluster\nDepending on the phone system integration, each voice messaging port is either assigned to a specific server\nor used by both servers. Managing Messaging Ports in a Cluster describes the port assignments.\nTable 6: Server Assignments and Usage of Voice Messaging Ports in a Unity Connection Cluster\nServer Assignments and Usage of Voice Messaging Ports\nIntegration Type\n• The phone system is set up with twice the number of SCCP voicema\nthat are needed to handle the voice messaging traffic. (For examp\nvoicemail port devices are needed to handle all voice messaging t\nvoicemail port devices must be set up on the phone system.)\n• In Cisco Unity Connection Administration, the voice messaging p\nconfigured so that half the number of the ports set up on the phon\nassigned to each server in the cluster. (For example, each server in\nhas 16 voice messaging ports.)\n• On the phone system, a line group, hunt list, and hunt group are c\nenable the subscriber server answer most of the incoming calls fo\n• If one of the servers stops functioning (for example, when it is shu\nmaintenance), the remaining server assumes responsibility of han\nincoming calls for the cluster.\n• When the server that stopped functioning is able to resume its nor\nand is activated, it resumes the responsibility of handling its share\ncalls for the cluster.\nIntegration by Skinny Client Control Protocol\n(SCCP) with Cisco Unified Communications\nManager or Cisco Unified Communications\nManager Express\n• In Cisco Unity Connection Administration, half the number of vo\nports that are needed to handle voice messaging traffic are assigned\nin the cluster. (For example, if 16 voice messaging ports are neede\nall voice messaging traffic for the cluster, each server in the cluste\n8 voice messaging ports.)\n• On the phone system, a route group, route list, and route pattern a\nto distribute calls equally between both servers in the cluster.\n• If one of the servers stops functioning (for example, when it is shu\nmaintenance), the remaining server assumes responsibility of han\nincoming calls for the cluster.\n• When the server that stopped functioning is able to resume its nor\nand is activated, it resumes responsibility of handling its share of i\nfor the cluster.\nIntegration through a SIP Trunk with Cisco\nUnified Communications Manager or Cisco\nUnified Communications Manager Express\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n61\nConfiguring Cisco Unity Connection Cluster\nManaging Messaging Ports in a Cluster\nServer Assignments and Usage of Voice Messaging Ports\nIntegration Type\n• The number of ports set up on the phone system is the same as the nu\nvoice messaging ports on each server in the cluster so that the servers\nthe voice messaging ports. (For example, if the phone system is set up\nvoice messaging ports, each server in the cluster must have the same\nmessaging ports.)\n• On the phone system, a hunt group is configured to distribute calls eq\nboth servers in the cluster.\n• The PIMG/TIMG units are configured to balance the voice messagin\nbetween the servers.\n• If one of the servers stops functioning (for example, when it is shut d\nmaintenance), the remaining server assumes responsibility of handlin\nincoming calls for the cluster.\n• When the server that stopped functioning is able to resume its normal\nand is activated, it resumes responsibility of handling its share of inco\nfor the cluster.\nIntegration through PIMG/TIMG units\n• In Cisco Unity Connection Administration, half the number of voice m\nports that are needed to handle voice messaging traffic are assigned to e\nin the cluster. (For example, if 16 voice messaging ports are needed t\nall voice messaging traffic for the cluster, each server in the cluster ha\nmessaging ports.)\n• On the phone system, a hunt group is configured to distribute calls eq\nboth servers in the cluster.\n• If one of the servers stops functioning (for example, when it is shut d\nmaintenance), the remaining server assumes responsibility of handlin\nincoming calls for the cluster.\n• When the server that stopped functioning is able to resume its normal\nit resumes responsibility of handling its share of incoming calls for th\nOther integrations that use SIP\nStopping All Ports from Taking New Calls\nFollow the steps in this section to stop all the ports on a server from taking any new calls. Calls in progress\ncontinue until the callers hang up.\nUse the Port Monitor page in the Real-Time Monitoring Tool (RTMT) to determine whether any port is\ncurrently handling calls for the server. For more information, see the Step Stopping All Ports from Taking\nNew Calls\nStopping All Ports on a Unity Connection Server from Taking New Calls\nTip\nStep 1\nSign in to Cisco Unity Connection Serviceability.\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n62\nConfiguring Cisco Unity Connection Cluster\nStopping All Ports from Taking New Calls\nStep 2\nExpand the Tools menu, select Cluster Management.\nStep 3\nOn the Cluster Management page, under Port Manager, in the Change Port Status column, select Stop Taking Calls for\nthe server.\nRestarting All Ports to Take Calls\nFollow the steps in this section to restart all the ports on a Unity Connection server to allow them take calls\nagain after they were stopped.\nStep 1\nSign in to Cisco Unity Connection Serviceability.\nStep 2\nExpand the Tools menu, select Cluster Management.\nStep 3\nOn the Cluster Management page, under Port Manager, in the Change Port Status column, select Take Calls for the\nserver.\nServer Status and its Functions in a Unity Connection Cluster\nEach server in the cluster has a status that appears on the Cluster Management page of Cisco Unity Connection\nServiceability. The status indicates the functions that the server is currently performing in the cluster, as\ndescribed in Table 7: Server Status in a Unity Connection Cluster.\nTable 7: Server Status in a Unity Connection Cluster\nResponsibilities of the Sever in a Unity Connection Cluster\nServer Status\n• Publishes the database and message store both of which are replicated to the other server\n• Receives replicated data from the other server.\n• Displays and accepts changes to the administrative interfaces, such as Unity Connection A\nand Cisco Unified Operating System Administration. This data is replicated to the other\ncluster.\n• Answers phone calls and takes messages.\n• Sends message notifications and MWI requests.\n• Sends SMTP notifications and VPIM messages.\n• Synchronizes voice messages in Unity Connection and Exchange mailboxes if the unifie\nfeature is configured.\n• Connects with the clients, such as email applications and the web tools available through\nA server with Primary status cannot be deactivated.\nNote\nPrimary\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n63\nConfiguring Cisco Unity Connection Cluster\nRestarting All Ports to Take Calls\nResponsibilities of the Sever in a Unity Connection Cluster\nServer Status\n• Receives replicated data from the server with Primary status. Data includes the database and\nstore.\n• Replicates data to the server with Primary status.\n• Displays and accepts changes to the administrative interfaces, such as Unity Connection Adm\nand Cisco Unified Operating System Administration. The data is replicated to the server wit\nstatus.\n• Answers phone calls and takes messages.\n• Connects with the clients, such as email applications and the web tools available through Ci\nOnly a server with Secondary status can be deactivated.\nNote\nSecondary\n• Receives replicated data from the server with Primary status. Data includes the database and\nstore.\n• Does not display the administrative interfaces, such as Unity Connection Administration an\nUnified Operating System Administration. The data is replicated to the server with Primary\n• Does not answer phone calls or take messages.\n• Does not connect with the clients, such as email applications and the web tools available thr\nCisco PCA.\nDeactivated\n• Does not receive replicated data from the server with Primary status.\n• Does not replicate data to the server with Primary status.\n• Does not display the administrative interfaces, such as Unity Connection Administration an\nUnified Operating System Administration.\n• Does not answer phone calls or take messages.\nA server with Not Functioning status is usually shut down.\nNote\nNot Functioning\n• Receives replicated database and message store from the server with Primary status.\n• Replicates data to the server with Primary status.\n• Does not answer phone calls or take messages.\n• Does not synchronize voice messages between Unity Connection and Exchange mailboxes (\ninbox).\nThis status lasts only a few minutes, after which the server takes the applicable status.\nNote\nStarting\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n64\nConfiguring Cisco Unity Connection Cluster\nServer Status and its Functions in a Unity Connection Cluster\nResponsibilities of the Sever in a Unity Connection Cluster\nServer Status\n• Sends and receives data from the cluster.\n• Does not answer phone calls or take messages for sometime.\n• Does not connect with clients, such as email applications and the web tools available thr\nCisco PCA for sometime.\nThis status lasts only a few minutes, after which the previous status resumes for the se\nNote\nReplicating Data\n• Updates the database and message store on the server that is determined to have Primary\n• Replicates data to the other server.\n• Does not answer phone calls or take messages for sometime.\n• Does not synchronize voice messages between Unity Connection and Exchange mailbox\ninbox is turned on for sometime.\n• Does not connect with clients, such as email applications and the web tools available thr\nCisco PCA for sometime.\nThis status lasts only a few minutes, after which the previous status resumes for the se\nNote\nSplit Brain Recovery\n(After detecting two\nservers with Primary\nstatus)\nChanging Server Status in a Cluster and its Effects\nThe Unity Connection cluster status can be changed either automatically or manually.\nYou can manually change the status of servers in a cluster in the following ways:\n1.\nA server with Secondary status can be manually changed to Primary status. See the Manually Changing\nthe Server Status from Secondary to Primary section.\n2.\nA server with Secondary status can be manually changed to Deactivated status. See the Manually Activating\na Server with Deactivated Status.\n3.\nA server with Deactivated status can be manually activated so that its status changes to Primary or\nSecondary, depending on the status of the other server. See the Manually Activating a Server with\nDeactivated Status section.\nManually Changing the Server Status from Secondary to Primary\nStep 1\nSign in to Cisco Unity Connection Serviceability.\nStep 2\nFrom the Tools menu, select Cluster Management.\nStep 3\nOn the Cluster Management page, from the Server Manager menu, in the Change Server Status column of the server with\nSecondary status, select Make Primary.\nStep 4\nWhen prompted to confirm the change in server status, select OK.\nThe Server Status column displays the changed status when the change is complete.\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n65\nConfiguring Cisco Unity Connection Cluster\nChanging Server Status in a Cluster and its Effects\nThe server that originally had Primary status automatically changes to Secondary status.\nNote\nManually Changing from the Server Status from Secondary to Deactivated\nStep 1\nSign in to the Real-Time Monitoring Tool (RTMT).\nStep 2\nFrom the Cisco Unity Connection menu, select Port Monitor. The Port Monitor tool appears in the right pane.\nStep 3\nIn the Node field, select the server with Secondary status.\nStep 4\nIn the right pane, select Start Polling. Note whether any voice messaging ports are currently handling calls for the server.\nStep 5\nSign in to Cisco Unity Connection Serviceability.\nStep 6\nFrom the Tools menu, select Cluster Management.\nStep 7\nIf no voice messaging ports are currently handling calls for the server, skip to Manually Changing from the Server Status\nfrom Secondary to Deactivated.\nIf there are voice messaging ports that are currently handling calls for the server, on the Cluster Management page, in\nthe Change Port Status column, select Stop Taking Calls for the server and then wait until RTMT shows that all ports\nfor the server are idle.\nStep 8\nOn the Cluster Management page, from the Server Manager menu, in the Change Server Status column for the server\nwith Secondary status, select Deactivate.\nDeactivating a server terminates all the calls that the ports for the server are handling.\nStep 9\nWhen prompted to confirm the change in the server status, select OK.\nThe Server Status column displays the changed status when the change is complete.\nManually Activating a Server with Deactivated Status\nStep 1\nSign in to Cisco Unity Connection Serviceability.\nStep 2\nFrom the Tools menu, select Cluster Management.\nStep 3\nOn the Cluster Management page, in the Server Manager menu, in the Change Server Status column for the server with\nDeactivated status, select Activate.\nStep 4\nWhen prompted to confirm the change in the server status, select OK.\nThe Server Status column displays the changed status when the change is complete.\nEffect on Calls in Progress When Server Status Changes in a Unity Connection Cluster\nWhen the status of a Unity Connection server changes, the effect on calls in progress depend upon the final\nstatus of the server that is handling a call and on the condition of the network. The following table describes\nthe effects:\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n66\nConfiguring Cisco Unity Connection Cluster\nManually Changing from the Server Status from Secondary to Deactivated\nTable 8: Effect on Calls in Progress When Server Status Changes in a Unity Connection Cluster\nEffects\nStatus Change\nWhen the status change is initiated manually, calls in progress are not\naffected.\nWhen the status change is automatic, effect on calls in progress depend on\nthe critical service that stopped.\nPrimary to Secondary\nWhen the status change is initiated manually, calls in progress are not\naffected.\nWhen the status change is automatic, effect on calls in progress depend upon\nthe critical service that stopped.\nSecondary to Primary\nCalls in progress are dropped.\nTo prevent dropped calls, on the Cluster Management page in Cisco Unity\nConnection Serviceability, select Stop Taking Calls for the server and wait\nuntil all the calls get ended and deactivate the server.\nSecondary to Deactivated\nCalls in progress are not affected.\nPrimary or Secondary to\nReplicating Data\nCalls in progress are not affected.\nPrimary or Secondary to Split\nBrain Recovery\nIf network connections are lost, then calls in progress may be dropped depending upon the nature of the\nnetwork problem.\nEffect on Unity Connection Web Applications When the Server Status Changes\nThe functioning of the following web applications is not affected when the server status changes:\n• Cisco Unity Connection Administration\n• Cisco Unity Connection Serviceability\n• Cisco Unity Connection web tools accessed through the Cisco PCA—the Messaging Assistant, Messaging\nInbox, and Personal Call Transfer Rules web tools\n• Cisco Web Inbox\n• Representational state transfer (REST) API clients\nEffect of Stopping a Critical Service on a Unity Connection Cluster\nCritical services are necessary for the normal functioning of the Unity Connection system. The effects of\nstopping a critical service depend upon the server and its status described in the following table:\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n67\nConfiguring Cisco Unity Connection Cluster\nEffect on Unity Connection Web Applications When the Server Status Changes\nTable 9: Effects of Stopping a Critical Service on a Unity Connection Cluster\nEffects\nServer\n• When the server has Primary status, stopping a critical service in Cisco Unity\nConnection Serviceability causes the server status to change to Secondary and\ndegrades the ability of the server to function normally.\nThe status of the subscriber server changes to Primary if it does not have the Disabled\nor Not Functioning status.\n• When the server has Secondary status, stopping a critical service in Cisco Unity\nConnection Serviceability degrades the ability of the server to function normally.\nThe status of the servers does not change.\nPublisher\nWhen the server has Primary status, stopping a critical service in Cisco Unity Connection\nServiceability degrades the ability of the server to function normally. The status of the\nservers does not change.\nSubscriber\nShutting Down a Server in a Cluster\nWhen a Unity Connection server has Primary or Secondary status, it is handles voice messaging traffic and\ncluster data replication. We do not recommend you to shutdown both the servers in a cluster at the same time\nto avoid abrupt termination of the calls and replication that are in progress.\nConsider the following points when you want to shutdown a server in a Unity Connection cluster:\n• Shutdown the server during non business hours when voice messaging traffic is low.\n• Change the server status from Primary or Secondary to Deactivated before shutting down.\nStep 1\nOn the server that does not shut down, sign in to Cisco Unity Connection Serviceability.\nStep 2\nFrom the Tools menu, select Cluster Management.\nStep 3\nOn the Cluster Management page, locate the server that you want to shut down.\nStep 4\nIf the server that you want to shut down has Secondary status, skip to Step 5.\nIf the server that you want to shut down has Primary status, change the status:\na)\nIn the Change Server Status column for the server with Secondary status, select Make Primary.\nb) When prompted to confirm the change in the server status, select OK.\nc)\nConfirm that the Server Status column indicates that the server has Primary status now and that the server you want\nto shut down has Secondary status.\nStep 5\nOn the server with Secondary status (the one you want to shut down), change the status:\na)\nSign in to the Real-Time Monitoring Tool (RTMT).\nb) From the Cisco Unity Connection menu, select Port Monitor. The Port Monitor tool appears in the right pane.\nc)\nIn the Node field, select the server with Secondary status.\nd) In the right pane, select Start Polling.\ne)\nNote whether any voice messaging ports are currently handling calls for the server.\nf)\nIf no voice messaging ports are currently handling calls for the server, skip to Step5g..\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n68\nConfiguring Cisco Unity Connection Cluster\nShutting Down a Server in a Cluster\nIf there are voice messaging ports that are currently handling calls for the server, on the Cluster Management page,\nin the Change Port Status column, select Stop Taking Calls for the server and then wait until RTMT shows that all\nports for the server are idle.\ng) On the Cluster Management page, from the Server Manager menu, in the Change Server Status column for the server\nwith Secondary status, select Deactivate.\nDeactivating a server terminates all calls that the ports for the server are handling.\nCaution\nh) When prompted to confirm the change in the server status, select OK.\ni)\nConfirm that the Server Status column indicates that the server now has Deactivated status.\nStep 6\nShut down the server that you deactivated:\na)\nSign in to Cisco Unity Connection Serviceability.\nb) Expand Tools and select Cluster Management.\nc)\nMake sure that the Server Status column shows Not Functioning status for the server that you shutdown.\nReplacing Servers in a Cluster\nFollow the steps in the given sections to replace publisher or subscriber server in a cluster:\n• To replace the publisher server, see the Replacing a Publisher Server section.\n• To replace the subscriber server, see the Replacing a Subscriber Server section.\nHow a Unity Connection Cluster Works\nThe Unity Connection cluster feature provides high availability voice messaging through two Unity Connection\nservers that are configured in a cluster.\nThe Unity Connection cluster behavior when both the servers are active:\n• The cluster can be assigned a DNS name that is shared by the Unity Connection servers.\n• Clients, such as email applications and the web tools available through the Cisco Personal Communications\nAssistant (PCA) can connect to either of the Unity Connection server.\n• Phone systems can send calls to either of the Unity Connection server.\n• Incoming phone traffic load is balanced between the Unity Connection servers by the phone system,\nPIMG/TIMG units, or other gateways that are required for the phone system integration.\nEach server in a cluster is responsible for handling a share of the incoming calls for the cluster (answering\nphone calls and taking messages). The server with Primary status is responsible for the following functions:\n• Homing and publishing the database and message store that are replicated to the other server.\n• Sending message notifications and MWI requests (the Connection Notifier service is activated).\n• Sending SMTP notifications and VPIM messages (the Connection Message Transfer Agent service is\nactivated).\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n69\nConfiguring Cisco Unity Connection Cluster\nReplacing Servers in a Cluster\n• Synchronizing voice messages between Unity Connection and Exchange mailboxes, if the unified\nmessaging feature is configured (the Unity Connection Mailbox Sync service is activated).\nWhen one of the servers stops functioning (for example, when it is shutdown for maintenance), the remaining\nserver resumes the responsibility of handling all the incoming calls for the cluster. The database and message\nstore are replicated to the other server when its functionality is restored.\nWhen the server that stopped functioning is able to resume its normal functions and is activated, it resumes\nresponsibility of handling its share of incoming calls for the cluster.\nIt is recommended to perform provisioning only on the Publisher server in Active-Active mode and on\nSubscriber (Acting Primary) in case of cluster failover. The password change and password setting modification\nfor User PIN/Web application should be provisioned on Publisher server in Active-Active mode.\nNote\nTo monitor the server status, the Connection Server Role Manager service runs in Cisco Unity Connection\nServiceability on both the servers. This service performs the following functions:\n• Starts the applicable services on each server, depending on server status.\n• Determines whether critical processes (such as voice message processing, database replication, voice\nmessage synchronization with Exchange, and message store replication) are functioning normally.\n• Initiates changes to server status when the server with Primary status is not functioning or when critical\nservices are not running.\nNote the following limitations when the publisher server is not functioning:\n• If the Unity Connection cluster is integrated with an LDAP directory, directory synchronization does\nnot occur, although authentication continues to work when only the subscriber server is functioning.\nWhen the publisher server is resumes functioning, directory synchronization also resumes.\n• If a digital or HTTPS network includes the Unity Connection cluster, directory updates do not occur,\nalthough messages continue to be sent to and from the cluster when only the subscriber server is\nfunctioning. When the publisher server is functioning again, directory updates resume.\nThe Connection Server Role Manager service sends a keep-alive events between the publisher and subscriber\nservers to confirm that the servers are functioning and connected. If one of the servers stops functioning or\nthe connection between the servers is lost, the Connection Server Role Manager service waits for the keep-alive\nevents and may require 30 to 60 seconds to detect that the other server is not available. While the Connection\nServer Role Manager service is waiting for the keep-alive events, users signing in to the server with Secondary\nstatus are not able to access their mailbox or send messages, because the Connection Server Role Manager\nservice has not yet detected that the server with Primary status (which has the active message store) is\nunavailable. In this situation, callers who attempt to leave a message may hear dead air or may not hear the\nrecording beep.\nIt is recommended to import and delete the LDAP users from the publisher node only.\nNote\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n70\nConfiguring Cisco Unity Connection Cluster\nHow a Unity Connection Cluster Works\nEffects of Split Brain Condition in a Unity Connection Cluster\nWhen both the servers in a Unity Connection cluster have Primary status at the same time (for example, when\nthe servers have lost their connection with each other), both servers handle the incoming calls (answer phone\ncalls and take messages), send message notifications, send MWI requests, accept changes to the administrative\ninterfaces (such as Unity Connection Administration), and synchronize voice messages in Unity Connection\nand Exchange mailboxes if single inbox is turned on. However, the servers do not replicate the database and\nmessage store to each other and do not receive replicated data from each other.\nWhen the connection between the servers is restored, the status of the servers temporarily changes to Split\nBrain Recovery while the data is replicated between the servers and MWI settings are coordinated. During\nthe time when the server status is Split Brain Recovery, the Connection Message Transfer Agent service and\nthe Connection Notifier service (in Cisco Unity Connection Serviceability) are stopped on both servers, so\nUnity Connection does not deliver any messages and does not send any message notifications. The Connection\nMailbox Sync service is also stopped, so Unity Connection does not synchronize voice messages with Exchange\n(single inbox). The message stores are also briefly dismounted, so that Unity Connection tells users who are\ntrying to retrieve their messages at this point that their mailboxes are temporarily unavailable.\nWhen the recovery process is complete, the Connection Message Transfer Agent service and the Connection\nNotifier service are started on the publisher server. Delivery of the messages that arrived while during the\nrecovery process may take additional time, depending on the number of messages to be delivered. The\nConnection Message Transfer Agent service and the Connection Notifier service are started on the subscriber\nserver. Finally, the publisher server has Primary status and the subscriber server has Secondary status. At this\npoint, the Connection Mailbox Sync service is started on the server with Primary status, so that Unity\nConnection can resume synchronizing voice messages with Exchange if single inbox is turned on.\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n71\nConfiguring Cisco Unity Connection Cluster\nEffects of Split Brain Condition in a Unity Connection Cluster\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n72\nConfiguring Cisco Unity Connection Cluster\nEffects of Split Brain Condition in a Unity Connection Cluster\nC H A P T E R 5\nMaintaining Cisco Unity Connection Server\n• Migrating a Physical Server to a Virtual Machine, on page 73\n• Replacing the Non-Functional Server, on page 76\n• Changing the IP Address or Hostname of a Unity Connection Server, on page 77\n• Adding or Removing Unity Connection Languages, on page 81\n• Removing Unity Connection Language Files, on page 83\nMigrating a Physical Server to a Virtual Machine\nFollow the given tasks to migrate from physical server to a virtual machine:\n• Backup the software component on the physical server. For more information, see the About Cobras\nchapter.\n• Download and deploy the OVA template to create a new virtual machine. For more information, see the\nCreating a Virtual Machine section.\n• Migrating the Unity Connection server on the virtual machine.\n• To replace the publisher server, see the Replacing a Publisher Server section.\n• To replace the subscriber server, see the Replacing a Subscriber Server section.\n• If Unity Connection is installed as a standalone server, restore the software component from the physical\nserver to the virtual machine for which you have taken the back up. For more information, see the\nConfiguring DRS Backup section.\n• (Optional) Install new languages on the replaced server if required or remove the existing languages\nalready installed on the server. For more information, see the Adding or Removing Unity Connection\nLanguages section.\nIf you are deploying Unity Connection networking (Intersite, Intrasite, or HTTPS), see the Networking Guide\nfor Cisco Unity Connection, Release 14, before replacing the Unity Connection server, available at\nhttps://www.cisco.com/c/en/us/td/docs/voice_ip_comm/connection/14/networking/guide/b_14cucnetx.html\n.\nNote\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n73\nReplacing a Publisher Server\nWhile you are upgrading the publisher server in a Unity Connection cluster, the subscriber server continues\nto provide services to the users and callers.\nIn case of a standalone server, replace the server during off-peak hours to avoid call-processing interruptions\nand impact to services.\nNote\nStep 1\nManually change the status of subscriber server to Primary:\na)\nSign in to Cisco Unity Connection Serviceability.\nb) Expand Tools and select Cluster Management.\nc)\nOn the Cluster Management page, from the Server Manager menu, locate the subscriber server and check the following:\n• If the subscriber server status is Primary, skip the remaining steps in this procedure.\n• If the subscriber server status is Secondary, select Make Primary.\n• If the subscriber has Deactivated status, change the status to Secondary and then select Activate. When prompted\nto confirm changing the server status, select OK. After successful activation of the subscriber server, change\nthe status to Primary selecting Make Primary option.\nStep 2\nManually change the status of publisher server to Deactivated:\na)\nSign in to the Real-Time Monitoring Tool and select Port Monitor.\nb) In the Node field, select the publisher server and then select Start Polling. Note whether any voice messaging ports\nare currently handling calls for the server.\nc)\nReturn to the Cluster Management page of Cisco Unity Connection Serviceability and do any one of th following:\n• If no voice messaging ports are currently handling calls for the publisher server, move to the next Step 1.\n• If there are voice messaging ports that are currently handling calls for the publisher server, on the Cluster\nManagement page, in the Port Manager column, select Stop Taking Calls for the publisher server and then wait\nuntil RTMT shows that all the ports for the publisher server are idle.\nd) From the Server Manager menu, in the Change Server Status column for the publisher server, select Deactivate and\nthen select OK.\nStep 3\nInstall the replacement publisher server, see Installing the Publisher Server section.\na)\nShut down the publisher server using the CLI command utils system shutdown. On the Cluster Management page of\nthe subscriber server, the publisher has Not Functioning status.\nb) Install the virtual machine. The following settings on the virtual machine must be same as that on the physical server,\notherwise the transfer of data from the physical server to the virtual machine get failed:\n• Hostname of the server\n• IP address of the server\n• Time zone\n• NTP server\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n74\nMaintaining Cisco Unity Connection Server\nReplacing a Publisher Server\n• DHCP settings\n• Primary DNS settings\n• SMTP hostname\n• X.509 Certificate information (Organization, Unit, Location, State, and Country).\nStep 4\nYou must run the utils disaster_recovery prepare restore pub_from_sub CLI command on the publisher server. This\ncommand handles the tasks to prepare for restore of a publisher node from a subscriber node.\nStep 5\nConfigure the cluster on the replaced publisher server:\na)\nSign in to Cisco Unity Connection Administration on the publisher server.\nb) Expand System Settings and select Cluster.\nc)\nOn the Find and List Servers page, select Add New.\nd) On the New Server Configuration page, in the Hostname/IP Address field, enter the hostname or IP address of the\nsubscriber server. Enter the description and select Save.\nStep 6\nIf Unity Connection is installed as a cluster, you can restore the publisher using the subscriber data.\na)\nRun the utils cuc cluster renegotiate CLI command on the subscriber server. The publisher automatically restarts\nafter running this command.\nb) Run the show cuc cluster status CLI command on the subscriber server to confirm that the new Unity Connection\ncluster is configured correctly.\nIf third-party certificates are deployed in Unity Connection then after successfully replacing the publisher server,\nyou must reconfigure third party certificates for the newly build publisher server. For information on how to\nconfigure the certificates, see Security chapter of Cisco Unified Communications Operating System Administration\nGuide for Cisco Unity Connection Release 14 available at https://www.cisco.com/c/en/us/td/docs/voice_ip_comm/\nconnection/14/os_administration/guide/b_14cucosagx.html.\nNote\nReplacing a Subscriber Server\nWhile you are upgrading the subscriber server in a Unity Connection cluster, the publisher server continues\nto provide services to users and callers.\nStep 1\nManually change the status of publisher server to Primary:\na)\nSign in to Cisco Unity Connection Serviceability.\nb) Expand Tools and select Cluster Management.\nc)\nOn the Cluster Management page, from the Server Manager menu, locate the publisher server and check the following:\n• If the publisher server status is Primary, skip the remaining steps in this procedure.\n• If the publisher server status is Secondary, change the status by selecting Make Primary.\n• If the publisher has Deactivated status, change the status to Secondary and select Activate. A prompt appears\nto confirm the changing of the server status, select OK. After successful activation of the publisher server, change\nthe status to Primary by selecting Make Primary option.\nStep 2\nManually change the status of subscriber server to Deactivated:\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n75\nMaintaining Cisco Unity Connection Server\nReplacing a Subscriber Server\na)\nSign in to the Real-Time Monitoring Tool, expand <Unity Connection> option and select Port Monitor.\nb) In the Node field, select the subscriber server and select Start Polling. Note whether any voice messaging ports are\ncurrently handling calls for the server.\nc)\nReturn to the Cluster Management page of Cisco Unity Connection Serviceability.\n• If no voice messaging ports are currently handling calls for the server, skip to the next step.\n• If there are voice messaging ports that are currently handling calls for the subscriber server, on the Cluster\nManagement page, in the Change Port Status column, select Stop Taking Calls for the subscriber server and\nthen wait until RTMT shows that all ports for the server are idle.\nd) From the Server Manager menu, in the Change Server Status column for the subscriber server, select Deactivate and\nselect OK.\nStep 3\nMake sure that the hostname or IP address of the subscriber server is configured correctly on the publisher server as\nmentioned in Step 1 of replacing a publisher server.\nStep 4\nInstall the replaced subscriber server, see Installing the Publisher Server section.\na)\nShut down the subscriber server using the CLI command utils system shutdown. On the Cluster Management page\nof the publisher server, the subscriber has Not Functioning status.\nb) Reinstall the Unity Connection server. You must specify the same security password of the subscriber server that\nyou are replacing and it should also match the security password for the publisher server. Otherwise, the Unity\nConnection cluster do not function. If you do not know the security password, you can change it on the publisher\nserver before you install the subscriber server using the CLI command set password user.\nStep 5\nCheck the cluster status by running the show cuc cluster status CLI command on the subscriber server.\nIf third-party certificates are deployed in Unity Connection then after successfully replacing the subscriber server,\nyou must reconfigure third party certificates for the newly build subscriber server. For information on how to\nconfigure the certificates, see Security chapter of Cisco Unified Communications Operating System Administration\nGuide for Cisco Unity Connection Release 14 available at https://www.cisco.com/c/en/us/td/docs/voice_ip_comm/\nconnection/14/os_administration/guide/b_14cucosagx.html.\nNote\nReplacing the Non-Functional Server\nReplacing the Non-Functional Server\nProcedure\nTasks\n• Recreate the virtual machine. For more\ninformation, see the Creating a Virtual Machine\nsection.\n• Restore the software. For more information, see\nthe Configuring DRS Restore section.\nIf Unity Connection is installed as standalone.\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n76\nMaintaining Cisco Unity Connection Server\nReplacing the Non-Functional Server\nProcedure\nTasks\n• Recreate the virtual machine. For more\ninformation, see the Creating a Virtual Machine\nsection.\n• Replace the Publisher server, see the Replacing\na Publisher Server section.\nIf Unity Connection is installed as a cluster and\npublisher is not functioning.\nInstall the subscriber server, see the Installing the\nSubscriber Server section.\nIf Unity Connection is installed as a cluster and\nsubscriber is not functioning.\n• Replace the publisher server, see Installing the\nPublisher Server section.\n• Restore the software components on the physical\nmachine. For more information, see the\nConfiguring DRS Restore section.\n• Configure cluster on the publisher sever:\n• Replace the subscriber server, see the\nInstalling the Subscriber Server section.\n• Check the cluster status using CLI\ncommand show cuc cluster status.\n• Synchronize MWIs on each phone system.\nIf both the servers are not functioning in a cluster.\nChanging the IP Address or Hostname of a Unity Connection\nServer\nBefore changing the IP address of a standalone Unity Connection server or a cluster, you need to determine\nwhether the server is defined by hostname or IP address.\nYou can also use Cisco Prime Collaboration Deployment for readdressing. For more information on Cisco\nPCD, see http://www.cisco.com/c/en/us/products/cloud-systems-management/prime-collaboration/index.html.\nNote\nDetermine Whether Unity Connection is Defined by Hostname or IP Address\nStep 1\nSign in to Cisco Unity Connection Administration of the server of which the IP address needs to be changed.\nStep 2\nExpand System Settings and select Cluster.\nYou need to select Cluster even if you want to change the IP address or hostname of a standalone server.\nNote\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n77\nMaintaining Cisco Unity Connection Server\nChanging the IP Address or Hostname of a Unity Connection Server\nStep 3\nSelect Find to locate the server of which you need to change the IP address or hostname:\n• If the value of the Hostname/IP Address column is a hostname, the server is defined by a hostname.\n• If the value of the Hostname/IP Address column is an IP address, the server is defined by an IP address.\nImportant Considerations before Changing the Hostname or IP Address of a\nUnity Connection Server\n1.\nWhen you change the IP address or hostname of the Unity Connection server, make sure to apply the\nsame changes on all the associated components that refer the Unity Connection server by IP address or\nhostname:\n2.\nBookmarks on client computers to the following web applications:\n• Web applications, such as Cisco Personal Communications Assistant and Cisco Unity Connection\nAdministration.\n• Cisco Fax Server\n• Cisco Unified Application Environment\n• Cisco Unified Mobile Advantage\n• Cisco Unified Presence\n• Cisco Unified Personal Communicator\n• Cisco Unity Connection ViewMail for Microsoft Outlook\n• IMAP email clients that access Unity Connection\n• Phone systems and related components, including Cisco EGW 2200, Cisco ISR voice gateway, Cisco\nSIP Proxy Server, Cisco Unified Communications Manager, Cisco Unified Communications Manager\nExpress, and PIMG/TIMG units.\n• RSS readers\n• SMTP smart host\n• Voice messaging systems with which Unity Connection is integrated via VPIM, such as Cisco Unity\nand Cisco Unity Express.\nIf associated components reference the Unity Connection server by IP address\nand if you do not change the IP address as applicable, the components are no\nlonger be able to access Unity Connection.\nCaution\n3.\nYou can change the IP address and hostname of a Unity Connection server or cluster following the steps\nmentioned in the Changing the IP Address or Hostname of a Unity Connection Server or Cluster section.\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n78\nMaintaining Cisco Unity Connection Server\nImportant Considerations before Changing the Hostname or IP Address of a Unity Connection Server\nDo not change the IP address or hostname of a Unity Connection server during business hours.\nCaution\n4.\n(Only in case of changing IP address of a Unity Connection server) If the Unity Connection server is\nconfigured to get an IP address from a DHCP server, you cannot manually change the IP address of the\nserver. Instead, you must do one of the following:\n• Change DHCP/DNS settings from Cisco Unified Operating System Administration> Settings and\nselect the applicable option from IP, and restart Unity Connection by running the CLI command utils\nsystem restart.\n• Disable DHCP on Unity Connection by running the CLI command set network dhcp and then manually\nchange the IP address by doing the procedure given below.\nTo change the IP address or hostname of a Unity Connection cluster, follow the steps mentioned in the\nChanging the IP Address or Hostname of a Unity Connection Server section first on the publisher server and\nthen on the subscriber server.\nNote\nChanging the IP Address or Hostname of a Unity Connection Server or Cluster\nWe can also change IP Address or Hostname of Cisco Unity Connection standalone node or cluster using CLI\n. For more information on CLI usage see https://www.cisco.com/c/en/us/td/docs/voice_ip_comm/cucm/cli_\nref/14_0_1/cucm_b_cli_reference_guide_release_1401/cucm_b_cli_reference_guide_release_1401_chapter_\n0110.html#CUCM_CL_SEB8A06A_00\nNote\nDo the following steps to change the IP address or Hostname of a standalone server or a cluster defined by\nhostname or IP address using GUI. In case of a cluster, follow the steps first on the publisher server and then\non the subscriber server.\nStep 1\nSign in to the standalone server or the publisher server using Real-Time Monitoring Tool. Expand Tools> Alert and\nselect Alert Central. In the Systems tab, make sure the ServerDown is black. If ServerDown is red, then resolve all the\nproblems and change it to black.\nStep 2\nCheck the server status:\na)\nSign in to Cisco Unity Connection Serviceability.\nb) Expand Tools and select Cluster Management.\nc)\nOn the Cluster Management page, check whether server status is Primary or Secondary. If there is any other status\nvalue then resolve the problem.\nStep 3\nCheck the network connectivity and DNS server configuration by running the utils diagnose module validate_network\nCLI command.\nStep 4\nBackup the database using Disaster Recovery System. See the About Cobras chapter.\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n79\nMaintaining Cisco Unity Connection Server\nChanging the IP Address or Hostname of a Unity Connection Server or Cluster\nStep 5\nIf intrasite, HTTPS, and SRSV networking is configured, remove the server from the Unity Connection site. For\ninstructions, see the Networking Guide for Cisco Unity Connection, Release 14, available at https://www.cisco.com/\nc/en/us/td/docs/voice_ip_comm/connection/14/networking/guide/b_14cucnetx.html.\nRe-adding a server to a Unity Connection site can be a time consuming process.\nCaution\nStep 6\nOn a DNS server, change the DNS record of the Unity Connection server to the new IP address. Update both the forward\n(A) and reverse (PTR) records.\nStep 7\n(Applicable only when you change the IP address or Hostname of a standalone server or a cluster defined by an IP\naddress or Hostname) Changing the IP addresses or Hostname of a standalone server or the publisher server in Connection\nAdministration:\na)\nSign in to Cisco Unity Connection Administration.\nIn case of a cluster, you must sign in to the publisher sever and select subscriber server to change the IP\naddress or Hostname of a subscriber server.\nCaution\nb) Expand System Settings, and select Cluster.\nc)\nSelect Find to display a list of servers in the cluster.\nd) Select the name of the standalone server or publisher server.\ne)\nChange the value of the Hostname/IP Address field to the new Hostname/IP address.\nf)\nSelect Save.\nStep 8\nOn the standalone or publisher server, change the IP address, Hostname, and default gateway (if applicable):\na)\nSign in to Cisco Unified Operating System Administration.\nb) From the Settings menu, select IP > Ethernet.\nc)\nIn the Host Information, enter the value of Hostname.\nd) If you want an alternate hostname for the server, run the set web-security CLI command. In the Hostname, change\nthe hostname of the server.\nFor more information on the CLI commands, see the applicable version of the Command Line Interface Reference\nGuide for Cisco Unified Communications Solutions at\nhttp://www.cisco.com/en/US/products/ps6509/prod_maintenance_guides_list.html .\nEnter a certificate signing request. Then download the certificate signing request to the server on which you\ninstalled Microsoft Certificate Services or another application that issues certificates, or download the\nrequest to a server that you can use to send the certificate signing request to an external certification authority\n(CA).\n(In case of SSL certificates created and installed on renamed server) Upload the root certificate and the\nserver certificate to the standalone or publisher server. Follow the steps as mentioned in Security Guide for\nCisco Unity Connection Release 14, available at https://www.cisco.com/c/en/us/td/docs/voice_ip_comm/\nconnection/14/security/guide/b_14cucsecx.html.\nNote\ne)\nIn the Port Information, change the value of the IP Address and Subnet Mask field (if applicable).\nf)\nIf you are moving the server to a different subnet that requires a new default gateway address, change the value of\nthe Default Gateway field in the Gateway Information.\ng) Select Save.\nAfter saving the page, node services will restart automatically. Restarting services ensures the proper update\nfor the changes to take effect. Do not perform any action on the server until the services are up and running. To\ncheck the status of the services, run utils service list CLI command.\nCaution\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n80\nMaintaining Cisco Unity Connection Server\nChanging the IP Address or Hostname of a Unity Connection Server or Cluster\nStep 9\nIf you change the IP address or Hostname of a standalone server, skip to Step 10.\n(Applicable only when you change the IP address or Hostname of a publisher server in case of a cluster) On the\nsubscriber server, change the IP address of the publisher server:\na)\nSign in to Cisco Unified Operating System Administration.\nb) From the Settings menu, select IP > Publisher.\nc)\nChange the IP address of the publisher server.\nd) Select Save.\nStep 10\nSign in to Real-Time Monitoring Tool and confirm that the server is available and running.\nThis completes the process of changing the IP address of the standalone server.\nStep 11\nFor the cluster, repeat Step 1 to Step 9 on subscriber server also.\nThis completes the process of changing the IP address of a cluster.\nAdding or Removing Unity Connection Languages\nAfter installing a new server or on an existing server, you may need to add some new language(s) and remove\nsome already installed languages depending on the user requirement.\nLanguages are not licensed and Unity Connection 14 does not enforce a limit on the number of languages\nyou can install and use. However, the more languages you install, the less hard disk space is available for\nstoring voice messages.\nNote\nTask List for Adding Languages to a Standalone Unity Connection Server\nDo the following tasks to download and install languages in addition to English (United States):\n1.\nDownload the Unity Connection languages that you want to install and do the following steps:\na.\nSign in as a registered user on the following Cisco.com link:\nhttp://tools.cisco.com/support/downloads/pub/Redirect.x?mdfid=278875240.\nb.\nExpand Unified Communications Applications > Voicemail and Unified Messaging > Cisco Unity\nConnection, and select the applicable Unity Connection version.\nc.\nOn the Select a Software Type page, select Cisco Unity Connection Locale Installer.\nd. On the Select a Release page, select the applicable Unity Connection version. The download links\nfor the languages appear on the right side of the page.\ne.\nSelect the name of a file to download. On the Download Image page, note down the MD5 value and\nfollow the on screen prompts to complete the download.\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n81\nMaintaining Cisco Unity Connection Server\nAdding or Removing Unity Connection Languages\nMake sure that the MD5 checksum matches the checksum that is listed on Cisco.com. If the values do not\nmatch, the downloaded file is damaged. Do not attempt to use a damaged file to install software as the results\nis unpredictable. If the MD5 values do not match, download the file again until the value for the downloaded\nfile matches the value listed on Cisco.com.\nNote\n2.\n(Unity Connection cluster only) Make sure that the subscriber server status is Primary and the publisher\nserver status is Secondary in order to install the Unity Connection languages. Follow the given steps:\na.\nSign in to Cisco Unity Connection Serviceability.\nb.\nExpand Tools and select Cluster Management.\nc.\nFor subscriber server, select Make Primary.\n3.\nOn the standalone or publisher server, install the Unity Connection languages that you downloaded. Refer\nInstalling Unity Connection Language Files from Network Location or Remote Server for more details.\n4.\nIf you are using additional languages because you want the Cisco Personal Communications Assistant to\nbe localized: Download and install the corresponding Unity Connection locales on the publisher server.\n5.\n(Unity Connection cluster only) Change the publisher server status to Primary and follow the same steps\non subscriber server to install the same Unity Connection languages that were installed on publisher server.\nInstalling Unity Connection Language Files from Network Location or Remote\nServer\nIn this procedure, do not use the web browser controls (for example, Refresh/Reload) while accessing Cisco\nUnified Operating System Administration. However, you can use the navigation controls in the administration\ninterface.\nStep 1\nStop the Connection Conversation Manager and Connection Mixer services:\na)\nSign in to Cisco Unity Connection Serviceability. Expand Tools menu and select Service Management.\nb) In Critical Services, for the Connection Conversation Manager row, select Stop.\nc)\nWait for the service to stop.\nd) In the Critical Services menu, in the Connection Mixer row, select Stop.\ne)\nWait for the service to stop.\nStep 2\nSign in to Cisco Unified Operating System Administration.\nStep 3\nFrom the Software Upgrades menu, select Install/Upgrade. The Software Installation/Upgrade window appears.\nStep 4\nIn the Source list, select Remote Filesystem.\nStep 5\nIn the Directory field, enter the path of the folder that contains the language file on the remote system.\nIf the language file is located on a Linux or Unix server, you must enter a forward slash at the beginning of the folder\npath. (For example, if the language file is in the languages folder, you must enter /languages.)\nIf the language file is located on a Windows server, make sure that you are connecting to an FTP or SFTP server, and\nuse the appropriate syntax:\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n82\nMaintaining Cisco Unity Connection Server\nInstalling Unity Connection Language Files from Network Location or Remote Server\n• Begin the path with a forward slash (/) and use forward slashes throughout the path.\n• The path must start from the FTP or SFTP root folder on the server, so you cannot enter a Windows absolute path,\nwhich starts with a drive letter (for example, C:).\nStep 6\nIn the Server field, enter the server name or IP address.\nStep 7\nIn the User Name field, enter your user name on the remote server.\nStep 8\nIn the User Password field, enter your password on the remote server.\nStep 9\nIn the Transfer Protocol list, select the applicable option.\nStep 10\nSelect Next.\nStep 11\nSelect the language that you want to install, and select Next.\nStep 12\nMonitor the progress of the download.\nIf you loose your connection with the server or close your browser during the installation process, you may see the\nfollowing message when you try to access the Software Upgrades menu again:\nWarning: Another session is installing software, click Assume Control to take over the installation.\nIf you are sure you want to take over the session, select Assume Control.\nStep 13\nIf you want to install another language,ct Install Another, and repeat all the above steps\nStep 14\nIf you are finished with installing languages: Restart the services:\n• Sign in to Cisco Unity Connection Serviceability.\n• Expand Tools menu and select Service Management.\n• In the Critical Services menu, in the Connection Conversation Manager row, select Start. Wait for the service to\nstart.\n• In the Critical Services menu, in the Connection Mixer row, select Start. Wait for the service to start.\nRemoving Unity Connection Language Files\nStep 1\nSign in to the command line interface as a platform administrator.\nMake sure to stop Connection Conversation Manager and Connection Mixer services before uninstalling the\nlanguages.\nNote\nStep 2\nRun the show cuc locales CLI command to display a list of installed language files.\nStep 3\nIn the command results, find the language that you want to remove, and note the value of the Locale column for the\nlanguage.\nStep 4\nRun the delete cuc locale <code > CLI command to remove the language, where <code> is the value of the Locale\ncolumn that you get in Removing Unity Connection Language Files.\nWhen the command completes, the following information appears:\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n83\nMaintaining Cisco Unity Connection Server\nRemoving Unity Connection Language Files\n<code> uninstalled\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n84\nMaintaining Cisco Unity Connection Server\nRemoving Unity Connection Language Files\nC H A P T E R 6\nManaging Licenses\n• Managing Licenses, on page 85\nManaging Licenses\nOverview\nUnity Connection supports Cisco Smart Software Licensing which is simple and enhanced way for using\nvarious licensed features.Using Cisco Smart Software Licensing, you can manage all the licenses associated\nwith an organization through Cisco Smart Software Manager (CSSM) or Cisco Smart Software Manager\nsatellite. Cisco Smart Software Licensing establishes a pool of licenses or entitlements that can be used across\nyour organization in a flexible and automated manner. This model of licensing provides the visibility of your\nlicenses ownership and consumption. Unity Connection must be registered with the CSSM to use various\nlicensed feature.\nCisco Smart Software Manager enables you to manage all of your Cisco Smart Software Licenses from one\ncentralized website. You can use Cisco Smart Software Manager to:\n• Manage and track licenses\n• Move licenses across virtual account\n• Remove registered product instance\nFor more information about Cisco Smart Software Manager, see https://software.cisco.com/\nCisco Smart Software Manager satellite is a component of Cisco Smart Software Licensing that manages\nproduct registrations and monitoring of smart license usage for Cisco products. If you do not want to manage\nCisco products directly using Cisco Smart Software Manager, either for policy or network availability reasons,\nyou can choose to install the Cisco Smart Software Manager satellite on-premises. Products register and report\nlicense consumption to the Cisco Smart Software Manager satellite as it does on Cisco Smart Software\nManager.\nFor more information about the Cisco Smart Software Manager satellite, see http://www.cisco.com/web/\nordering/smart-software-manager/smart-software-manager-satellite.html.\nCisco Smart Software Licensing is only the way to manage the licenses in Unity Connection.\nNote\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n85\nFor more information on Cisco Smart Software Licensing, see the \"Smart Software Licensing Overview\"\navailable at, http://www.cisco.com/web/ordering/smart-software-licensing/index.html\nDeployment Options\nTo view and manage the licenses, Unity Connection must communicate with the Cisco Smart Software\nManager (CSSM) or Cisco Smart Software Manager satellite.\nFollowing are the options to deploy the Cisco Smart Software Licensing in Unity Connection, listed in an\norder from easiest to use to most secure:\n• Direct Cloud Access: In this option, Unity Connection can directly communicate with CSSM and transfer\nthe usage information over internet. No additional components are required.\nIn this option, Unity Connection must resolve the CSSM server directly through\nDNS.\nNote\n• Direct Cloud Access through an HTTPs Proxy: In this option, Unity Connection directly transfers the\nusage information to CSSM over internet through proxy server.Administrator also provides an option to\nauthenticate the proxy server for secure communication with CSSM. You can enter username and password\nfor authentication of proxy server.\n• Mediated Access through an On-Premises Collector – Connected: In this option, Unity Connection\ncommunicates with on-prem version of CSSM called Cisco Smart Software Manager satellite. Periodically\nsatellite communicates with CSSM using Cisco network and exchange of license information will be\nperformed to keep the databases in synch.\n• Mediated Access through an On-Premises Collector – Disconnected: This option also uses the satellite\nthat is not connected with Cisco network. For synchronization between satellite and CSSM, you will\nmanually exchange the license information files to keep the database in synch.\nLicense hierarchy is supported only with Cisco Smart Software Manager satellite version 6.0.0 and later.\nNote\nTo select the deployment options, see \"Configuring Transport Settings (optional)\" section.\nSmart Account and Virtual Account\nSmart Account is a simple and organized way to manage the product licenses and entitlements. Using this\naccount, you can register, view, and manage your Cisco Software Licenses across your organization.\nAs per the organization requirements, you can create the sub accounts within your Smart Account. The sub\naccounts are known as Virtual Accounts that are collections of licenses and product instances. To manage the\nlicenses, you can create multiple virtual accounts based on the different organization categories such as\ndepartments or locations. Virtual Accounts are maintained by Smart Account administrators. Licenses can be\ntransferred within virtual accounts as per the requirement.\nWhile moving product instance from one virtual account to another, the licenses assosiated with the previous\nvirtual account are not transferred.\nFor more information on how to create and manage the Smart Account and Virtual Account, see \"Cisco Smart\nAccounts\" at http://www.cisco.com/web/ordering/smart-software-manager/smart-accounts.html\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n86\nManaging Licenses\nDeployment Options\nPrerequisites for Configuring Cisco Smart Software Licensing\nTo configure the Cisco Smart Software Licensing in Unity Connection, ensure the following requirements:\n• Understand the Unified Communications (UC) licensing structure. For details, see http://www.cisco.com/\nc/en/us/products/unified-communications/unified-communications-licensing/index.html.\n• A Smart Account and Virtual Account must be created for Unity Connection. For more information, see\n\"Smart Account and Virtual Account\" section.\nIf you upgrade the Unity Connection from any earlier releases to 14, all the licenses(legacy and PLM based)\nused in Unity Connection must be migrated to the CSSM for using Cisco Smart Software Licensing. For more\ninformation, see \"Migrating Licenses\" section.\nNote\nConfiguring Cisco Smart Software Licensing in Unity Connection\nBy default, the Cisco Smart Software Licensing is enabled for Cisco Unity Connection. To use Cisco Smart\nSoftware Licensing, Unity Connection must register with CSSM or satellite. After fresh install, Unity\nConnection remains in Evaluation Mode until it is registered with CSSM or satellite. The Evaluation Period\nof 90 days are provided once in the entire life cycle of the product. As soon as Unity Connection consumes\nlicenses, the Evaluation Period starts.\nIn Evaluation Mode, you cannot enable the encryption on Unity Connection. It means you are not allowed to\nuse the security modules in Unity Connection. To enable the encryption in Unity Connection, you must register\nthe product with CSSM or satellite using token that allows Export-Controlled Functionality. To enable the\nExport Controlled Functionality for the product, see \"Token Creation\" section.\nAfter successfully registering the product with CSSM or satellite, run \"utils cuc encryption enable\" CLI\ncommand to enable the encryption on Unity Connection.\nFor more information on the CLI command, see the Command Line Interface Reference Guide for Cisco\nUnified Solutions for the latest release, available at\nhttp://www\n.cisco.com/c/en/us/support/unified-communications/unified-communications-manager-callmanager/products-maintenance-guides-list.html\nFor more information on the encryption in Cisco Unity Connection, see \"Cisco Unity Connection- Restricted\nand Unrestricted Version\" chapter of the Security Guide for Cisco Unity Connection Release 14 available at\nhttps://www.cisco.com/c/en/us/td/docs/voice_ip_comm/connection/14/security/guide/b_14cucsecx.html.\nIf data plane encryption (e.g. SRTP) has been turned on after registration to CSSM or satellite and the product\nis subsequently deregistered from CSSM or satellite, data plane encryption will continue to be enabled. An\nalarm will be sent warning the administer to disable data plane encryption when unregistered from CSSM or\nsatellite. Data plane encryption will be disabled after a reboot of the product. Note that this encryption behavior,\nimmediately after deregistration, may change in future versions of the product.\nNote\nConfiguring Transport Settings (optional)\nTo deploy the Cisco Smart Licensing in Unity Connection, you can configure the applicable transport settings.\nTo configure the transport settings in Unity Connection, do the following procedure:\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n87\nManaging Licenses\nPrerequisites for Configuring Cisco Smart Software Licensing\nStep 1\nIn Cisco Unity Connection Administration, expand System Settings and select Licenses.\nStep 2\nOn the Licenses page, select View/Edit link under Transport Settings field. A dialog box appears, on which select the\napplicable deployment option for the Smart Licensing. ( For more information, see Help > This Page)\nStep 3\nSelect Save.\nBy default, the Direct option is selected.\nNote\nToken Creation\nYou must create a token to register the product with CSSM or satellite.\nTo create the token, do the following procedure:\nStep 1\nLog in to your Smart Account in Cisco Smart Software Manager at software.cisco.com or Cisco Smart Software Manager\nsatellite.\nStep 2\nSelect the virtual account that contains the licenses for the product.\nStep 3\nIn the General tab of virtual account, select New Token.\nStep 4\nIn the Create Registration Token dialog box, enter the Description and Expire After information and select Create Token.\nStep 5\nTo allow the Export Controlled Functionality for Unity Connection, check the Allow export-controlled functionality\non the products registered with this token check box. By checking the check box, you can enable the encryption for\nthe product registered with this Registration Token.\nThe Smart Account that are entitled to use Export Controlled Functionality can only check the Allow\nexport-controlled functionality on the products registered with this token check box.\nNote\nStep 6\nOnce the token is created, copy the token to register the product.\nFor more information, see software.cisco.com\nRegistering the Unity Connection\nTo register the Unity Connection with CSSM or satellite, do the following procedure:\nStep 1\nLog in to the Cisco Unity Connection Administration.\nStep 2\nExpand System Settings and select Licenses.\nStep 3\nOn the Licenses page, select Register button. A dialog box appears, enter the registration token copied from the CSSM\nor satellite.\nStep 4\nSelect Register.\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n88\nManaging Licenses\nToken Creation\nManaging Cisco Smart Software Licensing\nAfter successful registration of the Unity connection with CSSM or satellite , you can see the usage details\non the Licenses page of the Cisco Unity Connection Administration. You can also manage the licenses by\nperforming the various actions on Cisco Unity Connection Administration.\nTo perform the actions, go to Cisco Unity Connection Administration > System Settings > Licenses. On the\nLicenses page, select any one of the following from the Action menu:\n• Renew Authorization Now: Using this option, you can manually renew the license authorization for all\nthe licenses. However, the licenses are automatically authorized in every 6 hours.\n• Renew Registration Now: After registering with CSSM or satellite, it provides a registration certificate\nto identify the product. This certificate is valid for one year. Using this option, you can manually renew\nthe registration of the product. However, the registration of the product is automatically renewed in every\nsix month.\n• Deregister: Using this option, you can deregister the product from CSSM or satellite. All license\nentitlements used for the product are released back to its virtual account.\n• Reregister: Using this option, you can reregister the product with CSSM or satellite.\nSmart Software Licensing Status\nWhenever Unity Connection communicates with the Cisco Smart Software Manager, there is a transition in\nthe Unity Connection licensing status. The Smart Software Licensing Status provides an overview of license\nusage on the product.\nThe licensing status of the Unity Connection can be categorized as follows:\n• Registration Status\n• Authorization Status\nRegistration Status\nThe different registration status in a Unity Connection server are:\n• Unregistered: The registration status of Unity Connection remains Unregistered until it successfully\nregisters with CSSM or satellite.\n• Registered: Unity Connection is successfully registered with CSSM or satellite.\n• Registration Expired: The registration status of Unity Connection changes to the Registration Expired\nif registration of the product is not renewed within one year. After registration expired, the product goes\nback to the Evaluation Mode and you can use licenses for the remaining days of the Evaluation Period.\nWhen Evaluation Period of the product is expired and the product is still not registered with CSSM or\nsatellite, you can not create or modify the users in Unity Connection.\nAuthorization Status\nThe different authorization status in a Unity Connection server are:\n• Evaluation Mode: The authorization status of fresh installed Unity Connection is Evaluation Mode until\nit registers with CSSM or satellite. In this mode, Unity Connection can use licensed feature except\nSpeechView and SpeechViewPro. The Evaluation Period of 90 days are provided once in the entire life\ncycle of the product. The Evaluation Period of Unity Connection begins as soon as it starts consuming\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n89\nManaging Licenses\nManaging Cisco Smart Software Licensing\nlicenses. After successful registration with CSSM, the Evaluation timer stops. You can further use the\nremaining Evaluation Period when Unity Connection will go in Unregister or Registration Expired state.\n• Evaluation Period Expired: if Unity Connection uses licenses for 90 days without registering with\nCSSM or satellite, the status of Unity Connection changes to Evaluation Period Expired. In this mode,\nuser creation or modification are not allowed.\n• No Licenses in Use: If Unity Connection does not use any licenses, the status changes to No License in\nUse.\n• Authorized: In this state, all the licenses used by Unity Connection are authorized.\n• Out of Compliance: Unity Connection authorization status changes to Out of Compliance either license\nusage exceeds the licenses available in the virtual account of the product or it uses the feature licenses\nthat are not available in the virtual account.\n• Authorization Expired: Unity Connection Authorization status changes to Authorization Expired if\nUnity Connection does not communicate with CSSM or satellite within the authorization time period of\n90 days.\nLicense Reservation in Unity Connection\nCisco Unity Connection provide the following license reservation features:\n1.\nUnity Connection Release 12.5 and later, provides Specific License Reservation feature that allows the\nadministrator to specify and reserve user licenses from the smart account and virtual account against a\nproduct instance. The product instance can use the reserved licenses without communicating usage\ninformation to CSSM.\nIn Specific License Reservation, reserved licenses of a virtual account are moved with the product instance.\nNote\n2.\nUnity Connection Release 14SU1 and later, provides Permanent License Reservation feature that allows\nthe administrator to reserve an entitled permanent license tag from the smart account and virtual account\nagainst a product instance.Administrators need to provision the User Licenses as needed by the Product\ninstance in the Smart Account and Virtual Account. Once the registration has been successfully completed,\nthe product will continue to remain in “authorized” state.\nThis feature is limted to FedRAMP customers. Permanent License Tag can be ordered through Cisco Commerce\nWorkspace and will be provisioned in the Smart Account and Virtual Account after Cisco approval. For\nordering, see Cisco Collaboration Flex Plan 3.0 for FedRAMP Ordering Guide available at\nhttps://www.cisco.com/c/en/us/products/collateral/unified-communications/cisco-collaboration-flex-plan/\nguide-c07-744596.html. After acquiring permanent licenses, customers should operate within the defined\nlimits of license counts which they have purchased.\nNote\nConfiguring Specific License Reservation in Unity Connection\nIn Specific License Reservation, Unity Connection requires a manual exchange of information with CSSM\nfor product configuration and authorization. To configure Specific License Reservation and perform its various\nfunctions, execute the CLI commands in the given below sequence:\n• license smart reservation enable: This command is used to enable the license reservation feature.\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n90\nManaging Licenses\nLicense Reservation in Unity Connection\n• license smart reservation request: This command is used to generate reservation request code for Unity\nConnection.\n• license smart reservation install \"<authorization code>\" or license smart reservation install-file:\nThis command is used to install the license reservation authorization-code generated on the CSSM.\nYou can also perform additional operations by executing the given below CLI commands:\n• license smart reservation return: This command is used to generate a return code. The return code\nmust be entered into the CSSM to return the licenses to the virtual account.\n• license smart reservation cancel: This command is used to cancel the reservation process before the\nauthorization code obtained from CSSM against the product request code is installed.\n• license smart reservation return - authorization \"<authorization code>\": This command is used to\ngenerate a return code using the authorization code specified on the command line. The return code must\nbe entered into the CSSM to return the licenses to the virtual account.\nIn case of a cluster, you can execute the CLI commands only on publisher server.\nNote\nConfiguring Permanent License Reservation in Unity Connection\nIn Permanent License Reservation, Unity Connection requires a manual exchange of information with CSSM\nfor product configuration and authorization. To configure Permanent License Reservation and perform its\nvarious functions, execute the CLI commands in the section Configuring Specific License Reservation in\nUnity Connection, on page 90. These CLI commands are used for reserving Permanent License Tag.\nBelow mentioned CLI is specific to Permanent License Reservation:\n• license smart reservation set license_count: This CLI command is used to specify or update the license\ncount for the system to operate within, when set for Permanent License Reservation. License count set\ndoesn't affect compliance status and is for administrator reference only.License count set can be referred\non the License Management screen. Customers will operate within the defined limits of license counts\nwhich they have purchased.\nIf this CLI is not executed below warning message will be displayed on License Management screen.\n\"Administrator has not specified the license this system would operate within. Please run the CLI command\n\"license smart reservation set license_count\" and complete the Permanent License Reservation process.\"\nIf the customer purchases more licenses in future, administrator can update the\npurchased license count by running the CLI again.\nNote\nFor more information on above CLI commands, see Command Line Interface Reference Guide for Cisco\nUnified Communications Solutions Release 14 available at https://www.cisco.com/c/en/us/support/\nunified-communications/unified-communications-manager-callmanager/products-command-reference-list.html.\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n91\nManaging Licenses\nConfiguring Permanent License Reservation in Unity Connection\nLicense Reservation Status\nWhen Unity Connection manually exchanges information once with the CSSM, there is a transition in the\nUnity Connection license reservation status.\nThe licensing status for Specific License Reservation and Permanent License Reservation of the Unity\nConnection can be categorized as follows:\nRegistration Status\nThe different registration status for Specific License Reservation and Permanent License Reservation in a\nUnity Connection server are:\n• Unregistered: The registration status of Unity Connection remains Unregistered until the product\nreservation request code has been generated.\n• Reservation In Progress: When Unity Connection generates the reservation request code, the licensing\nstatus changes to Reservation in Progress.\n• (Applicable to Specific License Reservation only) Registered - Specific License Reservation: When\nUnity Connection provides reservation request code to CSSM, CSSM generates an authorization code\nfor the product. After successfully installing the authorization code on the product, the licensing status\nchanges to Registered - Specific License Reservation.\n• (Applicable to Permanent License Resrvation only) Registered - Universal License Reservation: When\nUnity Connection provides reservation request code to CSSM, CSSM generates an authorization code\nfor the product. After successfully installing the authorization code on the product, the licensing status\nchanges to Registered - Universal License Reservation.\nAuthorization Status\nThe different authorization status for Specific License Reservation and Permanent License Reservation in a\nUnity Connection server are:\n• Evaluation Mode: Unity Connection remains in Evaluation Mode until the product is not registered\nwith CSSM. In this mode, Unity Connection can use licenses for 90 days.\n• Evaluation Period Expired: When Unity Connection uses licenses for 90 days without registering with\nCSSM, the status of Unity Connection changes to Evaluation Period Expired.\n• No License in Use: When Unity Connection does not use any licenses, the status changes to No License\nin Use.\n• Authorized - Reserved: When all the reserved licenses used by Unity Connection are authorized, the\nstatus changes to Authorized - Reserved.\n• (Not applicable to Permanent License Reservation) Not Authorized - Reserved: When Unity Connection\nlicense usage exceeds the licenses reserved in the virtual account of the product or it uses the feature\nlicenses that are not reserved in the virtual account, the status changes to Not Authorized - Reserved.\nEnforcement Policy on Unity Connection\nWhen Unity Connection goes in either of the below state, it will go in enforcement mode. In this mode, user\ncreation or modification in the user account, Speech Connect Port creation or modification and other licensing\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n92\nManaging Licenses\nLicense Reservation Status\nrelated updates are not allowed in Unity Connection in enforcement mode. However, existing users can send\nor receive the voice mails.\n• Evaluation Period Expired\n• Registration Expired\n• Authorization Expired\n• Out of Compliance with 90 days of overage period expired.\nFor more information on the above states, see \"Smart Software Licensing Status\" section .\nIn case of Specific License Reservation, when Unity Connection goes in either of the below state, it will go\nin enforcement mode.\n• Evaluation Period Expired\n• Not Authorized - Reserved state with 90 days of overage period expired\nFor more information on the above states, see\" License Reservation Status, on page 92\nNote\nIn Evaluation Period Expired and Registration Expired states, Unity Connection generates an alarm to disable\nthe encryption on the product. It is recommended that either you execute the \"utils cuc encryption disable\"\nCLI command to disable the encryption or register the product with CSSM or satellite to further use the\nsecurity modules of the Unity Connection.\nFor more information on the CLI command, see the Command Line Interface Reference Guide for Cisco\nUnified Solutions for the latest release, available at\nhttp://www.cisco.com/c/en/us/support/unified-communications/unity-connection/products-maintenance-guides-list.html\nFor more information on the generated alarm, see Alarm Message Definitions for Cisco Unity Connection\navailable at, https://www.cisco.com/c/en/us/support/unified-communications/unity-connection/\nproducts-system-message-guides-list.html.\nLicenses in Unity Connection Cluster\nIn a Unity Connection cluster, both publisher and subscriber server use licenses but only publisher server is\nallowed to communicate with CSSM or satellite. Whenever the publisher server communicates with CSSM\nor satellite, the licensing status and usage information are updated on both publisher as well as subscriber\nserver. In case, when publisher server stops functioning (for example, when it is shut down for maintenance),\nthe subscriber server can use licenses but the licensing status remains unchanged. If the publisher server fails\nto resume its functioning within 90 days, the user account provisioning is not allowed on subscriber server.\nIn case of a cluster, only publisher server is allowed to perform the following operations:\n• Registration\n• Renew Authorization\n• Renew Registration\n• Deregister\n• Reregister\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n93\nManaging Licenses\nLicenses in Unity Connection Cluster\nAfter successful registration of the publisher server with CSSM or satellite, subscriber server only shows the\nlicensing status and usage details of the product.\nMigrating Licenses\nWhenever you upgrade Cisco Unity Connection from any earlier releases to 14 and later, all licenses (legacy\nand PLM-based) must be migrated to Cisco Smart Software Licensing. Customers with an active Cisco\nSoftware Support Service contract, can convert PLM-based (pre-12.0 versions) licenses to Cisco Smart\nSoftware Licenses through the Cisco Smart Software Manager portal at\nhttps://software.cisco.com/#SmartLicensing-LicenseConversion via License Registration Portal (LRP) at\nhttps://slexui.cloudapps.cisco.com/SWIFT/LicensingUI/Home. Customers can migrate fulfilled, partially\nfulfilled, and unfulfilled PAK's or device-based licenses to Cisco Smart Software licenses. For legacy (pre-9.0\nversions) licenses, customers must send a license migration request to Cisco Licensing Support available at\nhttps://slexui.cloudapps.cisco.com/SWIFT/LicensingUI/html/contact.html. For customers with no service\ncontract in place, upgrade SKU's must be ordered which will fulfill the new Cisco Smart Software licenses\nto their organization's Cisco Smart Account and respective virtual account. Refer the Cisco Collaboration\nOrdering Guide at http://www.cisco.com/c/en/us/partners/tools/collaboration-ordering-guides.html .\nFor more information on Cisco Smart Software Licensing, please visit\nhttp://www.cisco.com/c/en/us/buy/smart-accounts/software-licensing.html.\nIf HTTPS or Legacy networking is deployed in the system, you can migrate the licenses of each node gradually.\nIt will not affect the system functionality.\nAfter upgrading the Unity Connection from any earlier releases to 14, you must register the product with\nCisco Smart Software Manager or Cisco Smart Software Manager satellite.\nNote\nEnabling Encryption in Cisco Unity Connection\nThe Category C customers of Unity Connection can enable the encryption on the restricted version of Cisco\nUnity Connection with both type of licensing – Cisco Smart Software Licensing and Specific License\nReservation. To enable the encryption for export restricted virtual account, you must have CUC Export\nRestricted Authorization Key (PID: CUC-SL-EXRTKY-K9=) license in the virtual account. In addition,\nyou must perform below configuration to enable the encryption for Category C customers.\nEnabling Encryption with Cisco Smart Software Licensing\nDo the following procedure to enable the encryption with Cisco Smart Licensing\n• Register the Unity Connection with CSSM using token created from Category C customer's virtual\naccount.\nUnity Connection does not support Cisco Smart Software satellite as deployment\noption for export restricted virtual account.\nNote\n• Execute Export request CLI license smart export request local\nCUC_Export_Restricted_Authorization_Key on the registered Unity Connection server to install\nExport Restricted Authorization Key.\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n94\nManaging Licenses\nMigrating Licenses\n• Execute utils cuc encryption enable CLI to enable the encryption on the product and restart the required\nservices mentioned in the CLI output.\nYou can also perform additional operations by executing the given below CLI commands:\n• license smart export return local CUC_Export_Restricted_Authorization_Key to return an export\nrestricted feature licenses.\n• license smart export cancel to cancel the automatic retry of previously failed export request or return\nfrom CSSM\nFor more information on CLI commands, see the applicable version of Command Line Interface Reference\nGuide for Cisco Unified Communications Solutions available at\nhttps://www\n.cisco.com/c/en/us/support/unified-communications/unified-communications-manager-callmanager/products-maintenance-guides-list.html\nEnabling Encryption with Specific License Reservation\nTo enable the encryption with Specific License Reservation, you must reserve the CUC Export Restricted\nAuthorization Key license in virtual account of Category C customer on CSSM.\nFor more information on Export Control Functionality, see \"Cisco Unity Connection- Restricted and\nUnrestricted Version\" chapter of Security Guide for Cisco Unity Connection Release 14 available at\nhttps://www.cisco.com/c/en/us/td/docs/voice_ip_comm/connection/14/security/guide/b_14cucsecx.html.\nLicense Parameters for Unity Connection Features\nBelow table describes the Licence Parameters of Unity Connection feature applicable for Cisco Smart Software\nLicensing and Specific License Reservation.\nTable 10: License Parameters for Unity Connection Features\nDescription\nFeature\nLicense Parameter\nSpecifies the maximum number of voice\nmail users configured in Unity Connection.\nTotal number of voicemail users.\nCUC_BasicMessaging\nSpecifies the maximum number of Unity\nConnection SRSV users configured on\nUnity Connection. The Unity Connection\nSRSV users are reflected under this tag\nonly when the branch is active. This tag\nalso provides the licenses of Basic\nMessaging.\nTotal number of enhanced\nmessaging users.\nCUC_EnhancedMessaging\nSpecifies the maximum number of Speech\nview Standard users configured in Unity\nConnection.\nTotal number of speech view\nstandard users.\nCUC_SpeechView\n(Not applicable for Specific\nLicense Reservation)\nSpecifies the maximum number of Speech\nview Professional users configured in\nUnity Connection.\nTotal number of speech view\nprofessional users.\nCUC_SpeechViewPro\n(Not applicable for Specific\nLicense Reservation)1\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n95\nManaging Licenses\nLicense Parameters for Unity Connection Features\nDescription\nFeature\nLicense Parameter\nSpecifies the maximum number of\nsimultaneous voice recognition sessions\nand Text to Speech (TTS) sessions allowed\nin Unity Connection.\nTotal number of speech connect\nports.\nCUC_SpeechConnectPort\nSpecifes the maximum number of local\ncontacts, along with VPIM contacts\ncreated from Non Unity Connection\nServer.\nTotal number of Contacts.\nCUC_SpeechConnectGuestUser2\n1 SpeechViewPro has already been announced EOL. For more information, see https://www.cisco.com/\nc/en/us/products/collateral/unified-communications/unity-connection/speechview-professional-eol.html.\n2 To avail this functionality, customers are currently not required to acquire the Speech Connect Guest\nUser licenses.\nCisco Smart Software Licensing supports license hierarchy, in which higher level licenses are utilized to fulfill\nthe request for lower level licenses to avoid a shortage of the licenses.\nReserving entitlement tags of higher release on 12.x is not allowed. You can only borrow higher level licenses\non 12.x at CSSM as per license hierarchy.\nNote\nFollowing are the licenses included in license hierarchy in an order from higher level to lower level\n• Unity Connection Enhanced Messaging User Licenses (12.x)\n• Unity Connection Basic Messaging User Licenses (12.x)\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n96\nManaging Licenses\nLicense Parameters for Unity Connection Features\nC H A P T E R 7\nManaging Cisco Unity Connection using Cisco\nPrime Collaboration\nCisco Unity Connection supports Cisco Prime Collaboration Deployment for installation, L2 upgrade and\nmaintenance of Unity Connection.\nFor detailed information on Cisco Prime Collaboration Deployment, see\nhttp://www\n.cisco.com/c/en/us/support/unified-communications/unified-communications-manager-callmanager/products-maintenance-guides-list.html\n.\n• Managing Cisco Unity Connection using Cisco Prime Collaboration, on page 97\nManaging Cisco Unity Connection using Cisco Prime\nCollaboration\nCisco Unity Connection supports Cisco Prime Collaboration Deployment for installation, L2 upgrade and\nmaintenance of Unity Connection.\nFor detailed information on Cisco Prime Collaboration Deployment, see\nhttp://www\n.cisco.com/c/en/us/support/unified-communications/unified-communications-manager-callmanager/products-maintenance-guides-list.html\n.\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n97\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\n98\nManaging Cisco Unity Connection using Cisco Prime Collaboration\nManaging Cisco Unity Connection using Cisco Prime Collaboration\nI N D E X\nA\nalerts, setting up notification of server status changes\n59\nC\ncalls in progress, effects of changing server status\n66\nchanging\n60\ncluster settings\n60\ncluster\n69\nhow one works\n69\nCluster Configuration page, changing settings\n60\nConnection Server Role Manager service, about\n70\ncritical service, effects of stopping\n67\ncustomizing cluster settings\n60\nD\ndatabase replication\n69\nE\neffects\n66–67, 71\nof a split-brain condition\n71\nof stopping a critical service\n67\non calls in progress when server status changes\n66\nL\nlanguages\n81\nadding to a Connection server (no cluster) (task list)\n81\nM\nmessage store replication\n69\nmonitoring server status\n70\nN\nnotification of server status change alerts, setting up\n59\nP\nports\n60\nassignments of voice messaging to each server\n60\nR\nreplication\n69\nof database and message store\n69\nof voice messages\n69\nS\nserver status changes, setting up notification of\n59\nservers\n60, 63, 66, 68, 70\nassignments of voice messaging ports\n60\neffects on calls in progress when status changes\n66\nshutting down\n68\nstatus functions in cluster\n63\nstatus monitoring\n70\nsetting up notification of server status change alerts\n59\nsettings, customizing cluster\n60\nshutting down servers\n68\nsplit-brain condition, effects of\n71\nstatus\n63, 70\nof servers\n70\nserver, functions in cluster\n63\nstopping a critical service, effects of\n67\nT\ntask lists\n81\nfor adding languages to a Connection server (no cluster)\n81\nV\nvoice message replication\n69\nvoice messaging ports, assignments to each server\n60\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\nIN-1\nInstall, Upgrade and Maintenance Guide for Cisco Unity Connection Release 14\nIN-2\nINDEX\n"]